{"uuid": "170e254c-813f-4ad5-a1c6-175bae922580", "events": ["UK drafted the EU Counter Terrorism Strategy in 2005", "UK joined the Schengen Information System for information sharing", "Brexit may encourage violent republican dissidents in Northern Ireland"]}
{"uuid": "d946af30-0e7a-4f5d-bbe4-bc46f77d3c58", "events": ["British people voted to leave the European Union on June 24, 2016", "David Cameron announced his resignation as Prime Minister", "David Cameron will attend the European Council next week to explain the decision"]}
{"uuid": "0301392a-4d86-4050-bba5-e81a8687b41a", "events": ["U.K. voters decided to leave the European Union.", "Prime Minister Cameron announced his resignation.", "Sinn Fein called for a referendum on unification with Ireland."]}
{"uuid": "f40503ee-3fa9-4d17-9204-6c68f351ec1f", "events": ["Referendum: UK voted to leave the EU on June 23 (52% to 48%)", "Survey: Pew Research Center indicated some EU countries desire a less centralized Europe", "Vote Division: Scotland voted to remain in the EU (62% to 38%), diverging from the rest of the UK"]}
{"uuid": "99a38386-9bd2-4e95-bd36-71dfb87e9e57", "events": ["UK voted to leave the European Union", "David Cameron resigned as British Prime Minister", "Market plunges occurred globally due to the Brexit vote"]}
{"uuid": "6d0770a0-2d1d-44d0-a7c7-f35768ea0da7", "events": ["Referendum on EU membership: U.K. citizens vote on whether the United Kingdom should remain in or leave the European Union on June 23.", "Pledge of Referendum: Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election in 2013.", "Renegotiation Failure: Cameron's attempt to renegotiate the U.K.'s EU membership terms failed."]}
{"uuid": "03a2a3de-9ffd-437a-a89f-a3ab4247b5f5", "events": ["Referendum held: United Kingdom held a referendum on June 23 to decide whether to leave or remain in the European Union.", "Recommendation made: Christophe Crombez recommended the UK remain in the European Union.", "Potential Consequence: Brexit could trigger other countries to hold referendums."]}
{"uuid": "2e7648b1-3db0-4cbc-8629-21effdd66915", "events": ["British voters elected to leave the European Union (Brexit). Key entities involved: British voters, European Union.", "Nigel Farage admitted a key Leave campaign promise about redirecting EU funds to the national health system was inaccurate. Key entities involved: Nigel Farage, Leave campaign.", "The British pound plummeted and global stocks tanked. Key entities involved: British pound, global stocks. Context: Following the Brexit vote."]}
{"uuid": "1df40ee6-a568-4667-b4aa-19e4f6f415c6", "events": ["COVID-19 pandemic caused over 3.24 million deaths by May 6, 2021 (SARS-CoV-2 infections)", "Lockdowns led to increased domestic violence, hunger, and suicide (victims, abusers, economically vulnerable populations)", "Healthcare system strain caused reduced services for other conditions and subsequent deaths (healthcare system, patients with non-COVID conditions)"]}
{"uuid": "6c0e1e12-9a72-4545-a44e-28026a9be148", "events": ["WHO declared COVID-19 a pandemic on March 11, 2020, impacting global health and humanitarian efforts.", "Border closures and travel restrictions implemented by countries globally are disrupting humanitarian aid delivery and preventing the movement of asylum seekers and refugees.", "COVID-19 outbreak is overwhelming healthcare systems and disproportionately impacting vulnerable populations, including refugees, asylum seekers, and IDPs, due to factors like high population density, limited access to healthcare, and underlying health conditions."]}
{"uuid": "e7aa8410-8821-4ade-bdbd-2ab1f948e919", "events": ["COVID-19 pandemic: Caused lockdowns, terrified citizens, and triggered a financial meltdown, demanding immediate response and long-term planning.", "Planetary Crises Increase: Deforestation, biodiversity loss, and climate change increase pandemic risk and exacerbate existing economic models.", "Economic Transformation Advocated: Experts call for systemic economic change to prioritize living within planetary boundaries and phase out fossil fuels through investment in renewable energy and green infrastructure."]}
{"uuid": "c8d61b55-dd66-476e-950f-4cc8b808c028", "events": ["Notification: WHO was notified of unusual pneumonia cases in Wuhan City, China on Dec. 31.", "Identification: Chinese authorities identified SARS-CoV-2 as the cause of the pneumonia cases approximately a week after the WHO notification.", "Global Spread: SARS-CoV-2 virus spread globally, causing infections and deaths."]}
{"uuid": "de394317-7a49-4233-9f9c-bce560cef94e", "events": ["Foreign Affairs founded in 1922", "Foreign Affairs became a leading forum for discussing American foreign policy and global affairs", "Foreign Affairs featured contributions from international affairs experts"]}
{"uuid": "cacea10d-fa6f-4bc7-8018-6cf9a4eec880", "events": ["Trump administration failed to mobilize for COVID-19 despite warnings.", "Washington State government developed testing and collaborated with health officials in anticipation of the COVID-19 crisis.", "Ohio, California, and New York governors implemented measures like social distancing and hospital preparation in response to COVID-19."]}
{"uuid": "3392db54-4510-4226-83ba-efb18d986be0", "events": ["Businesses are laying off workers due to the coronavirus pandemic.", "Households are skimping on food due to the coronavirus pandemic.", "International investment is fleeing emerging markets, diminishing currencies and increasing import costs."]}
{"uuid": "c1df6447-e49b-4750-89f7-440e3f3a5768", "events": ["Moscow banned gatherings with over 5,000 attendees until April 10 due to COVID-19", "President Putin endorsed proposal to remain in office until 2036", "Singapore ordered Facebook to restrict access to States Times Review's page using POFMA"]}
{"uuid": "81011aa0-93c4-447f-b22a-a3e4ebff2689", "events": ["Pandemic increases suicide risk: Coronavirus pandemic expected to increase suicide risk due to social distancing, quarantines, and social/economic fallout.", "Mental health care access challenged: Access to mental health care is challenged by the pandemic.", "Communities support vulnerable populations: Communities are mounting efforts to support vulnerable populations and combat isolation."]}
{"uuid": "bdaaad99-e348-4c13-8c4d-a256e413cfc7", "events": ["Trump addressed supporters in Washington, D.C., urging them to protest the election results.", "Protesters marched to the Capitol, clashed with police, and breached security barriers.", "Due to the breach, the House and Senate recessed, and the Capitol was locked down."]}
{"uuid": "056dc362-f9c1-4308-bf84-94c7e11403a3", "events": ["Trump supporters stormed the U.S. Capitol to overturn the election; hundreds of supporters involved; temporal context: following Trump's statement to never accept defeat.", "Capitol Police shot and killed a woman; one woman and Capitol Police involved; temporal context: during the Capitol storming.", "Law enforcement cleared the mob from the Capitol; Law enforcement and rioters involved; temporal context: after the Capitol was stormed."]}
{"uuid": "05cc9105-e4c2-4b62-bc40-d7a0552d4205", "events": ["Trump supporters overtook the U.S. Capitol, breaching police lines and forcing entry to stop the transfer of power on Wednesday.", "A woman was shot inside the Capitol and later died.", "Congress reconvened at 8 p.m. to continue the certification of President-elect Joe Biden's win after the Capitol was secured by 6 p.m."]}
{"uuid": "fa4c71ce-8b4c-4979-8675-aebd333e278b", "events": ["Riot/Insurrection: Occurred in Washington, D.C. on January 6th during the joint session of Congress.", "Certification of Presidential Victory: Joint session of Congress was certifying the presidential victory on January 6th.", "Confirmation of Biden as President: Congress confirmed Biden as president in the early hours of January 7th."]}
{"uuid": "462cad8a-b7ae-4e63-915f-3ffc05b95d17", "events": ["Mob stormed the Capitol: An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items on January 6, 2021.", "Law enforcement deployed to Capitol: Multiple federal agencies deployed emergency response teams to the Capitol after a call for help.", "Capitol Police leadership resigned: Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned following the Capitol breach."]}
{"uuid": "551735d4-4483-400c-8d9a-b039f72f6bc8", "events": ["Trump's supporters stormed the U.S. Capitol, shattering windows and ransacking offices.", "Lawmakers fled the House and Senate due to the breach.", "Nancy Pelosi and Charles Schumer called for Trump's removal from office."]}
{"uuid": "497da6cd-648f-4e6e-9c88-17cc2e6f12ce", "events": ["Trump urged supporters to go to Washington and march to the Capitol to protest the election results.", "Rioters breached barricades and broke into the Capitol building.", "Congress went into recess and members evacuated due to the riot."]}
{"uuid": "f5d1baeb-d512-4e01-9a58-06ce1fbd072f", "events": ["Trump supporters stormed the U.S. Capitol, clashing with police and breaching security perimeters, delaying the affirmation of Biden's win.", "Lawmakers were evacuated and moved to safety, while the Capitol was locked down due to the external security threat.", "D.C.'s Mayor issued a 6 p.m. curfew in response to the unrest at the Capitol."]}
{"uuid": "e070dd35-d311-47d3-8701-e9a0a471e21d", "events": ["Storming of the U.S. Capitol by Trump's supporters during Electoral College certification", "Texas Department of Public Safety closed Texas State Capitol and grounds on Wednesday", "Texas Capitol reopened to the public on Monday"]}
{"uuid": "8e5d15da-6ca3-4d68-a6ac-b9517e955f34", "events": ["Journalists were attacked during the Capitol siege by Trump supporters, who assaulted a photographer and television crews, and smashed their equipment.", "Trump was banned from Twitter on January 8th and impeached for a second time on January 13th.", "Congress reconvened and certified the election after the Capitol siege."]}
{"uuid": "c0d8ae97-2ef0-467d-90ad-39c9efecb0a7", "events": ["Shinzo Abe was assassinated at a campaign rally by Tetsuya Yamagami.", "Tetsuya Yamagami fired two shots at Shinzo Abe, hitting his chest and neck.", "Shinzo Abe died several hours after being shot."]}
{"uuid": "b53fa159-9f2d-4778-9656-cbe07ef28e22", "events": ["Shinzo Abe was assassinated; Shinzo Abe, gunman; Nara, during campaign speech", "Gunman was arrested; gunman; Nara, at the scene", "Videos circulated and were removed; videos, social media companies; on social media"]}
{"uuid": "7c98a54e-55ba-4f7a-969b-3e86f8203fbb", "events": ["Abe reinterpreted Japan's constitution in 2014, enabling military operations overseas.", "Abe promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia.", "Abe outlined his vision for a 'free and open Indo-Pacific' in 2016."]}
{"uuid": "12333a6e-f99f-40b7-a6ce-d44be1cb4fe9", "events": ["Abe became prime minister of Japan in 2006.", "Abe returned to office as prime minister in 2012.", "Yoshihide Suga succeeded Abe as prime minister in September 2020."]}
{"uuid": "95ebe31d-9840-4156-8f5b-200c95f5f322", "events": ["Assassination: Shinzo Abe was assassinated during a campaign rally in Nara, Japan.", "Shooting: A shooter used a handmade gun to shoot Shinzo Abe.", "Seizure: Police seized the handmade gun used in the shooting, along with several others, from the shooter's home."]}
{"uuid": "3370d672-e37d-4fe8-a684-ab8b2e532b96", "events": ["Shinzo Abe was shot; Shinzo Abe, Tetsuya Yamagami; Nara, during a campaign speech at 11:30 a.m.", "Shinzo Abe collapsed; Shinzo Abe; Bleeding from neck and chest after being shot.", "Shinzo Abe was pronounced dead; Shinzo Abe; Hospital, 5:03 p.m., due to excessive bleeding."]}
{"uuid": "4fde9acc-506e-41d9-9f71-9699f63b9249", "events": ["Shinzo Abe was murdered while campaigning in Nara on July 8, 2022.", "Tetsuya Yamagami shot Shinzo Abe with a handmade gun.", "Security officers detained Tetsuya Yamagami and seized his handmade gun."]}
{"uuid": "fbe94a47-01d1-4586-92c5-c23c4a117f4e", "events": ["Assassination: Shinzo Abe was assassinated at a campaign rally in Nara.", "Shooting: Shinzo Abe was shot multiple times from behind while speaking.", "Diplomacy: Increased diplomacy between Japan and Israel, starting with Benjamin Netanyahu's visit to Tokyo in 2014."]}
{"uuid": "f4d8ca00-3be4-4113-8044-35f12f38478d", "events": ["Elon Musk confirmed stepping down as CEO of Twitter once a replacement is found, transitioning to managing software and servers (December 20).", "Elon Musk implemented staff reductions at Twitter, including firing top executives and laying off a large portion of employees (post-October).", "Elon Musk reinstated previously suspended accounts, including Donald Trump's, under a 'general amnesty' (post-October)."]}
{"uuid": "c82e96c7-569f-43f3-a296-c0f11d3f4f82", "events": ["Elon Musk acquired Twitter to prevent social media splintering.", "General Motors suspended advertising on Twitter due to uncertainty about the platform's direction.", "Advertisers expressed concerns about brand safety and content moderation on Twitter under Elon Musk's ownership."]}
{"uuid": "280ed404-f948-4202-9d9f-09f2f4652c36", "events": ["Musk acquired Twitter; Musk, Twitter; after improvements to functionality, policies, and moderation", "Musk fired top executives; Musk, Vijaya Gadde, other top executives", "Musk planned policy changes; Musk, Twitter; loosening speech rules and user authentication requirements"]}
{"uuid": "1219d85b-173c-48f8-a507-871f41cab970", "events": ["Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams created Twitter in 2006", "Twitter received Series A funding in 2007", "Twitter went public in 2013"]}
{"uuid": "3ce8d8a1-4b11-4eb6-bfc8-fc7ae15cc5ce", "events": ["Elon Musk acquired Twitter for $44 billion.", "Elon Musk fired Twitter CEO Parag Agrawal, CFO Ned Segal, and general counsel Vijaya Gadde.", "Elon Musk plans to reinstate previously suspended accounts, including Donald Trump's account, on Twitter."]}
{"uuid": "31247aeb-1f4c-4331-a518-0a2643be0c7b", "events": ["Copyright ownership of text: Fortune Media IP Limited.", "Trademark ownership: FORTUNE trademark owned by Fortune Media IP Limited.", "Potential compensation: FORTUNE may receive compensation for some links."]}
{"uuid": "ec489126-f497-42cb-bb1f-667b83f938e6", "events": ["Elon Musk acquired control of Twitter.", "Parag Agrawal, Ned Segal, and Vijaya Gadde were ousted from their positions at Twitter.", "Trading in Twitter shares was suspended on the New York Stock Exchange."]}
{"uuid": "e2e38161-ef4e-4717-a5d2-37f5930cd54d", "events": ["Copyright protection: Fortune Media IP Limited asserts copyright over its content.", "User agreement: Users must accept the terms of use and privacy policy.", "Data privacy: Notice provided regarding the potential sale/sharing of personal information under California law."]}
{"uuid": "82e806cc-505c-4726-a0c0-a530e0e2a5ab", "events": ["Elon Musk to acquire Twitter for $44 billion", "Transformation of Twitter's strategy"]}
{"uuid": "fddfdff5-38e5-488e-9279-e30b0d03f798", "events": ["Donald Trump elected president after winning Wisconsin and securing over 270 electoral votes.", "Two assassination attempts occurred targeting Donald Trump during the election season.", "Donald Trump was found guilty on 34 felony charges in New York."]}
{"uuid": "bcb6d8b4-5505-4bac-86b7-8bf93312cfc7", "events": ["Johns Hopkins held a virtual event 'Insights and Impacts: Post-Election Debrief' on Nov. 7 to discuss the election's effects.", "Panelists discussed factors influencing the election, including polarization, economic disconnect, Trump's voter appeal, and information inconsistencies.", "Panelists analyzed potential limits on Trump's agenda and power, even with Republican control of Congress."]}
{"uuid": "d62f7484-52ef-43a6-956e-8601112f6058", "events": ["Trump sweeps swing states: Trump wins in seven swing states, including Arizona (November 9, 2024)", "House races being counted: Races for the House of Representatives continue to be counted (November 9, 2024)"]}
{"uuid": "9d89b70b-feb1-43ca-9290-7e44e3b694cb", "events": ["Donald Trump won reelection to the White House", "Republicans used anti-trans hate to move people to the polls", "Concerns raised about the executive branch influencing future elections"]}
{"uuid": "9f900a60-7fa1-4a52-adb5-02384fb623c2", "events": ["Russia's reinvasion of Ukraine reshaped oil geopolitics, impacting energy security views.", "OPEC+ decided to reduce oil production by 1.2 million barrels daily, affecting oil prices.", "Russia continues to sell oil at discounted prices to countries like Turkey, Singapore, China, and India, despite sanctions."]}
{"uuid": "4e2e13bb-bd29-4267-bc42-c476602c905d", "events": ["Vote estimation occurs based on factors including early votes and information from county election officials.", "Estimate figure changes as new information is gathered."]}
{"uuid": "50804ea5-3458-4bd2-89e5-439746b9d8e0", "events": ["FBI warns of fabricated videos; Target: Undermining confidence in electoral system; Context: Misuse of FBI name", "False claim: 301 electors reported bribery attempts; Source: Fabricated video", "FBI states: All videos contain false information; Context: Response to fabricated videos"]}
{"uuid": "1cd0bcd5-cd59-46b1-a2e4-311f2a63e238", "events": ["Donald Trump won Arizona, securing 11 electoral votes.", "Donald Trump defeated Kamala Harris in Arizona.", "Donald Trump won the popular vote by approximately four million votes."]}
{"uuid": "ed9aadf1-7fc3-4f8c-9f8b-41086707905a", "events": ["Protest: Tens of thousands of South Korean protesters demonstrated near the National Assembly in Seoul, demanding President Yoon Suk Yeol's removal.", "Performance: Baek Jae Gil performed his adapted anthem 'Impeachment is the answer' outside the National Assembly after Yoon's declaration of martial law.", "Adaptation: Baek Jae Gil adapted 'Feliz Navidad' into a protest anthem, 'Impeachment is the answer'."]}
{"uuid": "c9f1001f-45f7-467c-9ca7-addc5c594e14", "events": ["President Yoon Suk Yeol declared martial law, accusing the opposition of undermining the democratic system.", "Martial-law command suspended the legislature and controlled the media.", "Lawmakers unanimously annulled martial law."]}
{"uuid": "0bfa5fdc-8975-4b7c-b194-886211e926f7", "events": ["South Korean legislators launched an impeachment push against President Yoon Suk Yeol, accusing him of violating the constitution and law.", "President Yoon Suk Yeol declared martial law, claiming it was necessary to defend against North Korean threats.", "Lawmakers overturned President Yoon's martial law declaration after tussling with troops to enter the National Assembly."]}
{"uuid": "f718c1ba-e98d-489c-8743-09651840bb06", "events": ["South Korean parliament impeached President Yoon Suk Yeol following his martial law attempt.", "Prime Minister Han Duck-soo became acting president after Yoon's impeachment.", "Special Warfare Command Commander Kwak Jong-geun received a direct order from President Yoon to break the doors of the National Assembly and drag out the lawmakers, but he did not comply."]}
{"uuid": "084cf0b0-0b4b-47eb-b86d-10c6b01978af", "events": ["Protest: Tens of thousands protested near South Korea's National Assembly, demanding President Yoon Suk Yeol's impeachment.", "Impeachment Vote: Lawmakers voted on a motion to impeach President Yoon Suk Yeol; the motion failed.", "Martial Law Declaration: President Yoon Suk Yeol declared martial law, leading to intensified protests."]}
{"uuid": "0bae2705-4a17-482e-9ca8-8b8f70bfb7ef", "events": ["Yoon declared martial law on December 3, triggering protests.", "A second impeachment motion was filed against President Yoon in the National Assembly.", "Yoon faces criminal investigations including insurrection charges, potentially leading to arrest."]}
{"uuid": "45b111ac-55ac-4330-8f02-a250edbe7b9c", "events": ["M7.7 earthquake hit Myanmar on March 28, 2025 at 06:20 UTC, with epicenter near Sagaing and Mandalay.", "Buildings collapsed and infrastructure was damaged in multiple locations in Myanmar, including Mandalay, Naypyidaw, and Sagaing Township, on March 28, 2025 following the earthquake.", "Death toll rose to 4,390 in Myanmar and 36 in Thailand by April 3, following the earthquake on March 28, 2025."]}
{"uuid": "0610bea1-84d2-4a80-a1e9-d82a483d36a7", "events": ["Earthquake: A 7.7 magnitude earthquake hit central Myanmar in Mandalay at 6.21am GMT, originating at a shallow depth of 10km. Entities involved: Myanmar, Mandalay.", "Structural Damage: Buildings collapsed and roads buckled in Myanmar and Thailand due to the earthquake.", "Aftershock: A large aftershock occurred after the initial earthquake."]}
{"uuid": "3308854f-4989-4d73-bf5c-867d7b636824", "events": ["Earthquake struck Myanmar on Friday, causing damage.", "Mandalay General Hospital stopped admitting patients due to being full and lacking power and water.", "Earthquake caused by a rupture lasting a minute."]}
{"uuid": "05c4cb5a-0c99-4824-82e1-2620ec1cbb70", "events": ["Earthquake struck Myanmar", "Myanmar government requested international humanitarian aid", "UN is mobilizing aid"]}
{"uuid": "dfb69458-c320-4c10-a6fc-64aec7e109fe", "events": ["Earthquake struck Myanmar: A 7.7 magnitude earthquake struck Myanmar, with the epicenter in Mandalay, followed by a 6.7 magnitude aftershock.", "Building collapsed in Bangkok: A skyscraper under construction collapsed in Bangkok, Thailand, causing casualties and disruption of services.", "International aid requested and sent: Myanmar's military leader appealed for international aid, and India sent 15 tonnes of relief material."]}
{"uuid": "e8768da7-4fab-420c-a72a-e9f311c3ff53", "events": ["Earthquake: A magnitude-7.9 earthquake struck central Myanmar at 2:20 pm (Beijing time).", "Casualties: 144 people were killed and 732 injured in Myanmar.", "State of Emergency: Myanmar declared a state of emergency in six quake-affected areas."]}
{"uuid": "90395859-8e60-43a8-88e3-e2f6ba54f333", "events": ["Site protects itself from spam and bots", "Site prioritizes real visitors", "Pro users/supporters browse faster"]}
{"uuid": "5459f536-7024-4e9c-9b13-e61d155e1645", "events": ["Live page closure (entity: live page)", "Coverage end (entity: coverage)"]}
{"uuid": "aa9dfc9c-e558-434f-bd57-1a21155fc02f", "events": ["David Lebryk left the Treasury Department after DOGE officials inquired about stopping federal payments.", "Three former Musk employees obtained top positions at the Office of Personnel Management (OPM).", "Trump suggested federal workers would be fired if they didn't return to offices by a deadline."]}
{"uuid": "956c3a67-e2f4-445f-82ca-6bd6f77af032", "events": ["DOGE establishment: DOGE was established with an amorphous and secretive structure on the eve of Mr. Trump's presidency.", "Executives' government stints: Executives will perform six-month voluntary stints inside the federal government.", "DOGE representative stationing: Representatives from DOGE will be stationed inside federal agencies."]}
{"uuid": "75523b50-c97d-4ad2-9810-f6486979186a", "events": ["Elon Musk and Vivek Ramaswamy initiated interviews via representatives: Representatives sent to federal agencies to conduct preliminary interviews.", "Donald Trump appointed Elon Musk and Vivek Ramaswamy as co-leaders: Musk and Ramaswamy named co-leaders of DOGE.", "Musk and Ramaswamy recruited staffers: Musk and Ramaswamy hired over 50 staffers for DOGE."]}
{"uuid": "af6a2b29-0e43-4fc4-a546-1c558904c2c7", "events": ["Donald Trump appointed numerous individuals to key government positions.", "Penny Schwinn appointed Deputy Secretary of Education.", "Mike Waltz appointed National Security Adviser."]}
{"uuid": "af056bd1-6c3d-4980-bd56-28758abee8ea", "events": ["Elon Musk criticized political figures in Britain, Germany, and Canada via X platform; targeting Keir Starmer, Justin Trudeau, and implicitly German political landscape.", "Elon Musk was appointed to co-lead the Department of Government Efficiency; appointed by Trump and Vivek Ramaswamy.", "Elon Musk to hold live X discussion with Alice Weidel; Weidel is running for chancellor in Germany."]}
{"uuid": "b70b70f6-ea94-49cf-8ba4-55c4303d4e37", "events": ["Musk appointed co-lead of Department of Government Efficiency", "EU AI Office published second-draft code of practice for general-purpose AI models", "UK plans AI legislation, consulting on copyright measures for AI model training"]}
{"uuid": "6b79f32b-85fc-43e3-87b0-27b3bbb5415f", "events": ["Lutnick was planned to run the Commerce Department under Trump.", "Musk leads the federal cost-cutting effort.", "Takeover of the United States Digital Service occurred, with the new name United States DOGE Service."]}
{"uuid": "1053ca61-a5a6-4e0e-b5d0-e494425b6280", "events": ["President Trump announced new tariffs", "Tariffs will take effect", "Global stock market declined"]}
{"uuid": "ea99ef44-10c6-4a59-8fed-4806b6f4fbce", "events": ["US Senate likely to vote on bill to halt Trump's tariffs on Canadian imports on Wednesday.", "Reciprocal tariffs deadline looms.", "Economic uncertainty exists."]}
{"uuid": "5a729774-b665-4f5b-a234-b6d359899a3b", "events": ["Trump plans tariff imposition on imported goods on April 2", "Trump advocates tariffs to balance the economic playing field", "Trump has announced tariffs on imported steel, aluminum, autos, and auto parts"]}
{"uuid": "4696499e-4e4c-4fb0-8393-e14d827d8478", "events": ["Ad presentation occurred", "Technical issues arose (slow video player, loading failures, freezing)", "Audio issue: Ad audio was too loud"]}
{"uuid": "b83336b0-931f-4776-9a3a-5ebe53d48d3e", "events": ["Trump increased tariffs on imports from China, aluminum, and steel.", "McKinley championed the Tariff Act of 1890, raising import taxes.", "Panic of 1893 was triggered, partly due to tariffs increasing the cost of living."]}
{"uuid": "08918d8a-e4d4-46f7-85e1-ec33e8a44e75", "events": ["Trump planned to raise tariffs on Canadian steel and aluminum to 50% on Wednesday.", "Doug Ford paused the surcharge after discussions with Howard Lutnick.", "Navarro confirmed the tariff increase was canceled."]}
{"uuid": "a31bda2a-838f-4ab3-8c42-9ee97f815993", "events": ["Asana shares plunged after CEO Dustin Moskovitz announced resignation.", "Teradyne shares plummeted after warning about impact of tariffs; Teradyne acquired Quantifi Photonics.", "Southwest Airlines shares surged after announcing baggage fees and a basic economy ticket option."]}
{"uuid": "f395b6ec-011f-48c2-94f5-9a6b4b344695", "events": ["Comparisons drawn: Chinese people are comparing actions of the Trump administration to China's Cultural Revolution.", "Comments posted: U.S. Embassy in China's Weibo account flooded with angry comments expressing disappointment with U.S. policies.", "Democratic values erosion: Chinese people expressing alarm at perceived erosion of democratic values in the U.S."]}
{"uuid": "95fe191a-723e-4f5b-889b-0a25be3dae58", "events": ["Trump imposed tariffs on aluminium and steel, angering Australia.", "Trump imposed tariffs on Colombia after the president refused deportees, leading to Colombia's compliance.", "China, Canada and Mexico imposed retaliatory tariffs in response to Trump's tariffs."]}
