{"uuid": "c8d61b55-dd66-476e-950f-4cc8b808c028", "summary": "On Dec. 31, the WHO was notified of a cluster of unusual pneumonia cases in Wuhan City, China. A week later, Chinese authorities identified SARS-CoV-2 as the new coronavirus causing the infections. SARS-CoV-2 quickly spread around the globe, with thousands of cases reported across all 50 US states by mid-March. In 2002, a coronavirus jumped from civet cats to humans, causing a SARS-CoV outbreak. A decade later, a coronavirus crossed from dromedary camels to humans, causing a MERS-CoV outbreak. The CDC and the federal government worked with state and local authorities on strict public health measures to slow the virus's spread. Officials in some areas required bars and restaurants to close and residents to stay home. Doctors relied on supportive care to help COVID-19 patients recover. Clinical trials began to test potential treatments and vaccines for COVID-19, including remdesivir trials in China. Gilead provided remdesivir for certain severely ill patients, pregnant women, and children outside of trials. Clinical studies also began to test chloroquine, hydroxychloroquine, and sarilumab for COVID-19. The National Institutes of Health launched an early clinical trial of a COVID-19 vaccine."}
{"uuid": "b70b70f6-ea94-49cf-8ba4-55c4303d4e37", "summary": "On November 19, 2024, U.S. President-elect Donald Trump and Elon Musk watched the launch of the sixth test flight of the SpaceX Starship rocket in Brownsville, Texas. On December 5, 2024, Elon Musk met with Senate Republican Leader-elect John Thune on Capitol Hill in Washington. Trump appointed Elon Musk to co-lead his \"Department of Government Efficiency\" alongside Vivek Ramaswamy.\n\nEarlier this year, the European Union's AI Act officially entered into force. In December, the EU AI Office published a second-draft code of practice for general-purpose AI (GPAI) models, which included exemptions for certain open-source AI models and required rigorous risk assessments for \"systemic\" GPAI models. The Computer & Communications Industry Association warned this draft contained measures beyond the Act's agreed scope. In February, the first provisions of the EU AI Act will become enforceable, covering \"high-risk\" AI applications, and a third draft of the code on GPAI models is slated for publication.\n\nKeir Starmer's government in the U.K. announced plans to draw up legislation for AI. Last month, the U.K. government announced a consultation on measures to regulate the use of copyrighted content for training AI models. The U.K. government is considering making an exception to copyright law for AI model training while allowing rights holders to opt out.\n\nIn his first term, Trump enforced hawkish policy measures on China, including adding Huawei to a trade blacklist and launching a bid to ban TikTok in the U.S., though he has since softened his position on TikTok. The U.S. has taken measures to restrict China's access to key technologies like chips. China has responded by attempting to build its own homegrown chip industry. In 2023, the U.K. hosted a global AI safety summit, which the U.S. and China administrations attended to discuss potential guardrails for the technology."}
{"uuid": "35dba59f-98f7-45c8-a414-45277cf66565", "summary": "President Donald Trump frequently called India the \"tariff king.\" On April 2, he announced sweeping tariffs on U.S. trading partners, including a 26 percent tariff rate on India, which intensified global economic uncertainty and triggered a sharp stock market decline. China responded by announcing retaliatory tariffs against U.S. levies, imposing an export control on rare earths, restricting rare-earth exports to Japan, and cutting demand from Australia. Regarding India's trade policy, its simple average tariffs rose from 13.4% to 18.1% between 2015 and 2022, then declined to 17% in 2023. After 2022, India also implemented an increase in quality control orders across over 100 sectors. Historically, India's leaders adopted import substitution industrialization after its 1947 independence. However, after 1991, India's policymakers liberalized trade and other economic policies, leading to average tariffs decreasing from 81% in 1990 to 9% by 2010, and goods trade rising from 11% of GDP in 1988 to 43% in 2012. More recently, India signed trade agreements with Australia and the United Arab Emirates. On May 6, India and the U.K. concluded talks on an FTA that had begun in 2022."}
{"uuid": "82e806cc-505c-4726-a0c0-a530e0e2a5ab", "summary": "Elon Musk appears to be moving ahead on a deal to acquire Twitter for $44 billion."}
{"uuid": "95fa2b34-96c9-4018-a56c-9f4955f9e3fd", "summary": "In March 2023, the previous government announced a review of the current national policy statement for ports (NPSP). This government continued that review and decided to amend the document. On 4 June 2025, the speaker laid the draft amended NPSP before Parliament. Concurrently, the speaker launched a public consultation on the draft revised NPSP, an appraisal of sustainability (AoS), and a habitats regulations assessment (HRA). The speaker's department also published port freight demand forecasts for the United Kingdom. The speaker will place copies of the public consultation document, AoS, and HRA in the libraries of the House. The public consultation will close on 29 July 2025. Parliamentary scrutiny will run from 4 June to 14 November 2025."}
{"uuid": "95fe191a-723e-4f5b-889b-0a25be3dae58", "summary": "The US President imposes and threatens more hefty taxes (tariffs) on imports, leading to a global trade war. Tariffs are placed on aluminium and steel, angering Australia. Colombia's president refuses to accept deportees; Trump imposes 25% tariffs on Colombian imports and threatens more; Colombia's president relents. Tariffs are imposed on China, Canada, and Mexico. China responds with retaliatory tariffs. Canada and Mexico announce measures to toughen border controls. Trump postpones tariffs on Canada and Mexico, then implements them (with exclusions) a month later and warns of more. Canada accuses Trump of using tariffs to cripple its economy for a US takeover. Trump posts that Canada should become the fifty-first state. Sweeping retaliatory tariffs are imposed, hurting American exporters. China imposes revenge tariffs on meat, grains, and fruit. Mexico states it will retaliate. The EU imposes retaliatory tariffs on American whiskey. Trump threatens 200% tariffs on EU drinks. American stocks tank, dragging Australia's down. Consumer sentiment crashes, dropping 11% in a month to 57.9. Trump states the US will not be \"ripped off anymore\" and will not \"bend at all.\""}
{"uuid": "f4d8ca00-3be4-4113-8044-35f12f38478d", "summary": "Elon Musk took charge of Twitter in late October. On November 9, Musk ended Twitter's remote-work policy. On November 10, Musk fired top executives including CEO Parag Agrawal, CFO Ned Segal, and head of legal policy, trust, and safety Vijaya Gadde. Also on November 10, Twitter's top privacy, security, and trust & safety executives, including Lea Kissner and Yoel Roth, resigned or left. Musk continued firing other executives, including the ad chief, general manager of core tech, and chief marketing officer Leslie Berland. Musk pulled in over 50 Tesla engineers to work for Twitter. Musk laid off an estimated 50% (over 3,700) of Twitter's staff, informing them via email but locking some out of accounts before formal notice. Twitter reportedly asked dozens of recently laid-off employees to return to work. Approximately 4,400 Twitter contractors were laid off in a second round of cuts. Musk fired at least 20 employees for critical posts. Five employees filed a class action lawsuit against Twitter over layoff notification. Musk issued an ultimatum requiring employees to work \"extremely hardcore\" or resign, leading to approximately 1,200 employee resignations. Musk requested engineers to meet him in person to show recent code examples.\n\nMusk confirmed charging $8/month for blue check marks and removed ID verification from Twitter Blue. The new check mark system led to widespread impersonation and chaos. Musk suspended accounts impersonating him and announced new rules against impersonation, including temporary check mark removal for name changes. Musk axed the new \"Official\" gray check mark feature hours after its rollout. On November 21, Musk postponed the Twitter Blue relaunch due to impersonation concerns.\n\nA notable surge in hate speech occurred on the app after Musk took over, including a 500% increase in the use of the n-word. Major advertisers, including General Motors, Volkswagen, Audi, and Pfizer, paused ads on Twitter. Musk tweeted a public note to calm advertiser concerns and later tweeted Twitter had a \"massive drop in revenue\" due to \"activist groups.\" Musk met with civil rights leaders, promising to address hate speech, establish a content moderation council, and reverse staff limits on content moderation systems.\n\nMusk suspended accounts of prominent journalists. Musk reinstated former President Donald Trump's account. Musk ran a poll asking about \"general amnesty\" for suspended accounts; a majority voted yes. Based on the poll, Musk tweeted he would start reinstating suspended accounts. Musk reinstated accounts of Kathy Griffin, Jordan Peterson, and Babylon Bee.\n\nOn November 10, Musk stated bankruptcy was possible for Twitter if it didn't increase revenue. On December 18, Musk ran a Twitter poll asking if he should step down as CEO, with a majority voting yes. On December 20, Musk confirmed he will step down as CEO upon finding a replacement and will manage software/servers teams. Approximately 877,000 accounts were deactivated on Twitter in the week after Musk's deal closed. Twitter is considering entering the payments business."}
{"uuid": "08918d8a-e4d4-46f7-85e1-ec33e8a44e75", "summary": "President Trump placed sweeping 25% tariffs on imports from Canada. In retaliation, Ontario, led by Premier Doug Ford, placed a 25% tax on electricity exports to the U.S. On Tuesday morning, President Trump announced a plan to impose an additional 25% tariff, raising the total to 50%, on all steel and aluminum imports from Canada, effective March 12th. Earlier Tuesday afternoon, Premier Ford paused Ontario's electricity surcharge following discussions with U.S. Commerce Secretary Howard Lutnick. Ford and Lutnick agreed to meet in Washington, D.C., on Thursday to discuss a renewed trilateral trade agreement. On Tuesday afternoon, President Trump reversed his plan to raise tariffs on Canadian steel and aluminum imports to 50%."}
{"uuid": "ab40cd68-9069-4ef0-9c96-54b9aabbd7a7", "summary": "A study by the Francis Crick Institute and University College London Hospitals found quadrivalent seasonal flu vaccines (QIVs) do not generate protective antibodies against two dangerous avian influenza A(H5N1) strains. The study analyzed blood samples from 61 adults who received flu vaccines across the 2021–2024 seasons. Vaccines boosted immunity against seasonal flu viruses but failed to trigger an immune response against the two H5N1 strains tested. H5N1 has been detected in cows, cats, rodents, and humans. U.S. officials found H5N1 traces in wastewater and raw milk. H5N1 continues to spread in animals and cause sporadic human infections. The study authors call for accelerated development of H5N1-specific vaccines, improved animal and human surveillance, and focused protection for high-risk groups."}
{"uuid": "0bae2705-4a17-482e-9ca8-8b8f70bfb7ef", "summary": "President Yoon Suk-yeol faces a second impeachment motion in the National Assembly. A previous impeachment attempt by the political opposition failed. Yoon declared martial law on December 3. Legislators from Yoon’s People Power Party openly supported the impeachment motion. Yoon dismissed voluntary resignation. If the National Assembly passes the motion, the impeachment resolution will be delivered to the President’s Office and the Constitutional Court. Upon passage, Yoon’s presidential powers will be suspended, and the prime minister will assume acting president. The opposition is considering impeaching Prime Minister Han Duck-soo. The Constitutional Court will review the impeachment case if the motion passes. If the court upholds the impeachment, Yoon will be removed from office, and a presidential election must be held within 60 days. If the court rejects the impeachment, Yoon will be reinstated. Yoon faces criminal investigations. Multiple investigative agencies are investigating senior officials and military commanders on charges of insurrection."}
{"uuid": "997abe01-733f-4167-a913-36af44644fa4", "summary": "In 2020, the World Bank published a report detailing a shift from preferential trade agreements to \"deep trade\" agreements. Over the past three decades, the United States blocked appointments to the WTO appellate body, leading to paralysis of its appeals process and unresolved trade disputes. The WTO recently waived certain patent restrictions to ensure the accessibility of COVID-19 vaccines. During the COVID-19 pandemic, supply chain shocks encouraged many countries and companies to hedge their risks. In the last decade, significant preferential trade agreements (PTAs) were ratified or signed, including the USMCA, CPTPP, AfCFTA, and RCEP. Past US, Latin American, and Southeast Asian governments attempted to negotiate \"worker-centered\" trade deals and advance \"friend-shoring\" or \"near-shoring.\" Currently, the United States and several other major countries are shifting their trade approaches toward protectionism, announcing tariff and nontariff barriers and limiting market access. Most economies have started pivoting toward protectionist trade practices to restrict imports and promote domestic industries. China, the United States, and the European Union have been unable to negotiate trade agreements among themselves."}
{"uuid": "ba20deb4-3976-418f-85e4-2a1451095b13", "summary": "On 28 April 2025, a glacier lake outburst flood (GLOF) originated from a glacier lake at the toe of Vallunaraju, Peru, impacting rural and urban Huaraz. The event, likely caused by a rock slope failure into a lake, triggered an impact wave that led to a debris flow. This debris flow rushed downvalley along the Casca river, damaging approximately 100 houses, destroying about 15 buildings and road infrastructure, and claiming the lives of 2-3 persons. Prior rock fall events, including slope failures likely the day before, are suggested to have occurred at this location. Post-event imagery from 30 April 2025 revealed extensive scour, erosion, and substantial channel changes below the steep slope."}
{"uuid": "1cd0bcd5-cd59-46b1-a2e4-311f2a63e238", "summary": "On November 9, President-elect Donald Trump won Arizona, returning the state and its 11 electoral votes to the Republican column. This win over Democratic Vice President Kamala Harris completed the Republican sweep of all seven swing states. Trump sealed a comeback to the White House in the November 5 election and also won the popular vote by approximately four million votes."}
{"uuid": "f395b6ec-011f-48c2-94f5-9a6b4b344695", "summary": "Elon Musk sent young aides, whom some Chinese perceive as dismantling the U.S. government. President Trump mused about serving a third term. Xi Jinping engineered a constitutional change in 2022 to secure his third term. The United States previously helped China modernize and expand its economy. Journalist Wang Jian posted on X, criticizing Mr. Trump. A commenter wrote \"Beacon of democracy, 1776-2025\" on a U.S. Embassy in China Weibo post. Investigative journalist Zhang Wenmin was forced to leave China and moved to the United States in 2023. Mr. Xi smothered efforts to make China a more open and democratic society. Deng Haiyan wrote on X, commenting on the language of U.S. government agencies' social media posts. In 2023, R. Nicholas Burns, former U.S. ambassador to China, spoke about using social media to interact with the Chinese public. Chinese users flooded the U.S. Embassy’s Weibo posts with angry comments. A commenter teased the U.S. Embassy Weibo account's social media editor, and the Embassy press office declined to comment. Professor Zhang Qianfan wrote an article about the erosion of American democracy. Mr. Xi surrounded himself with loyalists for his third term. The U.S. Embassy in China posted on Weibo that the White House would pick media outlets for the presidential press pool, prompting a user in Chongqing to comment. Trump showed off hats saying \"Trump was right about everything,\" leading a user on X to compare him to Mao Zedong. Journalist Li Weiao posted a video on Weibo showing Mr. Trump receiving a standing ovation at a cabinet meeting, which a lawyer and another commenter reacted to. A YouTube viewer wrote a parody of a White House announcement in Communist Party propaganda style in a podcast comment."}
{"uuid": "f718c1ba-e98d-489c-8743-09651840bb06", "summary": "*   President Yoon Suk Yeol declared martial law on December 3 and sent soldiers to parliament.\n*   Lawmakers fought past troops to enter the building and voted down the martial law decree.\n*   Opposition parties attempted to impeach Yoon a week prior, but members of his ruling party boycotted the vote, causing it to fail.\n*   Yoon gave a defiant speech defending his martial law decision.\n*   Moments before Yoon's speech, the leader of Yoon’s party withdrew support for him and backed impeachment, instructing lawmakers to vote with their conscience.\n*   Thousands of protesters gathered in Seoul calling for Yoon's resignation.\n*   South Korea’s parliament voted to impeach President Yoon Suk Yeol on Saturday, with 204 lawmakers voting for impeachment and 85 against.\n*   Yoon was immediately suspended from exercising his powers.\n*   Prime Minister Han Duck-soo became acting president.\n*   Yoon stated he would \"stop temporarily\" but vowed not to give up.\n*   Yoon awaits a ruling by the Constitutional Court, which will discuss the case schedule on Monday.\n*   Acting president Han Duck-soo is under investigation for his role in the martial law decision.\n*   Yoon’s administration conducted raids on multiple media outlets and journalists' homes.\n*   Police, parliament, prosecutors, and the anti-corruption body launched separate investigations into Yoon on treason allegations.\n*   Lawmakers approved a special counsel to investigate Yoon for insurrection and abuse of power.\n*   South Korean police raided the presidential office.\n*   Yoon was barred from leaving the country.\n*   South Korean prosecutors detained former defense minister Kim Yong-hyun, who allegedly recommended the martial law imposition.\n*   Kim Yong-hyun attempted to end his own life in custody.\n*   Yoon stated he had only discussed the martial law decree with Kim before declaring it.\n*   Parliament impeached Yoon’s justice minister and police chief.\n*   Special Warfare Command Commander Kwak Jong-geun testified he received a direct order from President Yoon to break National Assembly doors and remove lawmakers, but he did not comply."}
{"uuid": "e2e38161-ef4e-4717-a5d2-37f5930cd54d", "summary": "Fortune Media IP Limited holds all rights for the site content. Using the site implies user acceptance of its Terms of Use and Privacy Policy. Fortune Media IP Limited registered FORTUNE as a trademark in the U.S. and other countries. FORTUNE may receive compensation for website links to products and services."}
{"uuid": "2d3c2315-8820-4e25-a0c1-b5f22425096a", "summary": "Elon Musk renewed fundraising efforts for his business empire after relinquishing his White House role. His company xAI launched a $300 million investment drive, and Neuralink raised $650 million. During his time in government, Tesla sales nosedived, while SpaceX benefited from his political influence. Musk has stepped up his media work to emphasize his focus on his businesses."}
{"uuid": "ea99ef44-10c6-4a59-8fed-4806b6f4fbce", "summary": "The US Senate will likely vote on Wednesday on a bill to halt Trump’s tariffs on Canadian imports."}
{"uuid": "7fa3b515-7d0c-46c7-92e2-a88c6897d53d", "summary": "Trump's first round of tariffs in 2019 led to an annual cost increase of approximately $831 per U.S. household. In 2025, Trump declared trade deficits a national emergency and escalated his tariff strategy. He imposed a 10% baseline tariff on nearly all imported goods, along with significantly higher tariffs on China, Mexico, and the European Union. This escalation immediately spiked consumer prices for everyday goods. Trump's aggressive tariff policies provoked retaliatory actions from other nations. Retaliatory tariffs from China resulted in annual losses exceeding $10 billion for American farmers, and U.S. soybean exports plummeted. Industries including technology and automotive faced severe disruptions due to retaliatory tariffs and increased input costs. Companies absorbed higher costs or passed these costs on to consumers. Manufacturing employment declined in industries dependent on imported components. Trump's unpredictable tariff approach injected damaging uncertainty into the U.S. economy. Companies delayed or canceled investment plans. The U.S. trade deficit widened during Trump's administration. Trump's protectionist stance isolated the U.S. internationally, eroding trust and damaging relationships with vital trading partners. Trump’s tariffs diminished America’s ability to influence global economic standards. Allies abroad increasingly viewed the U.S. as an unreliable partner, which weakened America's strategic economic position globally."}
{"uuid": "deb34972-9c2c-4321-ba5d-88e2cc0f08b5", "summary": "On Tuesday, the European Parliament's Agriculture Committee approved a position on EU standards for the breeding, housing, and handling of cats and dogs. This initiative introduces the first EU regulations focused on the welfare and traceability of dogs and cats. The Commission had proposed these new rules on 7 December 2023. The proposed regulations require all dogs and cats held by breeders, sellers, shelters, or offered online to be microchipped and registered in interoperable national databases. MEPs propose maintaining microchip identification numbers and national database details in a single index database managed by the Commission. MEPs recommend extending the proposed rules to include non-commercial movements of dogs and cats. Dogs and cats imported for sale must be microchipped before EU entry and registered in a national database within two working days of arrival. Pet owners arriving in the EU must pre-register microchipped animals in an online database five working days prior to arrival. Proposed regulations prohibit breeding between direct relatives. Puppies and kittens cannot be separated from their mothers until eight weeks, unless veterinary justification is provided. The regulations will limit the number of litters a female may have and establish mandatory rest periods between pregnancies. MEPs advocate for prohibiting breeding dogs or cats with excessive conformational traits and banning these animals, along with mutilated dogs and cats, from participating in shows, exhibitions, or competitions. The report is prepared for a vote in the Parliament’s plenary session. If adopted, negotiations with EU government ministers will commence."}
{"uuid": "e7aa8410-8821-4ade-bdbd-2ab1f948e919", "summary": "The COVID-19 pandemic threatens global lives and economies. COVID-19 forced countries into lockdown, terrified citizens, and triggered a financial-market meltdown. The \"coronacrisis\" exceeded government, financial institution, and corporate crisis manager response capacities. Four experts recommended ushering in systemic economic change. The European Commission developed the European Green Deal. The Club of Rome issued a warning in its 1972 report, *The Limits to Growth*. Donella Meadows issued a warning in her 1992 book, *Beyond the Limits*. The Intergovernmental Panel on Climate Change warned global warming will accelerate new virus emergence. Governments are rushing to protect citizens medically and economically. G7 and many European countries pledged to eliminate fossil-fuel subsidies by 2025. City governments worldwide are exploring new economic models featuring regenerative agriculture. Raworth advanced the idea of “Doughnut Economics.”"}
{"uuid": "b83336b0-931f-4776-9a3a-5ebe53d48d3e", "summary": "Donald Trump stated the U.S. was wealthiest from 1870-1913 when it was a tariff country, before the income tax concept. William McKinley served as president from 1897 until his assassination in 1901.\n\nTrump inconsistently implemented tariffs, imposing and then rescinding many. Trump stated that high tariffs and low interest rates could reduce federal debt, increase government revenue, boost domestic manufacturing, and attract foreign producers. Trump declared \"I am a Tariff Man\" in a 2018 online post. Trump stated during a campaign that the U.S. was wealthy during the McKinley era and would be so again. The White House raised tariffs on imports from China, aluminum, and steel. Trump increased tariffs on Canada and Mexico, then delayed most. Trump announced plans for broad \"reciprocal\" import taxes to take effect April 2nd.\n\nThe 16th Amendment was ratified in 1913, establishing the modern federal income tax. In fiscal year 2024, the federal government collected approximately $4 trillion in individual income tax and $76.4 billion in customs duties. Trump signed an executive order calling for the creation of the External Revenue Service.\n\nTrump called McKinley a \"great president\" in his inaugural address. Trump signed an executive order renaming America’s tallest peak Mount McKinley, overturning an Obama administration directive. Trump used tariff threats against Canada and Mexico to pressure them on drug smuggling and illegal immigration.\n\nMcKinley won a seat in Congress. McKinley championed the Tariff Act of 1890, which raised import taxes to 49.5% on over 1,500 items. The Tariff Act of 1890 led to increased prices and inflation. Republicans suffered landslide congressional defeats in the 1890 midterms, leading to McKinley losing his seat. Grover Cleveland won the White House in 1892. McKinley was elected Ohio governor. McKinley won the presidency in 1896. Mark Zuckerberg and other technology leaders traveled to Trump’s Mar-a-Lago club. Meta, Google, and Microsoft donated $1 million to Trump’s inaugural committee.\n\nThe U.S. ran budget surpluses from 1866 to 1893, fueled by tariffs, domestic taxes, and federal land sales. Trump began promoting the \"great tariff commission of 1887.\" A tariff commission was convened in 1882. The 1882 tariff commission recommended reducing tariffs, but Congress did not act. Federal budget surpluses decreased the U.S. money supply and caused deflation. Higher tariffs increased the cost of living for Americans. The Panic of 1893 was triggered by decreased money supply, higher tariffs, and a financial crisis in Great Britain. The Panic of 1893 resulted in railroad bankruptcies, a stock market crash, and a recession with 25% unemployment.\n\nTrump refused to rule out U.S. military forces seizing the Panama Canal. Trump suggested buying Greenland from Denmark. Trump suggested making Canada the 51st state. Trump suggested working with Israel to develop the Gaza Strip. As president, McKinley moved to expand U.S. reach. The Philippines, Guam, and Puerto Rico became American territories in December 1898 via the Spanish-American War treaty.\n\nMcKinley won reelection in 1900. McKinley began rethinking tariffs after his 1900 reelection. McKinley gave a speech on Sept. 5, 1901, advocating for reciprocity treaties. Trump promised reciprocal tariffs would take effect next month. McKinley was shot by anarchist Leon Czolgosz on Sept. 6, 1901. McKinley died on Sept. 14, 1901."}
{"uuid": "377f658b-179e-4a73-a224-cd0b80d5400c", "summary": "Elon Musk listened as President Donald Trump spoke in the Oval Office on May 30, 2025. Sen. Elizabeth Warren's office issued a report accusing Elon Musk of using his government role to enrich himself and his businesses, specifically stating he abused his role as a \"special government employee\" overseeing DOGE for private benefit. The White House did not respond to CNBC's request for comment on the report. CNBC reached out to Musk, his attorney Alex Spiro, and Tesla VP Omead Afshar for comment. Musk, Spiro, and Afshar did not immediately respond to CNBC's requests. Musk concluded his official government service leading the Department of Government Efficiency last week."}
{"uuid": "0bfa5fdc-8975-4b7c-b194-886211e926f7", "summary": "South Korean President Yoon Suk Yeol declared martial law on Tuesday. Hours later the same day, Yoon announced he would lift the order. Early Wednesday, lawmakers tussled with troops to enter the National Assembly and voted down Yoon's martial law declaration. Following this, Democratic Party leader Park Chan-dae warned Yoon \"cannot avoid the charge of treason.\" On Wednesday, opposition legislators filed an impeachment motion against President Yoon, accusing him of imposing martial law with unconstitutional intent to evade investigations into himself and his family. Also on Wednesday, governing party leader Han Dong-hoon slammed the incident and called for accountability. Lawmakers presented the impeachment motion to parliament early Thursday morning. The governing People Power Party stated it would oppose the motion. In the wake of the events, Presidential Chief of Staff Chung Jin-suk, National Security Adviser Shin Won-sik, and Presidential Chief of Staff for Policy Sung Tae-yoon offered their resignations. Prime Minister Han Duck-soo pledged to continue serving and asked the cabinet to fulfill its responsibility. The Korean Confederation of Trade Unions called for a strike until the president’s resignation."}
{"uuid": "6b79f32b-85fc-43e3-87b0-27b3bbb5415f", "summary": "The initial plan to retool the federal government began with Howard Lutnick, Elon Musk, and Vivek Ramaswamy. Mr. Lutnick emerged as Mr. Trump’s pick for the Commerce Department. Mr. Ramaswamy withdrew from the project before Mr. Trump assumed office. Mr. Musk gained full command of the federal cost-cutting effort. The Musk-led project debuted this week, taking over the United States Digital Service, which was then renamed United States DOGE Service."}
{"uuid": "31247aeb-1f4c-4331-a518-0a2643be0c7b", "summary": "Using this site constitutes acceptance of its Terms of Use and Privacy Policy."}
{"uuid": "50b93ec3-198b-4324-aac9-6e13e2f27374", "summary": "The Revitalized Peace Agreement (R-ARCSS) was signed on 18 September 2018. The Council of Ministers approved the National Land Policy on 27 October 2023, and it was tabled before the Transitional National Legislative Assembly (TNLA) on 21 November 2024. The South Sudan Land Alliance (SSuLA) called on the TNLA to prioritize the policy's passage. SSuLA released an open letter urging lawmakers to pass the policy without delay, accelerate deliberation and approval, commit financial and technical resources for its implementation, and ensure its alignment with international land rights standards. The Center for Peace and Advocacy (CPA) called for coordinated efforts between the government, land institutions, and partner organizations."}
{"uuid": "bd420aad-56fa-406e-8934-ae809cf5e80c", "summary": "Elon Musk escalated his criticism of President Trump's \"Big Beautiful Bill.\" Musk posted on X, condemning the Congressional spending bill as an \"abomination\" and criticizing politicians who voted for it. Musk formally ended his work at the White House by leaving his position as de facto head of the DOGE office. White House press secretary Karoline Leavitt stated Trump's awareness of Musk's stance on the bill and that his comments would not alter Trump's position.\n\nThe proposed bill includes cuts to Medicaid, extends 2017 tax cuts, and removes taxes on tips and overtime. It significantly alters Biden-era EV tax credits, largely phasing out the clean vehicle credit and disqualifying EVs from automakers who sold over 200,000 qualifying EVs by December 31, 2025. The bill imposes annual fees of $250 on EV drivers and $100 on hybrid vehicle drivers. It scraps a loan program previously used by Tesla and ends energy tax credits, impacting Tesla's energy business. Musk shared a Tesla Energy post on X, which stated that ending energy tax credits would threaten US energy independence and grid reliability. Tesla Energy urged the Senate to enact legislation for a sensible wind-down of energy tax credits. The proposed bill prohibits state and local governments from regulating AI for the next decade and allocates funds for modernizing federal IT systems with AI and improving cybersecurity."}
{"uuid": "acbe0815-893f-4ff0-a2b9-b87c1cb1a092", "summary": "Leaders of associations representing copyright holders and collecting societies are urging EU lawmakers to revise copyright rules to ensure transparency and fair remuneration for works used to train generative AI, and to protect against AI platforms scraping content without licensing. European Commission official Emmanuelle Du Chalard stated an upcoming study would assess the contentious text and data mining exception and consider the need for new licensing mechanisms. Lawmakers acknowledged the need to safeguard creative rights while supporting innovation and discussed statutory licensing as a potential solution."}
{"uuid": "9aa9767c-20a0-47c8-bc45-e79163f75743", "summary": "Publicis Groupe acquired Captiv8. The acquisition combined Captiv8’s creator network and AI-powered tools with Publicis’s Influential and Epsilon’s data technology. Influential will merge with Captiv8. Publicis will leverage Epsilon’s data infrastructure to complement Captiv8’s AI capabilities."}
{"uuid": "14e4feff-eaa8-42f1-9bf7-a8988a5b68a3", "summary": "Nippon Steel's pursuit of U.S. Steel is entering the final stages. U.S. President Donald Trump indicated his approval of a deal that includes Nippon Steel's massive investment in U.S. Steel."}
{"uuid": "af056bd1-6c3d-4980-bd56-28758abee8ea", "summary": "Elon Musk used his X social media platform to criticize political figures in Britain, Germany, and Canada. In Britain, Musk called for the release of Tommy Robinson, stated \"America should liberate the people of Britain from their tyrannical government,\" and accused Prime Minister Keir Starmer of failing to bring \"rape gangs\" to justice. In Germany, Musk stated the AfD party is the only one that can \"save\" the country and that Germany is \"on the brink of economic and cultural collapse.\" In Canada, Musk called Prime Minister Justin Trudeau an \"insufferable fool\" and praised politician Pierre Poilievre. British Prime Minister Keir Starmer stated Musk and others spreading false information online had gone too far and were \"spreading lies.\" British health minister Andrew Gwynne stated Musk should focus on U.S. issues. Musk stated Nigel Farage \"doesn't have what it takes\" to lead Reform UK. Donald Trump appointed Musk and Vivek Ramaswamy to co-lead the Department of Government Efficiency. French President Emmanuel Macron and Norwegian Prime Minister Jonas Gahr Store expressed concern over Musk's X posts. Musk did not respond to questions about pushback from European political figures. Musk is poised to hold a live X discussion with Alice Weidel."}
{"uuid": "ec489126-f497-42cb-bb1f-667b83f938e6", "summary": "Elon Musk signed a deal to acquire Twitter in April. In April, Musk privately clashed with then-CEO Parag Agrawal and criticized top lawyer Vijaya Gadde on Twitter, leading to harassment against Gadde. Musk later tried to back out of the deal, prompting Twitter to sue him to force the acquisition. In early October, the Delaware Chancery Court ordered a Friday deadline for the deal to close. On Wednesday, Musk entered Twitter's headquarters, changed his profile to \"Chief Twit,\" and tweeted about his arrival. Also on Wednesday, top sales executive Sarah Personette met with Musk. On Thursday, Elon Musk took control of Twitter. Musk immediately ousted CEO Parag Agrawal, CFO Ned Segal, and Chief Legal Counsel Vijaya Gadde. Following Gadde's firing, harassing tweets targeting her resumed. Musk tried to soothe Twitter advertisers, stating he is buying the platform to help humanity and prevent it from becoming a \"free-for-all hellscape,\" and wrote a message explaining his vision for a \"common digital town square.\" On Thursday, Sarah Personette endorsed Musk's message and reiterated commitment to brand safety. Overnight, the New York Stock Exchange announced it would suspend trading in Twitter shares before Friday's opening bell. Musk plans to cut three quarters of Twitter's workforce. Musk is expected to speak to Twitter employees on Friday."}
{"uuid": "3ce8d8a1-4b11-4eb6-bfc8-fc7ae15cc5ce", "summary": "Elon Musk entered Twitter headquarters carrying a kitchen sink and changed his profile to ‘Chief Twit’. Musk completed his $44 billion takeover of Twitter, stating the acquisition was an \"accelerant to creating X, the everything app.\" Within days of taking ownership, Musk fired Twitter CEO Parag Agrawal, CFO Ned Segal, and General Counsel Vijaya Gadde. Musk told staff he was not planning to cut 75% of Twitter staff. Musk confirmed he would allow banned accounts, including former US president Donald Trump's, to return to the platform."}
{"uuid": "8ba1d04c-c624-4279-94cc-cb976d3988c0", "summary": "On Tuesday, Elon Musk criticized a tax and immigration bill on X, calling it a “disgusting abomination” and stating it would cause \"crushingly unsustainable debt.\" This legislation had barely passed the House late last month, and the Senate began its consideration this week. President Trump encouraged lawmakers to pass the measure. Following Musk's criticism, Republican Senate budget hawks applauded his attack, while mainstream Republicans reacted with \"an eyeball roll.\" Senator Ron Johnson called for splitting the legislation into multiple smaller bills. Senate Minority Leader Charles Schumer stated agreement with Musk. White House press secretary Karoline Leavitt brushed off Musk’s posts, asserting they did not change the president's opinion. House Speaker Mike Johnson pushed back on Musk’s criticism, calling him \"terribly wrong\" despite having spoken with Musk on Monday about the legislation, a conversation Johnson said ended on common ground. Earlier, on May 20, Musk had stated he would stop political spending and leave the White House to return to his companies. Friday marked his last day in the White House, where he and Trump spoke to reporters."}
{"uuid": "bcb6d8b4-5505-4bac-86b7-8bf93312cfc7", "summary": "Donald Trump won a second White House term. On November 7, Johns Hopkins historian Leah Wright Rigueur joined panelists from both political sides to address the possible effects of the election during Johns Hopkins University's virtual event, Insights and Impacts: Post-Election Debrief. Amy Binder introduced the panelists, and Steven Teles moderated the event. Trump received more votes from Latino residents than any other Republican presidential candidate in history and made notable inroads with Black voters, doubling his percentage of support among Black male voters in specific battleground states. In Dearborn, Michigan, 45% of Muslim residents voted for Donald Trump, 33% for Jill Stein, and support for Kamala Harris dropped to the 20s. At the end of his first presidency, Trump wanted to veto a stimulus relief bill passed by Congress but later signed it into law and decided to put his name on the checks. Joe Biden sent a second round of $1,200 relief checks, but did not print his name on them, instead having the Secretary of the Treasury sign them. Many voters overlooked Trump's idiosyncrasies and voted for him. During his first administration, Trump wanted to cut NSF funding, but a Republican-led Congress gave it 20 to 30% increases every year. Trump also tried to overturn the Affordable Care Act, but it was not overturned."}
{"uuid": "d62f7484-52ef-43a6-956e-8601112f6058", "summary": "Trump sweeps all seven swing states, including Arizona."}
{"uuid": "dc2671ad-6240-40fb-b5fb-7ac1eadc4f88", "summary": "The Trump administration canceled $766 million previously awarded to drugmaker Moderna Inc. for a vaccine against potential pandemic influenza viruses, including H5N1 bird flu. Moderna had initially received $176 million in July 2024 and $590 million in January, and was notified Wednesday by the Health and Human Services Department of the fund withdrawal. This cancelation occurred as Moderna announced positive interim results from an early-stage trial of the vaccine that targeted H5 bird flu virus, tested in 300 healthy adults. Last year, H5N1 bird flu viruses spilled from wild birds into U.S. cattle, infecting hundreds of animals in several states and sickening at least 70 people, with one death."}
{"uuid": "c4516a17-d467-4fdc-adfa-5d2874395e13", "summary": "The learning evolution mechanism was clarified using replication dynamic equations for local government and resettlers, their strategy choices, and perceived benefit functions. A system dynamics (SD) model was built using VENSIM PLE 10.2.2 software for the evolutionary game involving water conservancy project relocation stakeholders. Study data for numerical simulation modeling were obtained from the Qianping Reservoir resettlement case report. Initial parameter values for model auxiliary variables were set based on project data, literature, expert consultation, and scenario inequalities. Under Scenario 1 (initial willingness a=0.9, b=0.9), simulation showed both parties reached a stable state at E_a(0,0). Under Scenario 2 (initial willingness a=0.1, b=0.1), simulation showed both parties reached a stable state at E_d(1,1). The subsequent study continued with Scenario 1 parameter settings to analyze external variables' impact on strategy choices. The control variable method was employed to modify one subject's initial willingness probability to observe its impact on the other. When local government’s positive implementation inclination increased, resettlers' strategic choice took longer to reach an evolutionary steady state, resulting in a slower process, but both parties ultimately adopted a negative strategic choice. Adjusting resettlers' voluntary migration probability had minimal effect on the local government's strategic choices and created no distinction. The impact of modifying sensitive variables on strategy choices was examined using a=0.5, b=0.5 for both parties. Increased cost of local government's passive policy implementation (C3, C4) led the local government to favor active policy implementation, while having little impact on resettlers' choices. Increased due diligence reward (S2) for local government slowed passive implementation, with a shift to positive implementation; increased penalties (T2) similarly led the local government towards positive implementation. Decreased reference value of the payment account (U1) caused the local government to transition from passive to active policy implementation, and slowed resettlers' convergence towards involuntary migration without altering their choices. Decreased reference value of the gain account (U2) caused the local government to converge towards active implementation and resettlers to shift from involuntary to voluntary migration. Increased prices set by the local government (T3) in response to involuntary resettler participation led resettlers to converge faster towards a stable state under passive participation, with minimal effect on local government strategy. Increased additional risk (T4) borne by resettlers caused their strategic choice to shift from involuntary to voluntary migration. Increased additional synergistic gains (S4) led to more active implementation by the local government and more voluntary migration by resettlers. When the allocation ratio (ρ) increased (more gain for local government), the local government was more motivated to promote migration, but migrant voluntary participation was lower; conversely, when the ratio decreased (more gain for migrants), migrants were more willing, but local government showed lower implementation motivation. A mutually reinforcing positive feedback cycle emerged between the local government’s \"active implementation\" and resettlers’ \"voluntary participation,\" leading to an E_d(1,1) equilibrium where both probabilities converge to \"1.\" A mutually reinforcing negative feedback cycle emerged when the local government failed in planning/compensation, leading to resettler protests and the local government opting for passive implementation due to additional costs, resulting in an E_a(0,0) equilibrium where both probabilities converge to \"0.\""}
{"uuid": "ad390d00-2226-4d9d-b984-2b4754905ed8", "summary": "Neuralink closed a $650 million funding round, with participation from ARK Invest, Founders Fund, Sequoia Capital, Thrive Capital, and Lightspeed Venture Partners. Five patients have been implanted with Neuralink’s technology and can control digital and physical devices with their thoughts. Neuralink is carrying out four clinical trials for its Telepathy system. Neuralink received a \"Breakthrough Device\" designation from the U.S. Food and Drug Administration for its Blindsight device. Paradromics successfully implanted its BCI in a human for the first time."}
{"uuid": "4696499e-4e4c-4fb0-8393-e14d827d8478", "summary": "Video player was slow to load content. Video content never loaded. Ad froze or did not finish loading. Video content did not start after ad. Audio on ad was too loud."}
{"uuid": "cacea10d-fa6f-4bc7-8018-6cf9a4eec880", "summary": "The Trump administration minimized the COVID-19 threat from January through mid-March despite advance warning. An October 2019 US government report summarized months of simulated pandemic exercises, identifying massive shortfalls in equipment, supplies, facilities, and the supply chain. The US began putting itself on a wartime footing regarding COVID-19 in mid-March. In the Seattle area, University of Washington (UW) physician-scientists anticipated the crisis, developed a COVID-19 test, and invested millions to create testing capacity, overcoming FDA and CDC inertia. By March 13, the UW clinical laboratory conducted 30% of the nation's COVID-19 tests. UW leaders collaborated with health departments, elected officials, and local leaders to prepare, marshal resources, adapt, and solve problems. Separately, Ohio Gov. Mike DeWine mandated social distancing and communicated consistently about the public health emergency. California Gov. Gavin Newsom and local leaders implemented \"stay at home\" orders and rapidly added hospital capacity. New York Gov. Andrew Cuomo conveyed the magnitude of the public health crisis and the need for federal action in briefings."}
{"uuid": "6c0e1e12-9a72-4545-a44e-28026a9be148", "summary": "On March 11, 2020, the World Health Organization (WHO) officially declared the situation a pandemic.\n\nIn Asia, the Iranian government faced criticism for its delayed outbreak response. On March 26, the Iranian government issued an intercity travel ban and closed schools, universities, national parks, and non-essential businesses. Tens of thousands of Afghans began returning to Afghanistan from Iran, with a significant number of Afghanistan's confirmed COVID-19 cases originating from Iran. Afghan government officials recommended social distancing measures and instituted a daytime curfew in Herat. On March 24, Afghanistan’s health ministry warned that half of the country’s population might be infected. In Bangladesh, health authorities began developing a preparedness and response plan with UN agencies for Rohingya refugee camps, and hundreds of health workers started receiving training for disease outbreak detection and prevention. The government of Bangladesh began allowing only essential services to reach the camps.\n\nAcross sub-Saharan Africa, countries began taking precautions, including blocking flights and screening/quarantining passengers, to stop COVID-19. The UN requested nine troop-contributing countries to delay peacekeeper rotations. In the Horn of Africa, Somalia, Ethiopia, and Kenya registered their first COVID-19 cases by March 29, and Kenya confirmed its first COVID-19 death. In Ethiopia, popular sentiment violently turned against foreigners blamed for spreading the disease, and a months-long government-imposed shutdown of phone and internet services in Oromia restricted virus information dissemination. The government in Somalia halted international flights, closed schools, and prohibited large public gatherings. Nigeria was the first central African state to report virus cases, and its government began working with UN leadership to coordinate response efforts. In the Sahel, Marie Rose Compaore, Burkina Faso's second vice-president of the National Assembly, died. The UN’s Office for the Coordination of Humanitarian Affairs (OCHA) postponed a Sahel donor conference due to COVID-19. In the Democratic Republic of Congo (DRC), the two-year Ebola outbreak ended in early March 2020, followed by the arrival of the novel coronavirus. Discussions began to repurpose Ebola health facilities for COVID-19 treatment, and NGOs began integrating coronavirus messaging into their programs. South Sudan suspended all international flights and locked down its land borders (except for cargo). The UN and troop-contributing countries took steps, including a temporary freeze on staff travel into South Sudan, to limit potential exposure.\n\nIn the Americas, the United States began leading the world in confirmed coronavirus cases. Before the outbreak, the U.S. Department of Homeland Security (DHS) returned over 60,000 asylum seekers to northern Mexico under the Migration Protection Protocols (MPP). On March 21, the U.S. government mandated port and border closures due to the pandemic, empowering DHS to immediately turn back or repatriate all asylum seekers without due process. These U.S. measures impeded humanitarian workers from bringing critical supplies to Mexico, and some shelters for asylum seekers on the Mexican side of the border were forced to close. The United States began turning away or repatriating all undocumented migrants, including asylum seekers and unaccompanied minors, to Mexico, Guatemala, Honduras, and Ecuador. The Mexican government agreed to accept most Central American returnees (excluding unaccompanied minors). Many NGOs monitoring the U.S. border reduced or ceased operations due to COVID-19 efforts. Mexican President Andrés Manuel López Obrador was criticized for ignoring the crisis. The Mexican government began implementing virus containment steps, including calling for stay-at-home orders and limiting tourism, and started working to reduce overcrowding in migratory stations. The Mexican government continued to accept deported Mexicans from the U.S. despite inadequate health screenings and indicated it would suspend asylum request processing until April 20. In Central America, Guatemala’s government suspended all international flights and closed borders for 15 days on March 16. On March 17, Guatemala announced the temporary suspension of Honduran and Salvadoran transfers from the U.S. under the Asylum Cooperation Agreement (ACA). Guatemala initially announced suspending acceptance of deported Guatemalan nationals but reversed this decision, and deportations of Guatemalans resumed. The Guatemalan government began warning citizens of immediate deportation if they attempt to go to the U.S. In El Salvador, President Nayib Bukele announced the country would bar entry to all foreigners except diplomats and legal permanent residents. President Bukele announced the creation of a special hospital for COVID-19 patients and called for a halt of deportations from Mexico and the U.S. on March 18; however, deportation flights to El Salvador continued. By March 29, Guatemala, El Salvador, and Honduras all received U.S. Immigration and Customs Enforcement (ICE) air flights from the U.S. In Venezuela, a “social quarantine” was established nation-wide, and military forces were deployed to enforce movement restrictions. On March 24, the Venezuelan government ordered stricter isolation measures in Caracas, Miranda, and Vargas. Nicolás Maduro called on the United States to lift its sanctions on Venezuela, with human rights groups, EU leaders, the UN Secretary-General, and UN High Commissioner for Human Rights echoing these calls. On March 26, the United States indicted Maduro with narco-terrorism and other serious charges. Maduro tried and failed to secure a $5 billion loan from the International Monetary Fund (IMF). President Xi Jinping of China sent 4,000 diagnosis kits to Venezuela, and Cuba sent a medical brigade to help. In Colombia, a 19-day nation-wide lockdown went into effect on March 29. As of March 17, the Colombian government closed its borders. The Colombian government ordered NGOs in the border area to halve their capacity, and on March 16, the Colombian Department of Health announced a prohibition on gatherings of more than 50 people. In Ecuador, borders closed to all foreign travelers on March 15, and gatherings of more than 30 people were banned. In Peru, President Martín Vizcarra declared a state of emergency and initially shut the country’s borders for 15 days on March 15. Four days later, Peru’s government imposed a nationwide curfew and ban on private vehicles. On March 25, President Vizcarra extended the state of emergency and nationwide quarantine through April 12. On March 18, Brazil ordered a partial closing of its border with Venezuela for 15 days.\n\nIn Europe, by March 17, 10 cases were reported among refugees and asylum seekers in Germany. European countries began closing their borders to asylum seekers. By March 16, Greece, Hungary, Belgium, and the Netherlands shut their asylum offices, and asylum services in Italy significantly slowed. NGOs suspended search and rescue operations in the Mediterranean Sea for those crossing from Libya. In Italy, the government called in the military to enforce its lockdown on March 20. On March 22, the Prime Minister ordered all non-essential businesses and factories to close and prohibited non-essential movement. On March 12, the Italian government suspended interviews for refugee status determination (RSD) and hearings for appeals. In Greece, a country-wide lockdown was enacted, closing hotels and suspending most international flights. The Ministry of Migration and Asylum suspended all administrative services until April 13. The Greek government instituted a curfew and prohibited NGOs from entering the camps for at least 14 days. Relief groups called on the Greek government to evacuate camp residents to facilities across the country, and the EU echoed this call for vulnerable asylum seekers.\n\nIn the Middle East, at least three people showing COVID-19 symptoms died in Idlib province in the past week, and several other patients with virus symptoms are quarantined. On March 25, WHO delivered 300 testing kits to northwest Syria. In Iraq, the Baghdad and KRI governments imposed a curfew and cancelled all domestic flights, though security forces struggled to enforce the lockdown as thousands of pilgrims visited shrines. Humanitarian actors reported that curfews and movement restrictions impacted assistance delivery. Humanitarian groups in Iraq developed a COVID-19 preparedness and response plan for camps, and UN agencies began supporting Iraq with testing capacities and procurement of personal protective equipment. In Yemen, both Houthi rebels and the internationally recognized government banned international flights last week, a ban that included chartered medical evacuations. The UN confirmed that Yemeni seaports remained open for cargo, and the UN-led Yemen aid operation continued. The WHO began supporting Yemen's national health authorities with medical supplies, testing kits, training, and information campaigns. Some international relief teams in Yemen scaled back to essential staff only, and a fingerprint-driven digital registration system for aid recipients was paused."}
{"uuid": "40ec4583-a3a0-4c86-9ccd-a6f13f685a65", "summary": "Triple Point Social Housing REIT PLC announced that Tilford Holdings Limited, an entity associated with Steven Peter Windsor, acquired 70,400 ordinary shares of the company. This acquisition increased Steven Peter Windsor and his associated entities' total holdings to 921,514 ordinary shares, representing 0.23% of the company’s issued share capital."}
{"uuid": "45b111ac-55ac-4330-8f02-a250edbe7b9c", "summary": "On March 28, 2025, at 06:20 UTC, a M7.7 earthquake struck Myanmar, followed 12 minutes later by a M6.7 aftershock. The USGS issued a Red alert for shaking-related fatalities and economic losses. The quake caused significant damage across Myanmar, affecting millions and displacing many, and was felt in Thailand and China.\n\nIn Myanmar, national phone and internet infrastructure suffered extensive disruption. The National Unity Government reported 2,970 residential buildings, 150 religious structures, 30 roads, and 7 bridges destroyed or severely damaged. Over 50 mosques collapsed nationwide, with the Islamic community estimating nearly 300 deaths during prayer.\n\nMandalay was severely hit: 674 people died, 1,670 were injured, and over 1,000 were missing. Mandalay University buildings collapsed, fires occurred on campus, and the Dokhtawaddy Bridge failed, causing vehicles to plunge into the river. Over 30 mosques were destroyed. A monastery collapse trapped over 600 monks, killing 80. Other buildings collapsed, trapping dozens. Mandalay Palace, Mahamuni Pagoda, a local dam, and parts of the Mandalay-Yangon highway sustained serious damage. Additional fatalities were reported in Yamethin, Kyaukse, Pyawbwe, Meiktila, Bone Oe (36 in Wundwin), and destruction in Madaya Township.\n\nIn Sagaing Township, widespread structural failure occurred, resulting in nearly 50 deaths and 300 injuries, damaging around 80% of buildings. The Ava Bridge partially collapsed, and four out of five mosques in Sagaing City were destroyed. Historic temples in Chaung-U Township were damaged.\n\nIn Naypyidaw, 204 fatalities were confirmed, including civil servants from collapsed residential buildings. The air traffic control tower at Naypyidaw International Airport collapsed, killing six. Road damage, ceiling collapses, and structural failure affected government buildings, including military headquarters and parliament. The Defence Services Museum and National Museum sustained significant damage. In Pyinmana, 86 bodies were recovered.\n\nIn Shan State, at least 60 deaths were reported in Nyaungshwe Township. Kayla village saw 75% of its buildings destroyed. Significant damage occurred in Zarat Gyi and Seong Wa Gyi. A hotel collapse in Aungban killed two, trapped 20, and injured 16. Jet fighters dropped ordnance on Nawnghkio Township, exacerbating destruction.\n\nIn Bago Region, five children died in a collapsed school and 14 people died in a mosque in Taungoo Township. A displaced persons' shelter collapsed, trapping over 20. A family of four died in Pyu from a collapsed home wall.\n\nIn Yangon, damage was limited, with some tilting buildings and temporary phone line disruptions, but no major casualties.\n\nIn Thailand, at least 10 people were killed, 68 injured, and 90 missing. Building swaying in Bangkok led to mass evacuations, suspending all rapid transit lines for a day and halting trading on the Stock Exchange. A 30-storey government office building under construction in Bangkok's Chatuchak district collapsed, killing at least 8 and trapping 79. A skybridge also fell at a luxury condominium construction site.\n\nBy March 31, 2025, the death toll in Myanmar rose to over 2,900 and in Thailand to 18. Over 3,400 people were injured. Authorities in both countries declared a state of emergency. By April 3, 2025, the death toll in Myanmar increased to 4,390 and in Thailand to 36, with the number of injured surpassing 5,490."}
{"uuid": "98f68da5-c5f6-431b-be4a-abe0f02ff64e", "summary": "Mr. Musk slashed government jobs. His popularity nose-dived. Tesla dealerships faced protests. Tesla sales and profit fell. Tesla's stock dropped 14 percent, wiping $180 billion from its market value. Mr. Trump promoted Tesla cars on the White House lawn. SpaceX secured more government tie-ups for Starlink. On Friday, Mr. Musk attended a news conference with Mr. Trump in the Oval Office. He called his government departure \"not the end of DOGE but really the beginning\" and stated he would continue to visit and advise the president."}
{"uuid": "1219d85b-173c-48f8-a507-871f41cab970", "summary": "In March 2006, Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams created Twitter. That month, Jack Dorsey sent the first Tweet. In July 2007, Twitter received $100,000 in Series A funding led by Union Square Ventures. In October 2008, Twitter's board fired Jack Dorsey over management concerns, and Evan Williams replaced him as CEO. In 2009, Evan Williams appeared on Oprah Winfrey's talk show with Ashton Kutcher, and Ashton Kutcher wrote about Williams and Stone for Time Magazine's Time 100 issue. In 2010, NASA Astronaut Timothy Creamer sent the first tweet from outer orbit. Also in 2010, Evan Williams stepped down as CEO, and Dick Costolo replaced him. In 2011, protesters used Twitter to post reports and organize during the Arab Spring. The death of Whitney Houston was announced on Twitter 55 minutes before AP confirmation in 2011. In 2012, Barack Obama used Twitter to declare victory in the U.S. presidential election. In November 2013, Twitter went public."}
{"uuid": "fddfdff5-38e5-488e-9279-e30b0d03f798", "summary": "Donald Trump was elected the 47th president of the United States on Wednesday. Trump secured the presidency by winning Wisconsin, clearing 270 electoral votes. Trump thanked the American people for his election. Trump outperformed his 2020 election results. He will work with a Republican-controlled Senate. Trump vowed to reshape the federal government and pursue retribution against perceived enemies. Two assassination attempts targeted Trump during the election season. A gunman opened fire at a Trump rally in Pennsylvania, grazing Trump and killing one supporter. A second assassination attempt was thwarted by a Secret Service agent. A new Democratic nominee was selected after Joe Biden exited the race. Trump defeated Kamala Harris. World leaders began sending congratulations. The U.S. Supreme Court, with Trump-appointed justices, issued a ruling affording presidents broad immunity from prosecution. Trump left Washington in early 2021 after his lies about his defeat sparked a violent insurrection at the U.S. Capitol. The U.S. House impeached Trump for his role in the insurrection, and the U.S. Senate acquitted him. Trump worked to maintain political relevance from Mar-a-Lago. Rep. Kevin McCarthy visited Trump after he left office. Trump used his endorsement power to assert party leadership. Trump-backed candidates won primaries, but some lost general elections due to backlash from the Supreme Court's abortion ruling. In 2023, Trump faced state and federal indictments for his role in the insurrection, handling classified information, and election interference. Trump easily captured his party’s nomination. A New York jury found Trump guilty in May of 34 felony charges for illegally influencing the 2016 election. He faces sentencing later this month. Trump was found liable in two other New York civil cases: for inflating assets and sexually abusing E. Jean Carroll. He is subject to additional criminal charges in a Georgia election-interference case. Trump was federally indicted for trying to overturn the 2020 election results and improperly handling classified material. Upon becoming president on Jan. 20, Trump could appoint an attorney general to erase federal charges. Trump vowed to enact a radical agenda, including a large-scale deportation effort, using the Justice Department to punish enemies, expanding tariffs, and pursuing a zero-sum foreign policy. He said he would surround himself with loyalists to enact his agenda."}
{"uuid": "1053ca61-a5a6-4e0e-b5d0-e494425b6280", "summary": "President Trump announced a new tariff system on Wednesday, substituting America's longstanding import tax system. This system includes a 10% \"base line\" tariff on nearly all U.S. imports, excluding products from Canada and Mexico, and \"reciprocal\" tariffs targeting 57 countries with high tariffs or unfair economic practices. Reciprocal tariffs range from 1% to 40% and are added to the 10% base line tariff. The 10% tariffs will go into effect on Saturday, and reciprocal rates next Wednesday. Trump previously applied a 25% tariff on many exports from Canada and Mexico last month, with exceptions for USMCA-qualified products, and these countries are also subject to Trump's global tariffs on cars, steel, and aluminum. New tariffs will apply to European goods (20%), Japanese goods (24%), and South Korean products (26%). Chinese exports face an additional 34% tariff, on top of a 20% tariff applied in recent months and other first-term levies, leading to some products facing a 79% tariff. Vietnamese exports will face a 46% tariff, and Cambodian exports will be taxed at 49%. The White House did not apply tariffs to Russia, North Korea, Cuba, and Belarus. In an executive order, the president stated reciprocal tariffs could be rolled back if countries eliminate unfair trade practices or their U.S. trade deficit drops. The Trump administration promised to channel tariff revenue into tax cuts. The tariff announcement triggered a global meltdown in stock markets."}
{"uuid": "cf1df9ea-c9f6-4fe0-898c-8c4c06960fc9", "summary": "The Parliament's policy report explores the EU's competitiveness quest. In the report, Stéphane Séjourné discusses competitiveness and outlines how the EU can improve its global standing. Federica Di Sario explores frictions hindering Europe’s single market, and Matt Lynes examines the role of Europe’s workforce in its competitiveness drive. In the opinion section, MEP Tsvetelina Penkova outlines how the EU can support digital businesses, MEP Lidia Pereira makes the case for completing the Capital Markets Union, and MEP Christophe Grudler argues for tweaking competition rules and encouraging consumers to buy European."}
{"uuid": "8e4a134f-3486-409c-8e2d-9e784fdc68c4", "summary": "US president considers reciprocal tariffs, which would end the non-discrimination system built after WWII. On February 18, Mario Draghi cited two dangers: higher US tariffs on Chinese products will redirect Chinese overcapacity towards Europe, further hitting European firms. China's GDP threshold of 10% was overtaken in 2024. Chinese trade activity damaged German industry, causing it to lose market share in automotive, cleantech, and civil aviation sectors. In mid-January, a Centre for European Reform study stated China's macroeconomic imbalances infringe on German industrial interests. Chinese manufacturers are preparing to reduce profit margins and conquer other markets to compensate for falling US sales."}
{"uuid": "a4dfdc28-38ee-46ba-8c7c-e0aab56a12a0", "summary": "On Wednesday, June 4, 2025, incessant rain caused fresh landslides and inundation across Arunachal Pradesh, affecting over 3,000 people in 23 districts. Monsoon rain triggered landslides and floods, resulting in 12 fatalities this year and 4 injuries. A person was killed in May when a tree fell on him in Longding district. Search operations are underway for two missing persons. Fresh landslides occurred in Dibang Valley, Anjaw districts, and along the Likabali-Aalo highway, disrupting vehicular movement. Six villages in Changlang were inundated, rendering 2,231 people homeless. Flash floods washed away half of the Makantong bridge on the Trans-Arunachal Highway, cutting off road connectivity between Miao and Bordumsa. Several areas in Miao subdivision were submerged, causing significant losses in livestock and horticultural property. Tourist spots Zupra and River Cafe were submerged by floodwater. Infrastructure at ITI Balinong, including hostels, staff quarters, and water tanks, was damaged. The swollen Noa-Dehing river damaged agricultural and horticultural fields in Dharmapur block. Across the state, 212 houses were damaged, and 425 livestock deaths were reported. Floods and landslides damaged 17 hectares of farmland and 20 hectares of horticulture plantations. In Lower Subansiri, 114 kutcha houses, 51 roads, 17 power lines, 23 water supply lines, and 2 schools were damaged. In Itanagar Capital Region and Pakke Kessang, the main water pipeline and Dariya Hill road suffered severe damage. Authorities opened three relief camps, sheltering 239 displaced people. A total of 2,249 people were evacuated. Relief and rescue efforts are underway, supported by NDRF, SDRF, state police, and volunteers. Deputy Chief Minister Chowna Mein chaired a high-level review meeting on Tuesday to assess damage and disaster response efforts. APCC president Nabam Tuki called for establishing early warning systems and urged deployment of real-time flood and landslide sensors and multi-channel alerts."}
{"uuid": "b1a078c8-197d-4bd8-b62a-4cce5d2e6b70", "summary": "Mr. Kennedy suggested farmers let the bird flu virus run through flocks instead of culling birds, and identify and study surviving birds for immunity. Last week, Mr. Kennedy urged Canadian authorities not to kill 400 H5N1-exposed ostriches, and Dr. Mehmet Oz offered to relocate those birds to his Florida ranch. Mr. Kennedy has campaigned against certain vaccines, especially mRNA-based ones, and repeatedly stated that mRNA Covid vaccines were the \"deadliest\" ever made."}
{"uuid": "ed7088cc-a49b-4fe8-a84d-56e462a8487b", "summary": "Republican Rep. James Comer broadened an investigation into former President Joe Biden's physical and mental decline while in office. On Wednesday, Comer sent letters to five of Biden's closest aides (Ron Klain, Michael Donilon, Bruce Reed, Steve Richetti, Anita Dunn), requesting they answer questions about Biden's \"mental and physical faculties\" and appear for transcribed interviews in mid-July. Comer's committee is also in discussions with four other former White House aides (Anthony Bernal, Annie Tomasini, Ashley Williams, Dr. Kevin O'Connor) to provide testimony. Ron Klain pushed back on accusations he covered up any health issues, instead attributing Biden's poor performance to advisors who had \"isolated him from domestic politics.\""}
{"uuid": "d37a274f-1488-4b33-8f73-ee0a1d324634", "summary": "Former Tesla employees founded their own companies. Former Tesla executives founded electric car startup Lucid in 2007. Ex-Tesla founders established British EV startup Longbow. Drew Baglino, former Tesla senior VP of energy, founded Heron Power, which reportedly raised over $30 million in a Series A round in April. Jay Vijayan, Tesla's former CIO, founded automotive tech startup Tekion, now valued at over $4 billion. Chris Walti, former Tesla Optimus lead, left Tesla in 2022 and founded robotics firm Mytra. Gene Berdichevsky, Tesla's seventh employee, left the company in 2008 and is now CEO of Sila Nanotechnologies. Tobias Kahnert, a senior software engineer at Tesla from 2014 to 2017, founded powertrain startup EFT Mobility."}
{"uuid": "c6428d93-d4cb-4666-8506-d1bb48752831", "summary": "A new article by Boyne, Alviar, and Lense, supported by an NEA award, tracked 43 caregiver/infant dyads for 1.5 years. Researchers examined if parents' social activity predicted their cultivation of a home music environment, singing, and beliefs in music's positive impacts, and if parents' musical training predicted these factors. They also sought to determine if these parental/household factors predicted infant language development. Researchers administered surveys to parents gauging home music environment, musical training, music beliefs, and social competence, and used an inventory tool for parents to report infant language and gestures. Analyses showed parents' social motivation positively correlated with home music environment, music beliefs, and singing. Parents' musical training related solely to their music beliefs and did not correlate with parent-child musical interactions. The study found the overall home music environment and parent singing positively correlated with child language development (vocabulary comprehension, vocabulary production, and gesture production) from 9-18 months. No association was found between parent beliefs and child language development."}
{"uuid": "ddede725-ef2b-4394-a389-0822ae227f7a", "summary": "Mask Network launched in 2017. Mask Network established MaskDAO in early 2025. MaskDAO completed the acquisition of Orb.club, bringing Orb.club into its network of managed projects including Next.ID, Web3.bio, and Firefly.social."}
{"uuid": "cdb3399e-5ab9-4738-b613-89dcb2200381", "summary": "Last week, authorities evacuated an Alpine village as a precaution.\nOn Wednesday, the Birch glacier in Switzerland's Wallis region crumpled.\nA massive landslide of rock and ice resulted, engulfing and largely destroying the hamlet of Blatten.\nA 64-year-old man went missing after the landslide.\nThe deluge of mud, ice, and debris blocked the Lonza River.\nAuthorities declared a state of emergency.\nAuthorities began a search and rescue operation for the missing man using a drone with a thermal camera.\nAuthorities began monitoring the blocked Lonza River due to a serious flood risk from an ice jam.\nAuthorities indicated an assessment of the blocked river would be made from Ferden.\nLate Wednesday, 16 people were evacuated from two downstream villages.\nAn artificial dam was emptied to receive water pushed back by the debris.\nBuildings intact from the landslide began flooding.\nAuthorities are airlifting livestock out of the area."}
{"uuid": "90395859-8e60-43a8-88e3-e2f6ba54f333", "summary": "The site requires protection from spam and bots to maintain free accessibility and prioritize real visitors. Users with Pro access or who have supported the site are intended to bypass this page for faster browsing."}
{"uuid": "416d1192-4444-4a58-9706-303950c46a79", "summary": "The federal government, through the Department of Health and Human Services, canceled a $766 million contract with Moderna to develop an mRNA vaccine against flu strains with pandemic potential, including the H5N1 bird flu virus. HHS cited concerns about the safety of mRNA technology, stating continued investment was not scientifically or ethically justifiable. Moderna's Phase 1/2 study of its H5 avian flu vaccine had produced positive interim results, showing robust immune response and safety. Moderna's CEO stated the company would explore alternative paths for the program. Outside experts criticized the administration's decision, asserting it jeopardizes public health and reduces pandemic preparedness. The H5N1 flu virus has spread to 1,072 dairy herds, over 173 million poultry, and caused 70 human cases, with one U.S. death."}
{"uuid": "f1c91a78-85c5-4e9d-a788-c45ce5f8ce47", "summary": "Parliament's leadership intends to reassign existing staff and reallocate posts upon retirements. The administration is considering withdrawing funding for events, grants for regional/local organizations, and art exhibitions. Senior leadership initially planned to discontinue up to 50 percent of external contracts. The Parliament may slash part of its budget for awards, including the LUX Audience Award, European Citizen’s Prize, and European Charlemagne Youth Prize. The Europa Experience initiative already suffered cuts due to soaring costs and lackluster visitor numbers. Uncertainty prompted some staffers to seek careers in new legislative directorates. Colard refused to provide the number of external staff in the communications department."}
{"uuid": "0610bea1-84d2-4a80-a1e9-d82a483d36a7", "summary": "An earthquake with a 7.7 magnitude occurred in Mandalay, central Myanmar, at 6:21 AM GMT. This event resulted from strike-slip faulting between the India and Eurasia plates on the Sagaing fault at a shallow depth of 10km. The earthquake affected Bangkok, Thailand, and tremors were felt in China's Yunnan province (China reported a 7.9 magnitude). The event caused widespread damage, including collapsed and damaged buildings and buckled roads, with fatalities reported in Myanmar and Thailand. One large aftershock has occurred."}
{"uuid": "35f507a2-a692-46ab-b057-088832b48e19", "summary": "The administration confirmed imposing a 25% automotive tariff under Section 232 on imported passenger vehicles and key automobile parts, effective April 3. President Trump is ending duty-free de minimis treatment for goods from mainland China and Hong Kong, effective May 2, subjecting them to a duty rate of 30% or $25 per item (rising to $50 after June 1, 2025). Many economies began seeking negotiations with the Trump administration to lower tariffs. The administration started discussing the possibility of country and sector-level tariff exemptions and exclusions. President Trump identified pharmaceuticals, semiconductors, lumber, energy, and critical minerals as targets for future sectoral tariffs. Fed policymakers will maintain a reactionary stance, avoiding front-running the tariff impact on output and inflation."}
{"uuid": "f0f7ab54-d3ad-46a2-810a-fb3cd2aacc2e", "summary": "The Trump administration provided a $500 million grant for a broadly protective flu shot. Health and Human Services Secretary Robert F. Kennedy Jr. shifted these funds from a pandemic preparedness fund to a vaccine development program led by scientists Jeffery Taubenberger and Matthew Memoli, whom the administration recently named to senior NIH positions. Trump named Taubenberger acting chief of NIAID in late April. Trump picked Memoli to lead the NIH until April 1, when Jay Bhattacharya took office as NIH leader and named Memoli his principal deputy. In a May 1 news release, HHS called the initiative “Generation Gold Standard.” A 2022 study showed the vaccine protected mice from the flu. An initial safety trial involving 45 patients showed no major side effects for the Taubenberger vaccine, which scientists are testing as a regular shot and an intranasal spray. When asked for supporting data beyond its press release, HHS spokesperson Andrew Nixon pointed to the agency’s one-page statement and did not specifically respond to questions about curtailing funding for other universal vaccine approaches. The government appeared to be transferring the money for the Taubenberger vaccine development from an existing $1.3 billion vaccine fund at Project NextGen, which Nixon stated is under review. As interim director, Memoli oversaw the start of massive cuts at the NIH, eliminating approximately 800 agency grants worth over $2 billion and resulting in the firing of more than 1,200 NIH employees."}
{"uuid": "af6a2b29-0e43-4fc4-a546-1c558904c2c7", "summary": "Donald Trump named Penny Schwinn as Deputy Secretary of Education.\nTrump tapped Lt. Col. Matthew Lohmeier as Under Secretary of the Air Force.\nTrump chose Paul Lawrence as Deputy Secretary of Veterans Affairs.\nTrump tapped Casey Mulligan as Chief Counsel for Advocacy for the Small Business Administration.\nTrump announced James Danly as Deputy Secretary of Energy.\nTrump chose Katharine Macgregor as Deputy Secretary of the Interior.\nTrump named Steven Bradbury as Deputy Secretary of Transportation.\nTrump selected Bill Briggs as Deputy Administrator of the Small Business Administration.\nTrump announced Morgan Ortagus's appointment as Deputy Special Presidential Envoy for the Middle East and scolded her.\nTrump tapped Tammy Bruce as Spokesperson for the U.S. State Department.\nTrump announced Roman Pipko's appointment as Ambassador to Estonia.\nTrump announced Joe Popolo will serve as Ambassador to the Netherlands.\nTrump announced Benjamin Leon Jr.'s appointment as Ambassador to Spain.\nTrump nominated Kevin Marino Cabrera as Ambassador to Panama.\nTrump tapped Stephen Miran to lead the Council of Economic Advisers.\nTrump tapped Tilman Fertitta as Ambassador to Italy.\nTrump named Mark Burnett as Special Envoy to the U.K.\nTrump tapped David Fink to lead the Federal Railroad Administration.\nTrump nominated Aaron Reitz to serve as Head of the Justice Department’s Office of Legal Policy.\nTrump nominated Chad Mizelle to serve as Chief of Staff at the Justice Department.\nTrump announced Brian Burch as Ambassador to the Holy See.\nTrump picked Herschel Walker to serve as Ambassador to the Bahamas.\nTrump picked Ric Grenell for the newly created position of Envoy for Special Missions.\nTrump nominated Edward Sharp Walsh as Ambassador to Ireland.\nDevin Nunes was announced as Trump’s nominee for Chairman of the President’s Intelligence Advisory Board.\nTrump nominated Troy Edgar as Deputy Secretary of Homeland Security.\nTrump named Michael Rigas as Deputy Secretary of State for Management and Resources.\nTrump selected Bill White as Ambassador to Belgium.\nDaniel Newlin is Trump’s pick for Ambassador to Colombia.\nTrump tapped Peter Lamelas to serve as Ambassador to Argentina.\nTrump named Leandro Rizzuto Jr. as Ambassador to the Organization of American States.\nTrump announced he is picking Kari Lake to serve as Director of Voice of America.\nJacob Helberg was appointed as Undersecretary of State for Economic Growth, Energy and the Environment.\nTrump appointed Ronald Johnson as Ambassador to Mexico.\nEd Martin was appointed as Chief of Staff at the Office of Management and Budget.\nMark Meador was tapped as a Commissioner for the Federal Trade Commission.\nKimberly Guilfoyle was nominated to serve as the U.S. Ambassador to Greece.\nTom Barrack was announced as Trump’s pick for U.S. Ambassador to Turkey.\nAndrew N. Ferguson was selected as Chair of the Federal Trade Commission.\nTrump nominated Rep. Dan Bishop as Deputy Director for Budget at the Office of Management and Budget.\nTrump nominated Harmeet Dhillon to lead the Justice Department’s Office of Civil Rights.\nTrump announced Mark Paoletta will return to the role of Office of Management and Budget General Counsel.\nTrump announced Alina Habba will serve as Counselor to the President.\nTrump tapped Christopher Landau as Deputy Secretary of State.\nTrump named Michael Anton as Director of Policy Planning for the State Department.\nMichael Needham will serve as a State Department Counselor.\nTrump announced David Sacks as the White House’s Artificial Intelligence and Cryptocurrency Czar.\nTrump noted David Sacks will also lead the Presidential Council of Advisors for Science and Technology.\nFormer Sen. David Perdue was nominated by Trump as the U.S. Ambassador to China.\nTrump picked Rodney Scott as Commissioner of U.S. Customs and Border Protection.\nTrump picked Frank Bisignano to serve as Commissioner of the Social Security Administration.\nFormer Sen. Kelly Loeffler was nominated as Administrator of the Small Business Administration.\nTrump selected former Rep. Billy Long as the Internal Revenue Service’s 51st Commissioner.\nTrump announced David Warrington as White House Counsel.\nTrump said William McGinley will serve as Counsel for the newly created Department of Government Efficiency.\nTrump tapped Monica Crowley as Assistant Secretary of State and Chief of Protocol of the U.S.\nTrump tapped Paul Atkins for Securities and Exchange Commission Chair.\nChad Chronister was Trump’s initial choice to lead the Drug Enforcement Agency.\nChronister withdrew from consideration for DEA Administrator.\nTrump stated he pulled Chronister out from consideration for DEA Administrator.\nTrump chose Peter Navarro for Senior Counselor for Trade and Manufacturing.\nTrump tapped billionaire Jared Isaacman as Administrator of the National Aeronautics and Space Administration.\nTrump announced Daniel Driscoll will serve as Army Secretary.\nAdam Boehler will serve as Special Envoy for Hostage Affairs.\nTrump chose Warren Stephens to serve as his Envoy to the United Kingdom.\nTrump tapped Massad Boulos as his Senior Advisor on Arab and Middle Eastern Affairs.\nTrump announced Kash Patel as FBI Director.\nTrump nominated Charles Kushner as U.S. Ambassador to France.\nTrump named Keith Kellogg as Special Envoy for Ukraine and Russia, a newly created position.\nDr. Jay Bhattacharya is Trump’s pick to lead the National Institutes of Health.\nJamieson Greer is Trump’s pick to lead international trade negotiations as United States Trade Representative.\nTrump picked Kevin Hassett to lead the National Economic Council.\nVince Haley was named as the head of the Domestic Policy Council.\nJim O’Neill was named as the pick for Department of Health and Human Services Deputy Secretary.\nTrump tapped John Phelan as his nominee for Secretary of the Navy.\nScott Bessent is Trump’s pick for Treasury Secretary.\nTrump announced Pam Bondi as Attorney General.\nTrump selected Pete Hegseth as Secretary of Defense.\nTrump nominated Robert F. Kennedy Jr. to lead the Health and Human Services Department.\nTrump nominated Sen. Marco Rubio as Secretary of State.\nTrump announced Tulsi Gabbard will serve as Director of National Intelligence.\nTrump tapped Linda McMahon as Secretary of the Department of Education.\nHoward Lutnick is Trump’s pick for Commerce Secretary.\nTrump picked South Dakota Gov. Kristi Noem for the role of Secretary of the Department of Homeland Security.\nTrump announced Brooke Rollins as Agriculture Secretary.\nMehmet Oz will fill the role of Centers For Medicare And Medicaid Services Administrator.\nTrump named Susie Wiles Chief of Staff.\nTrump announced Elon Musk will run a new Department of Government Efficiency alongside Vivek Ramaswamy.\nTrump nominated Russell Vought as Director of the Office of Budget and Management.\nTrump announced Stephen Miller as White House Deputy Chief of Staff for Policy and Homeland Security Adviser.\nTrump appointed Tom Homan to the newly created role of Border Czar.\nTrump announced Dave Weldon as CDC Director.\nTrump tapped Marty Makary as FDA Commissioner.\nTrump named Janette Nesheiwat as Surgeon General.\nRep. Lori Chavez-DeRemer was nominated as Trump’s Secretary of Labor.\nSebastian Gorka was appointed as Deputy Assistant to the President and Senior Director for Counterterrorism.\nTrump named Scott Turner as Secretary of the Department of Housing and Urban Development.\nTrump appointed Rep. Mike Waltz to serve as National Security Adviser.\nTrump nominated North Dakota Gov. Doug Burgum as Secretary of the Interior.\nTrump tapped Doug Burgum as Chairman of the new National Energy Council.\nChris Wright was named Trump’s nominee for Secretary of Energy.\nTrump nominated former Rep. Sean Duffy as Secretary of Transportation.\nTrump picked former Rep. Doug Collins as Secretary for Veterans Affairs.\nJohn Ratcliffe will serve as CIA Director.\nTrump tapped former Rep. Lee Zeldin to lead the EPA.\nTrump named Brendan Carr to chair the Federal Communications Commission.\nTrump nominated Rep. Elise Stefanik for the United Nations Ambassador role.\nTrump tapped Steven Witkoff for Special Envoy to the Middle East.\nTrump announced Matthew Whitaker will serve as the official U.S. Representative to NATO.\nTrump announced former Arkansas Gov. Mike Huckabee as his Envoy to Israel.\nKaroline Leavitt will serve as White House Press Secretary.\nTrump picked Steven Cheung to serve as White House Communications Director.\nTrump named James Braid Director of Legislative Affairs.\nMatt Brasseaux was appointed Director of the Office of Political Affairs.\nAlex Latcham will serve as Director of the Office of Public Liaison.\nDan Scavino will return to his role as Deputy Chief of Staff.\nJames Blair will work as Deputy Chief of Staff for Legislative, Political and Public Affairs.\nTaylor Budowich was picked for Deputy Chief of Staff for Communications and Personnel.\nTrump tapped William Scharf to be White House Staff Secretary.\nSergio Gor has been tapped to lead the Presidential Personnel Office.\nJoseph Nocella Jr. was tapped as U.S. Attorney for the Eastern District of New York.\nTodd Blanche was tapped as Deputy Attorney General.\nTrump picked Emil Bove as Principal Associate Deputy Attorney General.\nDean John Sauer was chosen for Solicitor General.\nJay Clayton was chosen as U.S. Attorney for the Southern District of New York.\nTrump asked Republican National Committee co-chair Michael Whatley to return to his role."}
{"uuid": "14738743-69d8-4794-b78f-f5d6ab15a7de", "summary": "Mohamed Sabry Soliman, an Egyptian national in the U.S. illegally, allegedly set a pro-Israel group on fire in Boulder, Colorado, while yelling anti-Israel slogans. Soliman was arrested at the scene. The FBI labeled the incident a \"targeted terror attack\" and is investigating it. Federal court filings revealed Soliman admitted planning the attack for a year, intending to kill \"Zionist\" people, and would repeat the attack. Soliman was charged with a federal hate crime. Ohio GOP Sen. Bernie Moreno sent a letter to FBI Director Kash Patel calling for an investigation into Soliman's potential terror ties. Moreno requested answers within 60 days regarding Soliman's potential terror ties, who harbored him, travel funding, links to ISIS/Hamas, his vetting process, and his asylum and work authorization history. Soliman initially entered the U.S. on a tourist visa during the Biden administration, overstayed, filed an asylum request, and was granted work authorization."}
{"uuid": "e911f804-7e9d-4c44-b0d9-926141d62536", "summary": "The 2022 catastrophic floods killed 45 people and displaced thousands in eastern Kentucky. In Fisty, eight homes, two shops, and nine people were swept away. Some residents dismissed cellphone flood alerts, while others could not escape. Landslides trapped survivors and deceased for several days. University of Kentucky geologists secured an NSF grant and collected perishable data to understand the flooding. The Baker family rebuilt their workshop on Troublesome Creek with Fema assistance. Harold and James Baker's vigilance averted another catastrophe on Valentine's Day, with no deaths. In July 2022, geologist Ryan Thigpen found flood debris 118 inches high on two-story buildings. The February flood reached 23 inches on Harold Baker's trailer. Hurricane Helene killed over 230 people, nearly half in Appalachia. 23 people died in February 2025 rains, and 24 more died in April 2025 during a four-day storm. The Baker family evacuated to a church during the February flood and waited 26 hours for water to subside. After a mid-May visit, severe storms triggered multiple tornadoes, killing 28 people. Hundreds of National Weather Service (NWS) staff left due to layoffs and buyouts, leading to canceled weather balloon launches and some forecasting offices losing 24/7 cover. Trump's team threatened to slash $1.52 billion from NOAA funding. The University of Kentucky team documented over 3,000 landslides triggered by the 2022 rain event. Kentucky secured a $24 million NSF grant for a five-year research project, which created science jobs and student opportunities. The grant funded high-tech equipment. The team measures water levels and analyzes sediment deposits after major storms. A study by PhD student Meredith Swallom found mining and redirected waterways affect flood height. A paleo-flood project is underway; PhD student Luciano Cardone will dig for ancient sediment layers and found a journal describing 1795 flooding. The team developed one working flood risk model. The NSF director resigned in April after a White House order to cut the budget and staff. An NSF governing body member resigned, citing interference in grant decisions. Fleming-Neon was gutted by the 2022 storm; only two businesses reopened, and several others were abandoned. Randall and Bonnie Kincer's flower shop was flooded with 120 inches of water in 2022 and 52 inches in February. A tiered retainer wall was anchored into a hill in Fleming-Neon. A massive landslide occurred after the February storm. Thomas Hutton's house was swamped after the landslide blocked the creek. Geologists fly Lidar-fitted drones for surveys. Lidar detected recent deforestation above the Fleming-Neon power plant. Last year's NSF grant funded new soil/moisture sensors and mini weather stations. The landslide team is installing sensors on 14 steep slopes. Geologists will use sensor data to create models for landslide risk warnings."}
{"uuid": "a31bda2a-838f-4ab3-8c42-9ee97f815993", "summary": "Palantir (PLTR) shares gained 2.2% to close at $78.05 on Tuesday, rebounding from a 10% decline the previous session and taking a breather from a three-week slump. Over three weeks, PLTR shares lost over a third of their market value and fell 38% since hitting a record high last month. Shares came under pressure recently after a report surfaced last month that the Pentagon plans a military spending reduction, and due to broader tech selling. Bearish price action continued into this week.\n\nViking Holdings (VIK) shares sank 6.1% on Tuesday as executives warned of macroeconomic \"uncertainties\" on their Q4 earnings call. Viking CFO Leah Talactac stated February bookings were slower after a record January. Viking reported Q4 revenue of $1.35 billion and adjusted EPS of 45 cents. As of Feb. 23, Viking recorded $5.3 billion in advance bookings year-to-date for 2025.\n\nAsana (ASAN) shares lost nearly a quarter of their value, closing 24% lower at $12.64 on Tuesday. This followed an announcement late Monday that CEO Dustin Moskovitz decided to step down, though he will continue as board chair and retain his shares. Asana also gave a weak fiscal 2026 outlook, expecting revenue of $782 million to $790 million.\n\nMany AI investor plays rebounded on Tuesday: Super Micro Computer (SMCI) was up 10.7%, Vistra (VST) up 5.4%, Nvidia (NVDA) up 1.7%, Palantir (PLTR) rebounded 4%, Applovin (APP) rebounded about 8%, and Tesla (TSLA) advanced nearly 4%. AI stocks had lost momentum in late January and early February.\n\nThe S&P 500 on Monday fell below its 200-day moving average for the first time since 2023.\n\nTesla (TSLA) shares jumped 5% to around $233 in late trading on Tuesday, making back a fraction of what was lost after a 15% decline on Monday. The stock is on pace to fall for the eighth consecutive week. Tesla's stock price surged to a record close of $479.86 about a month after Trump’s election victory, but has lost almost half its value since Musk started working in the Department of Government Efficiency in January. On Monday, shares closed below their Election Day level for the first time and fell below the 200-week moving average. Since hitting a record high in mid-December, shares have fallen 55%.\n\nOptimism among small businesses fell in February. An index measuring uncertainty rose to its second-highest level in 50 years. The net percentage of businesses raising prices rose 10 percentage points to 32%.\n\nDelta Air Lines (DAL), Southwest Airlines (LUV), and American Airlines (AAL) lowered their Q1 projections. American Airlines projected a larger loss than previously expected. Southwest Airlines announced new revenue-generating measures. JetBlue (JBLU) lowered its Q1 projection for available seat miles.\n\nTeradyne (TER) shares plummeted 18% on Tuesday, reaching their lowest level in over a year, after the company updated its guidance in response to potential tariff impact. Teradyne anticipates Q2 revenue to be flat to down 10% from Q1, and fiscal 2026 EPS and revenue trending toward the low end of previous models. The company announced it bought privately held Quantifi Photonics.\n\nSouthwest Airlines (LUV) shares surged over 6% on Tuesday after the airline announced it would introduce a basic economy ticket option and baggage fees for flights booked on or after May 28. Southwest in July announced an end to its open seating policy and introduced overnight flights last month. It plans to start booking assigned seating flights in H2 2024 and roll out changes in 2026. Southwest also lowered its projected growth for Q1 revenue per available seat mile.\n\nKohl's (KSS) shares plunged 15% in early trading, dipping below $10 for the first time since 1997, after the retailer's fiscal 2025 forecasts fell short of analysts' expectations. Kohl's projects fiscal 2025 net sales to fall 5% to 7%, comparable sales to fall 4% to 6%, and EPS of $0.10 to $0.60. For Q4, Kohl's posted EPS of $0.43 on net revenue of $5.4 billion, though adjusted EPS of $0.95 topped estimates. Kohl's comparable store sales fell by 6.7%. Kohl's missed estimates last quarter and announced Michaels Cos. CEO Ashley Buchanan would replace Tom Kingsbury as CEO."}
{"uuid": "7de2a034-7039-492a-89b0-7ed0443572c2", "summary": "Necessary cookies distinguish humans from bots. Functional cookies remember a user's selected website language version. Performance/Analytical cookies register a unique ID to generate statistical data on visitor website use and are used by Google Analytics to throttle request rate. Advertising/Marketing cookies collect information on consumer behavior, which is sent to Alexa Analytics."}
{"uuid": "8093c44a-ae56-4e66-b295-3371e7b2c08e", "summary": "Four north-eastern rivers swelled further, as reported by the Flood Forecasting and Warning Centre on June 3. The onrush of water from upstream India forced several hundred families to move to safety and flood shelter centres. The death toll from flash floods and landslides reached 15. Road connectivity and economic activities in flood-hit areas were disrupted. The government opened flood shelters in Sylhet. Four members of a family died from landslides in Sylhet."}
{"uuid": "dfb69458-c320-4c10-a6fc-64aec7e109fe", "summary": "A 7.7 magnitude earthquake struck Myanmar on Friday at 0620 GMT (12:50 pm local time), with its epicenter located in Mandalay at a depth of 10 kilometers. Multiple aftershocks followed, including a 6.4 and a 6.7 magnitude quake, totaling 15 earthquakes recorded in Myanmar within 10 hours. Another 4.2 magnitude earthquake hit Myanmar late Friday.\n\nThe earthquake caused roads to buckle, buildings to collapse, and widespread damage in Myanmar, including multiple buildings in Mandalay (e.g., Ma Soe Yane monastery, former royal palace) and the collapse of buildings in five cities/towns, a railway bridge, and a road bridge on the Yangon-Mandalay Expressway. At least 3 people died after a mosque in Taungnoo, Myanmar, partially collapsed. The Red Cross reported damaged public infrastructure, including roads and bridges, with concerns for large dams.\n\nTremors were felt across northern Thailand, Bangkok, Vietnam, China's Yunnan province, West Bengal's Kolkata, Manipur's Imphal, and Bangladesh (7.3 magnitude).\n\nMyanmar's ruling junta chief reported at least 144 people killed and over 732 injured in Myanmar, with approximately 20 deaths at a Naypyidaw hospital. The US Geological Survey estimated the death toll could exceed 1,000.\n\nIn Thailand, the earthquake caused a high-rise under construction in Bangkok to collapse. Bangkok authorities reported 10 killed, 16 injured, and 101 missing from three construction sites in the city. Thailand's telecommunication system was disrupted, and its transport ministry ordered public transportation service suspension. Bangkok was declared a disaster area, and its governor was placed in charge of disaster response.\n\nMyanmar's ruling military declared a state of emergency in multiple regions, and a major hospital in Naypyidaw was declared a \"mass casualty area.\" Myanmar's military leader appealed for international aid and called for donations of blood and medical supplies.\n\nIndia sent approximately 15 tonnes of relief material to Myanmar via an IAF C-130J aircraft. US President Donald Trump promised US assistance to Myanmar. The WHO mobilized its logistics hub to prepare trauma injury supplies for Myanmar. UN Secretary-General stated the UN is mobilizing to help Myanmar and Thailand. The Indian embassy in Bangkok issued an emergency helpline number for Indian nationals. PM Modi assured assistance to Myanmar and Thailand."}
{"uuid": "b8bb70ba-bb93-41b0-9bea-1de11ea303ac", "summary": "A DEM of Difference (DoD) produced from pre and post-flood LiDAR revealed distinct channel changes. The first 7 km of the study channel showed minimal erosion and widening. From 7 km downstream, coinciding with three major lateral sediment inputs (~105,000 m3 total) from landslides L1, L2, and a tributary, channel erosion and widening significantly increased, with the most rapid transition (up to 67m widening) occurring in a 3.5 km reach. Researchers investigated if this pattern was amplified by (1) flow bulking from sediment or (2) damming by sediment and subsequent dam failure. Field measurements of highwater marks from the 2013 flood were collected using GPS in 2016 and 2017. Calculations showed runoff-based peak discharge (Qrunoff) increased slightly, but field-measured peak discharge (Qpeak) rapidly increased from 72 m3/s to 468 m3/s downstream from L2. The estimated runoff coefficient (C), the ratio of Qpeak to Qrunoff, increased from 0.33 to 2.15 downstream from L2, with values >2 diagnostic of surge-type behavior. A cobble and boulder rich sediment bar was observed downstream from L2. Numerical simulations using r.avaflow were performed in two stages. Stage 1 simulated landslides L1 and L2 delivering sediment, forming a large dam downstream from L2 and a smaller dam upstream from L1. Stage 2 simulated the removal of the large dam within 900 seconds, with bulk erosion occurring over ~300 seconds, causing immediate downstream channel erosion and widening due to flow bulking. The combined simulated topographic change aligned well with observed erosion patterns. A control simulation without landslide sediment input showed only limited erosion, confirming that landslide-dam failure and rapid sediment delivery best explain the observed geomorphic channel change. The simulations supported both hypotheses: dam formation and removal, and subsequent downstream channel widening from flow bulking by sediment."}
{"uuid": "084cf0b0-0b4b-47eb-b86d-10c6b01978af", "summary": "President Yoon Suk Yeol declared martial law late Tuesday, plunging South Korea into political crisis. Demonstrations intensified through the week. On Saturday, tens of thousands of protesters massed outside the National Assembly in Seoul, calling for President Yoon’s ouster as lawmakers inside voted on his impeachment. During the rally, crowds swelled, and Seoul’s subway operator closed three nearby stations. Organizers arranged cross-country transportation for protesters using Facebook. The impeachment motion against President Yoon failed. After the motion failed, the crowd in Seoul thinned out. Concurrently, a smaller group of Mr. Yoon’s supporters gathered in another part of Seoul. They criticized opposition leader Lee Jae-myung, asserting Mr. Yoon protected the country from communism and preserved its relationship with the United States."}
{"uuid": "02945558-a6da-420c-822c-a87002168e91", "summary": "Tariffs will now not be cumulative. Mexico will no longer face 50% tariffs, and those affected by 50% tariffs from Mexico will be reimbursed. A proclamation allows companies with factories in the US to access two-year tariff discounts on foreign parts based on the quantity and price of cars assembled and sold in the US. The elimination of tariff accumulation reduces the weighted average tariff from 18.2% to 13.9%."}
{"uuid": "75523b50-c97d-4ad2-9810-f6486979186a", "summary": "Elon Musk and Vivek Ramaswamy sent representatives to federal agencies. Aides from the \"Department of Government Efficiency\" (DOGE), tied to President-elect Donald Trump's transition team, spoke with staff at over a dozen federal agencies, including Treasury, IRS, Homeland Security, Veterans Affairs, and Health and Human Services. Musk and Ramaswamy increased hiring for DOGE, with over 50 staffers working from SpaceX offices in Washington, aiming for 100 by Trump's Jan. 20 inauguration. The project encountered obstacles, including congressional Republican reluctance on budget cuts and civil service skepticism. Musk began tempering his initial promise of $2 trillion in federal spending cuts, suggesting a $1 trillion target instead. The concept of a waste-cutting commission was adopted by Musk and Trump during the last presidential election. Musk contributed $277 million to Trump's and other Republicans' 2024 campaigns, and Trump subsequently named Musk as a powerful adviser. Following the election, Trump appointed Musk and Ramaswamy as DOGE's co-leaders, tasked with identifying government waste for the White House Office of Management and Budget. DOGE received numerous applications via X after issuing a public call for \"super high-IQ small-government revolutionaries.\" DOGE posted for specific full-time, salaried roles, including IT, HR, financial staffers, and software/information security engineers. Key leadership appointments include Steve Davis overseeing the overall effort, deputies recruited for legislation and regulation, Emil Michael overseeing regulation cuts, Katie Miller (announced by Trump), and Bill McGinley (announced by Trump in December) as DOGE counsel. As Musk's emissaries made contact with federal officials, unresolved questions persisted regarding DOGE's authority and responsibilities."}
{"uuid": "b76da644-95f6-4753-aed3-9687c788045c", "summary": "Elon Musk criticized President Donald Trump's tax bill. Musk posted on X, calling the Congressional spending bill a \"disgusting abomination\" and a \"massive, outrageous, pork-filled\" bill. The US doubled its tariff on steel and aluminum from 25% to 50%. A man convicted of murder in the fatal stabbing of Cash App founder Bill Lee was sentenced."}
{"uuid": "956c3a67-e2f4-445f-82ca-6bd6f77af032", "summary": "Mr. Trump stated DOGE would drive drastic change and provide outside advice on how to cut wasteful spending, specifically by offering recommendations for programs to cut. Many executives involved expect to perform six-month voluntary stints inside the federal government. Mr. Musk stated DOGE participants will not be paid and asked them to work 80-hour weeks. Some, possibly Mr. Musk, will serve as special government employees. DOGE representatives will largely be stationed inside federal agencies. After consideration by top officials, DOGE is now unlikely to incorporate as an organized outside entity or nonprofit."}
{"uuid": "b097a1a3-dd18-4fe6-9ca8-7b09999656b7", "summary": "Relentless monsoon rains caused floods and landslides in India's northeastern states over the weekend. At least 30 people died across the region: 8 in Assam, 9 in Arunachal Pradesh, 5 in Mizoram, 6 in Meghalaya, and 2 in Nagaland and Tripura. A mudslide in Guwahati, Assam, killed three family members. Heavy rains led to flooding and long power outages in Guwahati, prompting authorities to shut schools and colleges on Saturday. Authorities in Assam disconnected electricity in several areas. Meghalaya’s Chief Minister ordered emergency teams to stay vigilant. The Indian Army launched a large-scale rescue effort in Manipur, evacuating hundreds, shifting people to safer places, and providing food, water, and essential medicines. India’s weather agency issued a red alert for several northeastern districts. Rivers across the region breached their banks, submerging vast areas and cutting off access to many communities."}
{"uuid": "9d89b70b-feb1-43ca-9290-7e44e3b694cb", "summary": "Donald Trump won reelection to the White House, securing a majority and the Electoral College. Exit polls indicated Latinx men moved toward Trump, though pre-election polling showed 55% Latine support for Harris in battleground states. Democrats had nominated women as presidential candidates twice in the past eight years, with both losing. The Republican Party used anti-trans hate in their campaign, while Democrats remained mostly silent on the issue. Harris's campaign changed tactics after the Sept. 10 debate, dropping her provocative spirit and offering evasive, scripted answers. Democrats' strategy included ceding the spotlight to Trump, expressing sympathy for voters, and proposing specific tax credits and benefits. Trump campaigned by casting a dark picture of criminal immigration, demonization, and national decline. While Harris won the overall women's vote and voters of color, white women, Native Americans, and Latino men favored Trump. Beyond the presidential race, Democrats won statewide offices in Arizona, North Carolina, Wisconsin, and Michigan. Arizona’s constitutional right to abortion amendment passed, as did Alaska’s minimum wage increase and sick leave requirement. New African American female senators from Delaware and Maryland were elected, along with the first transgender representative and LGBTQ+ representative from the South."}
{"uuid": "b03b8cf8-55b4-4e59-8488-82dc432c7c08", "summary": "Jake Tapper and Alex Thompson published \"Original Sin,\" a new book alleging a \"cover up\" of the previous president’s infirmity and implying Joe Biden's pride led to Donald Trump's victory. The book's publication aims to sell copies by leveraging Biden's unpopularity and Republican desires. Extensive media reporting focused on Biden's age before and after the election. Tapper stated the alleged \"cover up\" was worse than Watergate. Scott Lemieux believes Kamala Harris would have been the Democratic nominee even if Biden had dropped out after the 2022 midterms. Lemieux stated that attributing Trump's win solely to Biden not stepping down oversimplifies the issue. Biden appeared to decline substantially in his last 12-18 months in office. Biden's inner circle was not sufficiently candid with the public or in advising him. Press coverage of an aging president decreased when Harris became the Democratic nominee. The New Yorker titled an excerpt from \"Original Sin\" \"How Joe Biden Handed the Presidency to Donald Trump.\" Tapper asserted the 2020 primary outcome resulted from Barack Obama and others encouraging candidates like Buttigieg, Klobuchar, Booker, and Warren to drop out and support Biden. Booker dropped out in January 2020; Warren and Bloomberg did not drop out before Super Tuesday 2020. Two minor candidates dropped out in the 2020 primary. Democratic elites were largely lukewarm about Biden but hoped a younger candidate would emerge. Some coordination occurred between Obama and Klobuchar/Buttigieg after South Carolina and Alabama. Party elites wanted to unite around Biden after his win became inevitable. Biden was the clear choice of Democratic voters in 2020. Bernie Sanders pursued a factional campaign strategy in 2020. In 2016, media covered Trump as a sideshow and Clinton as if she was the president-elect. Mainstream outlets refused to publish hacked material about the Trump campaign from Iranian intelligence. In 2016, media extensively covered hacked material spun for Trump despite its lack of serious news value."}
{"uuid": "aa9dfc9c-e558-434f-bd57-1a21155fc02f", "summary": "*   David Lebryk, top civil servant at the Treasury Department, unexpectedly departed his position after Trump-affiliated officials expressed interest in stopping federal payments.\n*   Trump-affiliated employees specifically asked Treasury about its ability to halt payments, which Lebryk resisted.\n*   Elon Musk publicly urged rallies opposing taxpayer funding for NGOs.\n*   Three former Musk employees took top positions at the Office of Personnel Management (OPM): Amanda Scales became Chief of Staff, and Brian Bjelde and Anthony Armstrong became senior directors.\n*   OPM created a government-wide email system and offered millions of federal workers the option to resign with pay until September.\n*   Unions and government watchdogs declared OPM's resignation offer illegal.\n*   Other Musk allies secured positions in additional federal agencies, including the General Services Administration.\n*   Donald Trump stated that federal workers would be terminated if they did not return to their offices by February 6.\n*   A plan, outlined by Musk, proposed identifying minimum agency staffing levels to enable mass head-count reductions by suspending worker protections.\n*   This plan also sought new presidential power to ignore Congress and impound funds.\n*   The plan aimed to cut $500 billion in spending, targeting public broadcasting and foreign aid.\n*   Trump issued an order to halt federal grants, which was later rescinded.\n*   The plan included examining Medicare spending."}
{"uuid": "f062c1b8-f183-4a1e-9e00-51882ebd2f39", "summary": "Elon Musk announced his departure from his special government employee role, then met President Trump in the Oval Office on a Friday. In previous public actions, Musk appeared onstage at CPAC in February, unsuccessfully tried to sway a Wisconsin judicial race in March via X posts, and slammed Peter Navarro on X in April. The White House downplayed the Navarro conflict, and Karoline Leavitt commented, \"Boys will be boys\"; Musk was briefed on tariffs' effects in late April. In December, Musk torpedoed a bipartisan spending bill via X posts and threatened primary challengers for Republican supporters.\n\nLast week, Musk began publicly criticizing President Trump’s domestic policy bill on CBS News. The bill passed the House on May 22, following Trump's strong pressure campaign, House Speaker Mike Johnson corralling factions, Trump summoning holdouts to the White House, and Trump's staff likening opposition to \"ultimate betrayal.\" On Monday, Johnson spoke with Musk. On Tuesday, Musk lashed out on X against the bill, calling it a \"disgusting abomination\" and telling House members they \"did wrong.\" He criticized the bill in about 10 posts, resharing commentary from Senators Rand Paul and Mike Lee, and hinted at supporting efforts to unseat politicians who backed the bill in 2026. Earlier Tuesday, Musk shared a meme on X.\n\nHouse Speaker Johnson called Musk’s criticism \"very disappointing\" and stated Musk \"seemed to understand\" the bill's virtues. White House Press Secretary Leavitt stated the president knew Musk's stance and would stick to the bill. Senator Chuck Schumer brought a copy of Musk's X posts to a news conference and stated Musk was \"right\" and Republicans \"should listen to him.\" President Trump has urged swift passage of the legislation. Republican senators plan to make changes to the bill, and fiscal conservatives demanded further changes and cuts. Trump warned Republicans not to alter Medicaid. A representative for Musk did not respond to requests for comment."}
{"uuid": "2ba173c9-8bee-41a0-b8cb-c94e65ae5d08", "summary": "Archer's Midnight prototype successfully completed a piloted flight test last week. Tesla indicated it is too stretched to seriously consider an eVTOL venture. Several eVTOL startups, including Lilium and Volocopter, encountered financial difficulties."}
{"uuid": "3392db54-4510-4226-83ba-efb18d986be0", "summary": "In New Delhi, a fruit vendor's sales dropped by half, leading her to dilute milk for her children. In central Turkey, a hot air balloon company banished 49 employees to indefinite leave and cut their wages by half. A bartender in Manila for an international cruise line is marooned at home. A mother who braids hair in Johannesburg goes home empty-handed. A cabdriver in Buenos Aires prowls deserted streets for fares. The coronavirus pandemic halted the global economy, causing vulnerable countries to suffer intensifying harm. Businesses, facing disappearing sales, are laying off workers. Households, short of income, are skimping on food. International investment is fleeing emerging markets, diminishing currency values and forcing people to pay more for imported food and fuel."}
{"uuid": "67e57d81-8930-434c-a81e-271d96206c2e", "summary": "xAI acquired X in an all-stock transaction. The deal valued xAI at $80 billion and X at $33 billion, resulting in a total combined value of $113 billion. The new joint entity will be known as XAI Holdings."}
{"uuid": "3308854f-4989-4d73-bf5c-867d7b636824", "summary": "A 7.7-magnitude earthquake hit Myanmar on Friday. The Mandalay General Hospital is full, no longer admitting patients, and is out of power and water. The earthquake was caused by a rupture that lasted for a full minute, causing sideways ground movements. The Myanmar earthquake was comparable in size to one that struck Turkey in 2023, which killed over 55,000 people in Turkey and Syria."}
{"uuid": "5a729774-b665-4f5b-a234-b6d359899a3b", "summary": "President Trump plans to impose new tariffs on imported goods on April 2, which he calls \"liberation day.\" He has promised to announce and enact widespread tariffs on global trading partners. On March 4, Trump spoke about plans to implement \"reciprocal tariffs\" on other nations. By March 17, Trump told reporters April 2 is \"liberation day\" due to expected wealth return from tariffs. Tariffs on imported steel and aluminum are already in effect. Tariffs on imported autos and auto parts are set to go into effect on April 3. Trump also announced tariffs on Chinese goods generally and any country buying oil from Venezuela. Last week, after imposing auto tariffs, Trump and Canadian Prime Minister Mark Carney had a call, during which Trump suggested negotiations were possible."}
{"uuid": "50804ea5-3458-4bd2-89e5-439746b9d8e0", "summary": "The FBI warns of fabricated videos misusing its name and insignia to undermine electoral confidence. One video falsely claims the FBI was aware of 301 electors reporting attempted bribery and blackmail. Another video falsely claims the FBI is investigating voter pressure at US military bases overseas. A third video claims a US social media company saw an increase in separatist groups with an audience over 40 million people. A fourth video falsely claims the FBI ordered media to restrict information about elector bribery. The FBI states each of these videos contains false information."}
{"uuid": "f42c8e85-2a6c-44b9-b378-7c34e7a12f12", "summary": "Over 600,000 people marched in London last week for peace and justice in the Holy Land. Three petitions are currently open: one to stop all arms exports to Israel and seek a ceasefire, closing June 5, 2025; another to impose economic sanctions on Israel, closing June 9, 2025; and a third to fulfil the UK's humanitarian obligations to Gaza, closing July 28, 2025."}
{"uuid": "ed9aadf1-7fc3-4f8c-9f8b-41086707905a", "summary": "Baek Jae Gil adapted “Feliz Navidad” into a protest anthem as tens of thousands of South Korean protesters called for President Yoon Suk Yeol’s removal. Last week, President Yoon Suk Yeol declared martial law, and hundreds of soldiers stormed the National Assembly. The day after Yoon’s declaration, Baek Jae Gil performed his protest anthem for thousands outside the National Assembly in Seoul. A recording of this performance received nine million views on X, and the song spread on TikTok, Instagram, YouTube, and was translated into Chinese on WeChat.\n\nHistorically, soldiers suppressed pro-democracy protests in Gwangju in 1980, the last time South Korea was under martial law. In 1989, a brutally suppressed teachers movement occurred, leading to the formation of a national union. In 1990, a high school friend turned Baek Jae Gil's poems into songs, and Baek Jae Gil first performed as a singer at a pro-democracy campus protest. In 1991, Baek Jae Gil performed guitar for students and workers whose demonstrations were set off by a student activist's killing, leading to about a dozen protesters dying by self-immolation. Candlelight vigils began in 2002 after two schoolgirls were fatally struck by a U.S. Army vehicle, though a U.S. military court acquitted two soldiers in the crash. In 2016, protests against President Park Geun-hye led to her impeachment, and a protester performed an earlier \"Feliz Navidad\" adaptation, \"Geun-hye Is Not the One.\"\n\nBaek Jae Gil wrote his version of the song in 2022, the same year Mr. Yoon became president. Protests calling for Yoon’s removal grew after a crowd crush in Seoul killed over 150 people. Earlier this year, a government-run broadcaster accused Baek Jae Gil of copyright infringement for using its footage in a YouTube video; YouTube deleted his video at the broadcaster’s request, and police launched an investigation. Baek Jae Gil sang the anthem again at protests last Saturday."}
{"uuid": "9f900a60-7fa1-4a52-adb5-02384fb623c2", "summary": "Russia’s 2022 reinvasion of Ukraine significantly upended the geopolitics of oil. OPEC+ decided to reduce oil production by 1.2 million barrels a day, causing an uptick in oil prices. The Biden administration expressed disappointment with OPEC+'s decision and, in the summer of 2022, tapped into the U.S. strategic petroleum reserves, withdrawing 180 million barrels. Saudi Arabia adopted a non-alignment policy concerning Russia and Ukraine. China brokered a significant deal between Saudi Arabia and Iran. Russia continues to produce and sell its oil at discounted prices, with Turkey, Singapore, China, and India buying it. The EU taxonomy for green energy went into effect in January 2022. France pivoted from its plan to reduce nuclear capacity and decided to build more nuclear power plants. Sweden announced plans to build new nuclear power plants and increase capacity. Japan also decided to restart nuclear power plants."}
{"uuid": "a04c031d-96b8-44d0-8e68-295683362398", "summary": "On Memorial Day, Donald Trump promoted an online item describing Joe Biden, who had recently been diagnosed with prostate cancer, as “a decrepit corpse.” On Friday, Trump urged people not to feel sympathy for Biden as he combats cancer, claiming Biden was “vicious” due to a Republican conspiracy theory about Trump’s 2023 criminal indictments. On Saturday night, President Donald Trump reposted a baseless claim on Truth Social that former President Joe Biden was executed in 2020 and replaced with clones or robots."}
{"uuid": "5459f536-7024-4e9c-9b13-e61d155e1645", "summary": "The live page closed."}
{"uuid": "72153c2c-909e-4b15-abdc-70f998d14d67", "summary": "In February, new leadership at the Department of Health and Human Services (HHS) informed Moderna they were reviewing two contracts. Subsequently, HHS notified Moderna of the cancellation of these contracts, valued at $766 million, which were for developing, testing, and licensing vaccines for flu subtypes like H5N1."}
{"uuid": "4e2e13bb-bd29-4267-bc42-c476602c905d", "summary": "County election officials provide information to vote reporters on Election Day. NBC News gathers new information, causing the expected vote figure to change."}
{"uuid": "b01e020b-d924-47d1-ae7e-4657029889a4", "summary": "New rules establish obligations for AI providers and users based on risk qualification. AI applications banned in the EU include cognitive behavioural manipulation, social scoring, biometric identification and categorisation of people, and real-time/remote biometric identification systems. Real-time remote biometric identification systems are allowed in limited serious cases for law enforcement. Post remote biometric identification systems are allowed to prosecute serious crimes after court approval. AI systems negatively affecting safety or fundamental rights are considered high risk. High-risk AI systems, including those in EU product safety legislation products and those in specific areas (e.g., critical infrastructure, education, law enforcement), must be assessed before market placement and throughout their lifecycle, and those in specific areas must also be registered in an EU database. Individuals gain the right to file complaints about AI systems with national authorities. Generative AI must comply with transparency requirements and EU copyright law, specifically by disclosing AI-generated content, designing models to prevent illegal content generation, and publishing summaries of copyrighted training data. High-impact general-purpose AI models must undergo thorough evaluations, and serious incidents must be reported to the European Commission. AI-generated or modified content must be clearly labelled."}
{"uuid": "85797923-8d54-491b-8255-ca93f3a54d2c", "summary": "Duke Capital provided Tristone Healthcare with £2 million to finance its acquisition of Serenity Care Homes. This funding increased Duke Capital's total credit financing to Tristone Healthcare to £21.2 million. Duke Capital will also invest a further £500,000 in additional equity into Tristone Healthcare, increasing its stake from 21.3 per cent to 28.4 per cent. Tristone Healthcare's acquisition of Serenity Care Homes enlarges and extends its group's reach and impact."}
{"uuid": "c82e96c7-569f-43f3-a296-c0f11d3f4f82", "summary": "Elon Musk tweeted his dislike for advertising three years before finalizing his purchase of Twitter. After acquiring the company, Mr. Musk tweeted a truce to advertisers, stating his aim to make Twitter “the most respected advertising platform,” and sought to ease brand safety fears by promising a platform that followed government regulations and was “warm and welcoming to all.” In response, General Motors announced it would suspend its advertising on Twitter, some clients of advertising executives indicated they would pause business with Twitter, and HBO stated it would be assessing the platform under its new leadership."}
{"uuid": "de394317-7a49-4233-9f9c-bce560cef94e", "summary": "Foreign Affairs was founded in 1922. The magazine featured contributions from many leading international affairs experts."}
{"uuid": "c78e92f5-645b-4721-80b4-7b251b7dc099", "summary": "Heavy rains, floods, and landslides in northeastern India resulted in at least 30 deaths and affected thousands. A landslide struck a military camp in Sikkim, killing two soldiers and one porter, and leaving six soldiers missing; the army continues rescue operations for the missing. Flooding in Assam affected 17 districts, impacting over 364,000 people, for whom 52 relief camps were set up. In Manipur, the army evacuated over 500 civilians from waterlogged areas in Imphal. Officials reported 10 deaths in Arunachal Pradesh and 8 deaths in Assam due to landslides and floods. On Sunday, Indian Home Minister Amit Shah spoke with top officials in Assam, Sikkim, Arunachal Pradesh, and Manipur's governor, assuring them of help."}
{"uuid": "1df40ee6-a568-4667-b4aa-19e4f6f415c6", "summary": "The COVID-19 pandemic caused the loss of over 3.24 million lives globally by May 6, 2021, and affected over 200 countries by April 2021. Many countries declared lockdowns. Lockdowns triggered an increased risk of domestic violence. Domestic abuse increased by 5% in Australia, threefold in China after lockdown, and by 21-35% in various US states. Lockdowns obstructed agricultural flow, resulting in hiked food prices, food shortages, malnutrition, and recorded deaths. By April 2020, 34.5% of US households with children experienced food shortages, and 17.4% of US mothers with young children reported insufficient food for children. By the end of 2020, 12,000 people per day died from hunger-linked COVID-19 effects. The healthcare system's shifted attention to COVID-19 patients disrupted services for other medical conditions, resulting in many deaths. During the pandemic, regular healthcare services reduced, hospital facilities were restructured for COVID-19 patients, health professionals shifted to COVID-19 departments, and shortages of beds, operation theaters, doctors, and nurses occurred. In-person healthcare services decreased, and telehealth use was supported."}
{"uuid": "81011aa0-93c4-447f-b22a-a3e4ebff2689", "summary": "The coronavirus spreads globally. COVID-19 causes deaths in the U.S. The disease leads to havoc, loneliness, and financial insecurity. Suicide prevention experts anticipate increased suicide risk for certain populations due to the pandemic. Social distancing and quarantines may trigger suicidal thoughts. Research indicates pandemic-related social and economic fallout may amplify suicide risk post-outbreak. The public health approach to contain coronavirus requires people to forgo in-person connections. The pandemic creates major challenges for mental health care. Many therapists cease in-person client sessions. A 2010 study found social disengagement, stress, and anxiety contributed to high suicide deaths among older adults during SARS in Hong Kong. Research confirms unemployment as a suicide risk factor. At least one client attempted suicide due to impending job loss. Communities initiate efforts to identify isolated individuals at risk. Churches conduct outreach. Parents establish Facebook groups. Local organizations assist older adults with emergency needs. President Donald Trump signed a multibillion-dollar emergency aid package. The aid package provides paid sick leave for Americans. Additional economic relief plans are underway. Some individuals experiencing suicidal ideation may find purpose and meaning during the crisis, potentially improving their well-being."}
{"uuid": "cf29a9e2-c5da-4317-b76a-11f43f6640c3", "summary": "Open the menu and switch the Market flag to obtain targeted data from your country of choice."}
{"uuid": "c9f1001f-45f7-467c-9ca7-addc5c594e14", "summary": "South Korean President Yoon Suk Yeol declared martial law in a surprise televised address, accusing the opposition-controlled parliament of \"paralyzing\" the system and stating his aim was \"to crush North Korea-sympathizing anti-state forces.\" A martial-law command then issued a decree suspending the legislature, blocking political activities, and controlling media, threatening warrantless arrests. Leaders of both ruling and opposition parties immediately decried Yoon's action as unconstitutional and illegal. Amid armed soldiers swarming the legislature, 190 lawmakers gathered at the National Assembly and unanimously annulled martial law. President Yoon lifted the emergency martial law at 4:30 a.m. on Wednesday, six hours after declaring it. Before the annulment, nearly 300 martial law troops had stormed the parliament, with some smashing windows, while protesters and parliament staffers attempted to block them and built barricades. National Assembly Secretary General Kim Min-ki subsequently prohibited defense ministry and police members from entering parliament. Calls are growing for President Yoon to resign or face impeachment. Opposition parties filed an impeachment motion against Yoon, signed by all their lawmakers. Civic groups plan large-scale rallies urging Yoon's ouster. Yoon's senior aides and defense minister offered to resign. The Democratic Party is accusing the president, defense minister, and interior minister of insurrection. The Korean Won and stock prices experienced large fluctuations. Diplomatic and military schedules, including a Swedish prime minister visit and a US-SK nuclear meeting, are being delayed. The U.S. Embassy in Seoul issued an alert advising citizens to avoid protests, with the U.K. issuing a similar advisory. The U.S. Embassy later stated Yoon's announcement to end martial law was a crucial step, and the White House expressed relief."}
{"uuid": "f68e72a1-b268-49ee-9022-b0d854b6a893", "summary": "The US Department of Health and Human Services (HHS) terminated its $590 million contract with Moderna for a bird flu vaccine, stating the project did not meet scientific or safety expectations after a rigorous review. This contract was initially announced in mid-January. Moderna had announced that an early-phase trial of its H5 bird flu vaccine showed a rapid, potent, and durable immune response. Moderna CEO Stephane Bancel stated the company will explore alternative paths for the program. In February, Bloomberg News had reported that US health officials were reevaluating the contract."}
{"uuid": "e3446293-9f8f-4fb1-9380-7b0dd980a922", "summary": "In July 2023, former FBI Director Christopher Wray testified to House lawmakers that a controversial memo targeting \"radical traditionalist Catholics\" was a single product from a single field office. Senator Chuck Grassley released documents obtained from the FBI that contradicted Wray's testimony. These documents revealed the FBI produced at least 13 additional documents and five attachments with anti-Catholic terminology. The documents also showed the FBI's Richmond Field Office drafted a second memo that repeated an \"unfounded link between traditional Catholicism and violent extremism\"; Grassley later released this memo. Richmond FBI officials collaborated with field offices in Louisville, Portland, and Milwaukee while drafting the initial memo. In February 2023, the first anti-Catholic Richmond Memo was widely distributed to over 1,000 FBI employees nationwide. Backlash from the initial memo's whistleblower disclosure prevented the Richmond office from releasing the second memo. Grassley wrote a letter to FBI Director Kash Patel, stating Wray's testimony was inaccurate and demanding more documents. Grassley, conservatives, and Catholics criticized the FBI for relying on the Southern Poverty Law Center's \"hate group\" classifications in the memo. Grassley informed Patel he continues to investigate the Richmond memo and the FBI's culture."}
{"uuid": "c1df6447-e49b-4750-89f7-440e3f3a5768", "summary": "Moscow banned gatherings exceeding 5,000 attendees until April 10. President Vladimir Putin endorsed a proposal to remain in office until 2036. In Iran, Internet connectivity dipped, and Wikipedia’s Farsi edition was temporarily blocked. China censored specific keywords across the YY and WeChat platforms. Singapore ordered Facebook to restrict domestic access to the States Times Review’s page. China mandated residents use a new app that determines health status, dictates movement, and shares user location with police. Moscow began using citywide facial recognition to identify quarantine violators. A Kyrgyzstan court banned mass rallies in Bishkek and cited coronavirus to ban an International Women’s Day rally, despite no reported cases. El Salvador barred gatherings over 500 people, despite no confirmed cases. Iraq prohibited public gatherings. The United States pressured airlines to provide international travelers’ phone numbers and email addresses."}
{"uuid": "05c4cb5a-0c99-4824-82e1-2620ec1cbb70", "summary": "An earthquake struck Myanmar on Friday. Myanmar’s military-dominated government issued a rare plea for outside help, with military spokesman Gen. Zaw Min Tun stating the country needs international humanitarian aid and will cooperate. In 2021, Myanmar's military seized power in a coup and imposed a brutal crackdown. Following the coup, the United States and many Western nations cut off Myanmar. On Friday, the United Nations mobilized help for Myanmar."}
{"uuid": "2fbead20-388a-4950-b212-bdc19fe92063", "summary": "President Trump imposed high tariffs on Chinese imports. In April, Beijing responded by restricting rare earth exports and pausing many shipments. In May, Ford Motor temporarily closed a Chicago factory due to a magnet shortage. The United States suspended some sales of jet engine and semiconductor components and software to China. US officials accelerated efforts to find more domestic rare earth supplies, considering funding for new mines. The Trump administration considered adding major Chinese chipmakers and tech giants (Alibaba, Tencent, Baidu units) to an entity list, prohibiting trade. After Trump levied tariffs, many American companies established factories outside China. China's Xi Jinping invested heavily in domestic semiconductor, solar panel, and EV factories to reduce foreign reliance. Since 2022, the United States expanded a global system to regulate advanced semiconductors and prevent their flow to China. The US extended these export controls globally, forbidding foreign companies from selling products to China if they use American parts, technology, or software. Beijing set up a licensing system to monitor and approve worldwide sales of rare earths and magnets. In May, American and Chinese officials arranged a meeting in Geneva. In Geneva, negotiators agreed to lower tariffs, and China stated it would suspend or remove non-tariff countermeasures taken since April. The Trump administration proposed plans to revoke visas of Chinese students with ties to the Communist Party."}
{"uuid": "e39028aa-c8f2-4441-b06b-a913b931a993", "summary": "The Birch Glacier collapsed earlier this week. A massive avalanche of rock and ice swept into the Lötschental valley, burying much of Blatten village under mud and debris. The collapse caused debris to fill the Lonza River bed, creating a dam and forming a lake upstream. Authorities had evacuated over 300 people and livestock from Blatten village earlier this month. One man remains missing, and the search and rescue operation was temporarily suspended due to falling debris. Authorities began dismantling pedestrian bridges and reinforcing critical infrastructure in Gampel. A pedestrian bridge over the Lonza River in Gampel-Steg was preventively closed. Residents were advised to arrange emergency accommodation. Authorities emptied the Ferden dam downstream. The Swiss army was deployed to the region. President Karin Keller-Sutter visited the region on Friday."}
{"uuid": "1ef2d01a-cf29-417b-a47f-12442ddf0c3d", "summary": "The House Judiciary Committee scheduled a closed-door interview with former Hunter Biden special counsel David Weiss for Friday. The committee also secured interviews with two Department of Justice tax division prosecutors involved in the Hunter Biden probe. The Justice Department is working with Weiss to provide access to documents for his interview. House Oversight Chair James Comer resumed his probe into the former president’s mental fitness. Comer is scheduling interviews with Biden’s White House physician and other senior aides. Former Democratic Rep. Dean Phillips called on Biden to authorize his physician to disclose his health file and condition under oath. Biden was recently diagnosed with an aggressive form of prostate cancer."}
{"uuid": "280ed404-f948-4202-9d9f-09f2f4652c36", "summary": "Elon Musk officially took over Twitter. He stated plans for sweeping policy changes, including potentially loosening speech rules, implementing a user authentication requirement, and removing only illegal speech. While Musk walked back claims about laying off one-third of the workforce, top executives, including Vijaya Gadde, were fired and escorted from the company's headquarters. Musk also tempered earlier statements by saying he won't turn Twitter into a \"free-for-all hellscape,\" but stated his intent to cut back on Twitter’s efforts to fight misinformation and disinformation."}
{"uuid": "e8768da7-4fab-420c-a72a-e9f311c3ff53", "summary": "A magnitude-7.9 earthquake rocked central Myanmar on Friday at 2:20 pm Beijing time, with an epicenter at 21.85N, 95.95E, and a depth of 30 kilometers. The quake sent strong tremors to neighboring regions, including southwestern China, South Asia, and Southeast Asia. A magnitude-6.4 aftershock occurred 12 minutes later. By Friday night, 144 people were killed and 732 injured in Myanmar. Medical workers treated an earthquake survivor in Nay Pyi Daw, where injured people also gathered outside a hospital emergency department. The quake caused the collapse of the Old Sagaing Bridge and several buildings in Mandalay and Nay Pyi Daw. It damaged sections of the Mandalay-Yangon expressway, leading to road closures, and prompted the closure of Mandalay and Nay Pyi Daw airports. Myanmar's National Disaster Management Committee declared a state of emergency in six quake-affected areas. A government spokesperson urged international humanitarian aid, and the Myanmar Red Cross Society began providing first-aid and emergency response. The Chinese embassy in Myanmar urged Chinese nationals to remain on guard and follow local government guidance to relocate to safe areas. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Southwest China's Yunnan province."}
