{"uuid": "170e254c-813f-4ad5-a1c6-175bae922580", "events": ["The UK drafted the EU Counter Terrorism Strategy in 2005.", "The UK influenced EU initiatives, including the Europol Counter Terrorism Centre (CTC) and the PNRD.", "The UK joined the Schengen Information System."]}
{"uuid": "d946af30-0e7a-4f5d-bbe4-bc46f77d3c58", "events": ["The British people voted to leave the European Union.", "David Cameron announced his resignation as Prime Minister."]}
{"uuid": "0301392a-4d86-4050-bba5-e81a8687b41a", "events": ["U.K. voters voted to leave the European Union.", "Prime Minister Cameron announced his resignation.", "The British pound plunged in value.", "Global stock markets plummeted.", "Northern Ireland and Scotland voted to remain in the EU."]}
{"uuid": "f40503ee-3fa9-4d17-9204-6c68f351ec1f", "events": ["The UK voted to leave the EU in a June 23 referendum.", "Scotland voted to remain in the EU."]}
{"uuid": "99a38386-9bd2-4e95-bd36-71dfb87e9e57", "events": ["The UK voted to leave the European Union.", "British Prime Minister David Cameron announced his intention to stand down.", "Global markets plunged following the Brexit vote.", "Nicola Sturgeon stated the Scottish government would prepare legislation for a new independence referendum.", "Sinn Fein called for a referendum on Irish unity."]}
{"uuid": "6d0770a0-2d1d-44d0-a7c7-f35768ea0da7", "events": ["Prime Minister David Cameron pledged a referendum on EU membership in 2013.", "The Conservative Party won the election.", "The referendum date was set in February.", "Cameron's attempt to renegotiate the U.K.'s EU membership terms failed.", "The nation divided into 'remain' and 'leave' camps."]}
{"uuid": "03a2a3de-9ffd-437a-a89f-a3ab4247b5f5", "events": ["The United Kingdom held a referendum on June 23."]}
{"uuid": "2e7648b1-3db0-4cbc-8629-21effdd66915", "events": ["British voters elected to leave the European Union.", "UK Independence Party leader Nigel Farage admitted a key Leave campaign promise was inaccurate.", "The British pound plummeted and global stocks tanked.", "Over three million Brits called for a do-over."]}
{"uuid": "bdaaad99-e348-4c13-8c4d-a256e413cfc7", "events": ["Trump supporters protested in Washington, D.C.", "Trump addressed the crowd.", "Protesters clashed with police and breached security barriers at the Capitol.", "The House and Senate recessed, and the Capitol was locked down."]}
{"uuid": "056dc362-f9c1-4308-bf84-94c7e11403a3", "events": ["Supporters stormed the U.S. Capitol.", "The congressional certification of Joe Biden’s victory was halted.", "Four people died during the Capitol assault.", "The D.C. National Guard was activated, and a citywide curfew was imposed.", "Police arrested at least 52 people and discovered pipe bombs and molotov cocktails."]}
{"uuid": "05cc9105-e4c2-4b62-bc40-d7a0552d4205", "events": ["Trump supporters overtook the U.S. Capitol.", "A woman was shot inside the Capitol and died.", "The Capitol was secured, and lawmakers reconvened to continue certification.", "Trump spoke to supporters on the National Mall before the riot.", "Twitter removed Trump's tweets and locked his account."]}
{"uuid": "fa4c71ce-8b4c-4979-8675-aebd333e278b", "events": ["Washington experienced a riot/insurrection on January 6th.", "Attempts to overturn the November election failed.", "Congress confirmed Biden as president in the early hours of January 7th."]}
{"uuid": "462cad8a-b7ae-4e63-915f-3ffc05b95d17", "events": ["An angry mob stormed the Capitol.", "Five people died during the riots.", "Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned.", "Vice President Pence helped facilitate the DC National Guard deployment.", "The FBI and ATF cleared the Capitol."]}
{"uuid": "551735d4-4483-400c-8d9a-b039f72f6bc8", "events": ["Trump's supporters stormed the U.S. Capitol.", "Lawmakers fled the House and Senate.", "The electoral college vote count was delayed.", "Nancy Pelosi and Charles Schumer called for Trump's removal from office.", "Pro-Trump demonstrators rallied outside Los Angeles City Hall."]}
{"uuid": "497da6cd-648f-4e6e-9c88-17cc2e6f12ce", "events": ["President Trump spoke against election results near the White House and urged supporters to march to the Capitol.", "Pipe bombs were reported at the Republican National Committee building and the Democratic National Committee headquarters.", "Rioters clashed with police and breached outer perimeters at the Capitol.", "Rioters broke into the Capitol building.", "The House and Senate went into recess, and some members of Congress evacuated."]}
{"uuid": "f5d1baeb-d512-4e01-9a58-06ce1fbd072f", "events": ["Trump supporters stormed the U.S. Capitol.", "The Capitol was locked down.", "Both chambers went into recess.", "Tear gas was used in the Rotunda.", "Trump urged supporters to march to the Capitol."]}
{"uuid": "e070dd35-d311-47d3-8701-e9a0a471e21d", "events": ["The Texas Department of Public Safety closed the Texas State Capitol and surrounding grounds on Wednesday.", "The Texas Capitol had reopened to the public on Monday."]}
{"uuid": "8e5d15da-6ca3-4d68-a6ac-b9517e955f34", "events": ["Trump supporters assaulted a photographer and television crews.", "A conspiracy theory that Antifa instigated the Capitol attack spread.", "Trump was permanently banned from Twitter on January 8th.", "Trump was impeached for a second time on January 13th.", "Congress reconvened and certified the election after the siege."]}
{"uuid": "c0d8ae97-2ef0-467d-90ad-39c9efecb0a7", "events": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally.", "Security arrested the suspected gunman, Tetsuya Yamagami.", "Leaders of many countries expressed their condolences to Abe"]}
{"uuid": "b53fa159-9f2d-4778-9656-cbe07ef28e22", "events": ["Shinzo Abe was assassinated in Nara.", "The suspected gunman was arrested at the scene.", "Videos of the assassination circulated on social media.", "Social media companies removed harmful content."]}
{"uuid": "7c98a54e-55ba-4f7a-969b-3e86f8203fbb", "events": ["Shinzo Abe reinterpreted Japan's constitution in 2014.", "Shinzo Abe coined the phrase 'a free and open Indo-Pacific'.", "Shinzo Abe promoted the Quadrilateral Security Dialogue (Quad).", "Shinzo Abe outlined his vision for a 'free and open Indo-Pacific' in 2016.", "The US adopted the 'free and open Indo-Pacific' concept."]}
{"uuid": "12333a6e-f99f-40b7-a6ce-d44be1cb4fe9", "events": ["Shinzo Abe became the deputy chief cabinet secretary in the early 2000s.", "Shinzo Abe became the youngest prime minister in postwar Japan in 2006.", "Shinzo Abe returned to office in 2012 and later became the longest-serving prime minister.", "Shinzo Abe implemented 'Abenomics'.", "Yoshihide Suga succeeded Shinzo Abe in September 2020."]}
{"uuid": "95ebe31d-9840-4156-8f5b-200c95f5f322", "events": ["Shinzo Abe was assassinated during a campaign rally in Nara, Japan.", "The shooter used a handmade gun.", "Handmade guns were seized at the shooter's home."]}
{"uuid": "3370d672-e37d-4fe8-a684-ab8b2e532b96", "events": ["Former Japanese Prime Minister Shinzo Abe was shot while delivering a campaign speech in Nara.", "Shinzo Abe was pronounced dead at 5:03 p.m.", "Tetsuya Yamagami was arrested for attempted murder.", "World leaders condemned the attack."]}
{"uuid": "4fde9acc-506e-41d9-9f71-9699f63b9249", "events": ["Former Japanese Prime Minister Shinzo Abe was murdered on July 8, 2022, while campaigning in Nara.", "A man fired twice at Shinzo Abe.", "Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun.", "Explosives were found at Tetsuya Yamagami's home.", "World leaders expressed shock and condemned the murder."]}
{"uuid": "fbe94a47-01d1-4586-92c5-c23c4a117f4e", "events": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally.", "Benjamin Netanyahu visited Tokyo in 2014.", "Shinzo Abe offered to host a peace summit in 2017.", "Shinzo Abe visited Jerusalem in 2018."]}
