{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "0039ac4d-ccb6-4b30-8acc-6d399bb94902", "event1": "Trump supporters protested in Washington, D.C.", "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n"], "event1_order": 1, "event2": "Pipe bombs were reported at the Republican National Committee building and the Democratic National Committee headquarters.", "event2_context": ["On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n"], "event2_order": 4, "ori_avg": 22, "ori_var": 273}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "55fb23eb-9a92-4203-8e34-06a9db402c8f", "event1": "Trump addressed the crowd.", "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n"], "event1_order": 2, "event2": "Pipe bombs were reported at the Republican National Committee building and the Democratic National Committee headquarters.", "event2_context": ["On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n"], "event2_order": 4, "ori_avg": 25, "ori_var": 110.33333333333333}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "b4759a1c-cd6c-4f0f-a80b-a8f9e61fb887", "event1": "Yoshihide Suga succeeded Shinzo Abe in September 2020.", "event1_context": ["In the early 2000s, Shinzo Abe was the deputy chief cabinet secretary. In 2002, Abe handled arrangements for a summit between Junichiro Koizumi and Kim Jong Il in Pyongyang. In 2006, Abe became the youngest prime minister in postwar Japan. In 2012, Abe returned to office and later became the longest-serving prime minister. During his tenure, Abe implemented \"Abenomics,\" and the stock market increased but economic inequality widened. Yoshihide Suga succeeded Abe in September 2020. Abe met with Donald Trump and Vladimir Putin, and in 2014, he met with Xi Jinping. After his death, Abe was celebrated for strengthening the defense alliance with the United States. Abe wanted to revise the Japanese Constitution but died still pushing for it.\n"], "event1_order": 10, "event2": "A man fired twice at Shinzo Abe.", "event2_context": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally. Security arrested the suspected gunman, Tetsuya Yamagami. Yamagami fired two shots at Abe; the second shot hit Abe's chest and neck. Abe died several hours later. Yamagami attacked Abe due to Abe's association with a group Yamagami hated. Tributes were given by President Biden, Secretary of State Antony Blinken, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin, and former Australian Prime Minister Tony Abbott. Abe worked to build up Japan's military and reform the economy. Abe failed to revise Japan's constitution but passed legislation allowing Japan's military to expand operations overseas. Abe was a critic of China and called on the US to give Taiwan assurances of help in the event of an attack by China.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n", "Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event2_order": 12, "ori_avg": 4, "ori_var": 65.33333333333333}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "e52399e6-2d0a-4460-b398-da5fca3ec154", "event1": "Yoshihide Suga succeeded Shinzo Abe in September 2020.", "event1_context": ["In the early 2000s, Shinzo Abe was the deputy chief cabinet secretary. In 2002, Abe handled arrangements for a summit between Junichiro Koizumi and Kim Jong Il in Pyongyang. In 2006, Abe became the youngest prime minister in postwar Japan. In 2012, Abe returned to office and later became the longest-serving prime minister. During his tenure, Abe implemented \"Abenomics,\" and the stock market increased but economic inequality widened. Yoshihide Suga succeeded Abe in September 2020. Abe met with Donald Trump and Vladimir Putin, and in 2014, he met with Xi Jinping. After his death, Abe was celebrated for strengthening the defense alliance with the United States. Abe wanted to revise the Japanese Constitution but died still pushing for it.\n"], "event1_order": 10, "event2": "Social media companies removed harmful content.", "event2_context": ["Shinzo Abe, Japan's former prime minister, was assassinated while giving a campaign speech in Nara. The suspected gunman was arrested at the scene with a handmade gun. Abe, 67, was shot, collapsed, and was bleeding from the chest. Videos of the assassination circulated on social media, prompting social media companies to remove harmful content. Abe was a polarizing figure known for revitalizing Japan’s economy and his revisionist views of World War II.\n"], "event2_order": 17, "ori_avg": 6, "ori_var": 86.33333333333333}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "1379f1e8-c8ad-4f2c-a28b-58e42e64a70b", "event1": "The Capitol was secured, and lawmakers reconvened to continue certification.", "event1_context": ["On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n", "Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event1_order": 13, "event2": "Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned.", "event2_context": ["Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n"], "event2_order": 15, "ori_avg": 83, "ori_var": 108.33333333333333}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "8757c32f-d1c0-4024-8547-c32942bc16e6", "event1": "Shinzo Abe became the youngest prime minister in postwar Japan in 2006.", "event1_context": ["In the early 2000s, Shinzo Abe was the deputy chief cabinet secretary. In 2002, Abe handled arrangements for a summit between Junichiro Koizumi and Kim Jong Il in Pyongyang. In 2006, Abe became the youngest prime minister in postwar Japan. In 2012, Abe returned to office and later became the longest-serving prime minister. During his tenure, Abe implemented \"Abenomics,\" and the stock market increased but economic inequality widened. Yoshihide Suga succeeded Abe in September 2020. Abe met with Donald Trump and Vladimir Putin, and in 2014, he met with Xi Jinping. After his death, Abe was celebrated for strengthening the defense alliance with the United States. Abe wanted to revise the Japanese Constitution but died still pushing for it.\n"], "event1_order": 2, "event2": "Benjamin Netanyahu visited Tokyo in 2014.", "event2_context": ["Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event2_order": 5, "ori_avg": 14, "ori_var": 183}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "e5b16932-0a63-48be-801b-ee953f299ecb", "event1": "Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned.", "event1_context": ["Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n"], "event1_order": 15, "event2": "Trump was permanently banned from Twitter on January 8th.", "event2_context": ["Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_order": 17, "ori_avg": 79, "ori_var": 121.33333333333333}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "67f4e463-40ab-4438-b618-7b980ee9f534", "event1": "Five people died during the riots.", "event1_context": ["Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n"], "event1_order": 9, "event2": "The D.C. National Guard was activated, and a citywide curfew was imposed.", "event2_context": ["President Trump told supporters to never accept defeat. Hundreds of his supporters then stormed the U.S. Capitol to overturn the election. A woman was shot and killed by Capitol Police. The mob bashed through Capitol doors and windows, halting the congressional certification of Joe Biden’s victory. Lawmakers were evacuated. Tear gas was fired. The Senate stopped its proceedings, and the House doors were closed. The D.C. National Guard was activated, and a citywide curfew was imposed. Four people died: one from gunfire and three from medical emergencies. Rioters broke windows and vandalized offices. Law enforcement in riot gear arrived at the Capitol. Biden condemned the assault. Trump told people to \"go home\" in a video. Twitter, Facebook and Instagram temporarily banned Trump. Lawmakers were escorted back to work after the mob was cleared. Federal agents investigated a truck with weapons and potential bombmaking material. Police arrested at least 52 people and discovered pipe bombs and molotov cocktails. A man was stabbed near Freedom Plaza.\n"], "event2_order": 11, "ori_avg": 84, "ori_var": 94.33333333333333}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "6d5fe954-ec96-4104-87d1-c3e5cde907b2", "event1": "The House and Senate recessed, and the Capitol was locked down.", "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n", "President Trump told supporters to never accept defeat. Hundreds of his supporters then stormed the U.S. Capitol to overturn the election. A woman was shot and killed by Capitol Police. The mob bashed through Capitol doors and windows, halting the congressional certification of Joe Biden’s victory. Lawmakers were evacuated. Tear gas was fired. The Senate stopped its proceedings, and the House doors were closed. The D.C. National Guard was activated, and a citywide curfew was imposed. Four people died: one from gunfire and three from medical emergencies. Rioters broke windows and vandalized offices. Law enforcement in riot gear arrived at the Capitol. Biden condemned the assault. Trump told people to \"go home\" in a video. Twitter, Facebook and Instagram temporarily banned Trump. Lawmakers were escorted back to work after the mob was cleared. Federal agents investigated a truck with weapons and potential bombmaking material. Police arrested at least 52 people and discovered pipe bombs and molotov cocktails. A man was stabbed near Freedom Plaza.\n", "Trump's supporters stormed the U.S. Capitol, shattering windows and ransacking offices, while lawmakers huddled inside. The breach forced members to flee the House and Senate, delaying the electoral college vote count. Nancy Pelosi and Charles Schumer called for Trump's removal from office. Pro-Trump demonstrators rallied outside Los Angeles City Hall.\n", "Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n"], "event1_order": 7, "event2": "Twitter removed Trump's tweets and locked his account.", "event2_context": ["On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n"], "event2_order": 16, "ori_avg": 87, "ori_var": 129.33333333333334}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "4b731e48-495a-4dc3-bbd4-cc7b259b3386", "event1": "The House and Senate recessed, and the Capitol was locked down.", "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n", "President Trump told supporters to never accept defeat. Hundreds of his supporters then stormed the U.S. Capitol to overturn the election. A woman was shot and killed by Capitol Police. The mob bashed through Capitol doors and windows, halting the congressional certification of Joe Biden’s victory. Lawmakers were evacuated. Tear gas was fired. The Senate stopped its proceedings, and the House doors were closed. The D.C. National Guard was activated, and a citywide curfew was imposed. Four people died: one from gunfire and three from medical emergencies. Rioters broke windows and vandalized offices. Law enforcement in riot gear arrived at the Capitol. Biden condemned the assault. Trump told people to \"go home\" in a video. Twitter, Facebook and Instagram temporarily banned Trump. Lawmakers were escorted back to work after the mob was cleared. Federal agents investigated a truck with weapons and potential bombmaking material. Police arrested at least 52 people and discovered pipe bombs and molotov cocktails. A man was stabbed near Freedom Plaza.\n", "Trump's supporters stormed the U.S. Capitol, shattering windows and ransacking offices, while lawmakers huddled inside. The breach forced members to flee the House and Senate, delaying the electoral college vote count. Nancy Pelosi and Charles Schumer called for Trump's removal from office. Pro-Trump demonstrators rallied outside Los Angeles City Hall.\n", "Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n"], "event1_order": 7, "event2": "The Capitol was secured, and lawmakers reconvened to continue certification.", "event2_context": ["On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n", "Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_order": 13, "ori_avg": 95, "ori_var": 6.333333333333333}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "388f4ee3-5972-4a38-a0a9-63839e22da18", "event1": "Trump supporters protested in Washington, D.C.", "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n"], "event1_order": 1, "event2": "Trump was permanently banned from Twitter on January 8th.", "event2_context": ["Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_order": 17, "ori_avg": 82, "ori_var": 100.33333333333333}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "2314039f-5e45-4792-8e10-690990768915", "event1": "Trump addressed the crowd.", "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n"], "event1_order": 2, "event2": "Congress confirmed Biden as president in the early hours of January 7th.", "event2_context": ["On January 6th, Washington experienced a riot/insurrection during the joint session of Congress certifying the presidential victory. Attempts to overturn the November election failed. Congress confirmed Biden as president in the early hours of January 7th.\n", "Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_order": 14, "ori_avg": 24, "ori_var": 142.33333333333334}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "bdafa96e-896f-41b0-80cc-94e9379ad236", "event1": "Congress confirmed Biden as president in the early hours of January 7th.", "event1_context": ["On January 6th, Washington experienced a riot/insurrection during the joint session of Congress certifying the presidential victory. Attempts to overturn the November election failed. Congress confirmed Biden as president in the early hours of January 7th.\n", "Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event1_order": 14, "event2": "Trump was permanently banned from Twitter on January 8th.", "event2_context": ["Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_order": 17, "ori_avg": 14, "ori_var": 364.3333333333333}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "3787753d-2463-467c-b727-e8d57c5aec26", "event1": "Pipe bombs were reported at the Republican National Committee building and the Democratic National Committee headquarters.", "event1_context": ["On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n"], "event1_order": 4, "event2": "Protesters clashed with police and breached security barriers at the Capitol.", "event2_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n", "On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n"], "event2_order": 5, "ori_avg": 23, "ori_var": 122.33333333333333}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "68db76f2-f4d5-4f1b-9229-a7286671c830", "event1": "The House and Senate recessed, and the Capitol was locked down.", "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n", "President Trump told supporters to never accept defeat. Hundreds of his supporters then stormed the U.S. Capitol to overturn the election. A woman was shot and killed by Capitol Police. The mob bashed through Capitol doors and windows, halting the congressional certification of Joe Biden’s victory. Lawmakers were evacuated. Tear gas was fired. The Senate stopped its proceedings, and the House doors were closed. The D.C. National Guard was activated, and a citywide curfew was imposed. Four people died: one from gunfire and three from medical emergencies. Rioters broke windows and vandalized offices. Law enforcement in riot gear arrived at the Capitol. Biden condemned the assault. Trump told people to \"go home\" in a video. Twitter, Facebook and Instagram temporarily banned Trump. Lawmakers were escorted back to work after the mob was cleared. Federal agents investigated a truck with weapons and potential bombmaking material. Police arrested at least 52 people and discovered pipe bombs and molotov cocktails. A man was stabbed near Freedom Plaza.\n", "Trump's supporters stormed the U.S. Capitol, shattering windows and ransacking offices, while lawmakers huddled inside. The breach forced members to flee the House and Senate, delaying the electoral college vote count. Nancy Pelosi and Charles Schumer called for Trump's removal from office. Pro-Trump demonstrators rallied outside Los Angeles City Hall.\n", "Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n"], "event1_order": 7, "event2": "Five people died during the riots.", "event2_context": ["Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n"], "event2_order": 9, "ori_avg": 90, "ori_var": 3}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "f824f34f-a513-43c3-82df-825a0a74b82c", "event1": "Trump urged supporters to march to the Capitol.", "event1_context": ["On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n", "Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n"], "event1_order": 3, "event2": "The House and Senate recessed, and the Capitol was locked down.", "event2_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n", "President Trump told supporters to never accept defeat. Hundreds of his supporters then stormed the U.S. Capitol to overturn the election. A woman was shot and killed by Capitol Police. The mob bashed through Capitol doors and windows, halting the congressional certification of Joe Biden’s victory. Lawmakers were evacuated. Tear gas was fired. The Senate stopped its proceedings, and the House doors were closed. The D.C. National Guard was activated, and a citywide curfew was imposed. Four people died: one from gunfire and three from medical emergencies. Rioters broke windows and vandalized offices. Law enforcement in riot gear arrived at the Capitol. Biden condemned the assault. Trump told people to \"go home\" in a video. Twitter, Facebook and Instagram temporarily banned Trump. Lawmakers were escorted back to work after the mob was cleared. Federal agents investigated a truck with weapons and potential bombmaking material. Police arrested at least 52 people and discovered pipe bombs and molotov cocktails. A man was stabbed near Freedom Plaza.\n", "Trump's supporters stormed the U.S. Capitol, shattering windows and ransacking offices, while lawmakers huddled inside. The breach forced members to flee the House and Senate, delaying the electoral college vote count. Nancy Pelosi and Charles Schumer called for Trump's removal from office. Pro-Trump demonstrators rallied outside Los Angeles City Hall.\n", "Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n"], "event2_order": 7, "ori_avg": 91, "ori_var": 6.333333333333333}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "5bedb433-eadf-49b6-abc1-5a76ab9052c6", "event1": "Benjamin Netanyahu visited Tokyo in 2014.", "event1_context": ["Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event1_order": 5, "event2": "Shinzo Abe was pronounced dead at 5:03 p.m.", "event2_context": ["Former Japanese Prime Minister Shinzo Abe was shot while delivering a campaign speech in Nara. The attack occurred at approximately 11:30 a.m. before upper house elections. Abe collapsed, bleeding from the neck and chest. He was taken to a hospital in cardiac arrest and pronounced dead at 5:03 p.m. due to excessive bleeding; a bullet reached his heart. Tetsuya Yamagami, 41, was arrested for attempted murder; police recovered a gun, possibly homemade. Witnesses reported hearing two gunshots. World leaders, including Donald Trump, Emmanuel Macron, and Narendra Modi, condemned the attack.\n"], "event2_order": 18, "ori_avg": 1, "ori_var": 2.3333333333333335}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "9bd909c8-285d-4595-b03b-8db2fd75d6a8", "event1": "Trump urged supporters to march to the Capitol.", "event1_context": ["On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n", "Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n"], "event1_order": 3, "event2": "Pipe bombs were reported at the Republican National Committee building and the Democratic National Committee headquarters.", "event2_context": ["On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n"], "event2_order": 4, "ori_avg": 20, "ori_var": 244}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "7fca504d-4d28-436f-9fca-fdb3c59afccf", "event1": "The Conservative Party won the election.", "event1_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event1_order": 2, "event2": "Northern Ireland and Scotland voted to remain in the EU.", "event2_context": ["U.K. voters decided to leave the European Union, leading Prime Minister Cameron to announce his resignation. The EU referendum vote was 52 percent in favor of leaving. Northern Ireland and Scotland voted to remain, raising the possibility of the United Kingdom breaking apart. Cameron said the country requires fresh leadership and will resign before October. The process of leaving the EU will likely take years. The British pound plunged in value, and global stock markets plummeted. The referendum's outcome came as a shock to many. Sinn Fein called for a referendum on unification with Ireland. Scotland may hold a second referendum on independence. The EU assembly will hold an emergency session. Eurosceptic parties in Sweden, Denmark, and France called for EU membership referenda in their own nations. The Dow dropped approximately 500 points. Trump stated that the \"place is going wild over the vote. They took their country back, just like we will take America back.\" Obama stated \"the people of the United Kingdom have spoken, and we respect their decision.\"\n"], "event2_order": 8, "ori_avg": 23, "ori_var": 72.33333333333333}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "c9451a76-a349-47cb-9df9-5ac76f64f961", "event1": "Five people died during the riots.", "event1_context": ["Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n"], "event1_order": 9, "event2": "Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned.", "event2_context": ["Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n"], "event2_order": 15, "ori_avg": 68, "ori_var": 283}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "9adf60f7-0337-4bf0-a52c-c60093736979", "event1": "Shinzo Abe reinterpreted Japan's constitution in 2014.", "event1_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event1_order": 4, "event2": "The shooter used a handmade gun.", "event2_context": ["Shinzo Abe, former Prime Minister of Japan, was assassinated during a campaign rally in Nara, Japan. The shooting involved a gun, rare in Japan due to stringent firearm laws. Gun violence is almost unheard-of in Japan, with only one firearm-related death in 2021. The shooter used a handmade gun, which was seized along with several others at his home. Japan's firearms laws are strict, requiring a 12-step process to purchase a gun. Political assassinations were common before WWII, but rare since; the last killing of a national political figure was in 1960. Light police protection at political events allowed the shooter unobstructed access. The incident has shocked Japan and raised questions about the country's safety and political future.\n", "Former Japanese Prime Minister Shinzo Abe was shot while delivering a campaign speech in Nara. The attack occurred at approximately 11:30 a.m. before upper house elections. Abe collapsed, bleeding from the neck and chest. He was taken to a hospital in cardiac arrest and pronounced dead at 5:03 p.m. due to excessive bleeding; a bullet reached his heart. Tetsuya Yamagami, 41, was arrested for attempted murder; police recovered a gun, possibly homemade. Witnesses reported hearing two gunshots. World leaders, including Donald Trump, Emmanuel Macron, and Narendra Modi, condemned the attack.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n"], "event2_order": 13, "ori_avg": 9, "ori_var": 49}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "cedba7b2-24c0-4e6f-aa72-c20342d0ce2f", "event1": "Trump supporters protested in Washington, D.C.", "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n"], "event1_order": 1, "event2": "The Capitol was secured, and lawmakers reconvened to continue certification.", "event2_context": ["On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n", "Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_order": 13, "ori_avg": 76, "ori_var": 297.3333333333333}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "efeac0dd-278f-4a77-80e1-5a4357043685", "event1": "Shinzo Abe reinterpreted Japan's constitution in 2014.", "event1_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event1_order": 4, "event2": "Shinzo Abe coined the phrase 'a free and open Indo-Pacific'.", "event2_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event2_order": 6, "ori_avg": 72, "ori_var": 133}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "3da21dbc-1e56-4481-bd70-3fbcf4d5f53e", "event1": "A man fired twice at Shinzo Abe.", "event1_context": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally. Security arrested the suspected gunman, Tetsuya Yamagami. Yamagami fired two shots at Abe; the second shot hit Abe's chest and neck. Abe died several hours later. Yamagami attacked Abe due to Abe's association with a group Yamagami hated. Tributes were given by President Biden, Secretary of State Antony Blinken, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin, and former Australian Prime Minister Tony Abbott. Abe worked to build up Japan's military and reform the economy. Abe failed to revise Japan's constitution but passed legislation allowing Japan's military to expand operations overseas. Abe was a critic of China and called on the US to give Taiwan assurances of help in the event of an attack by China.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n", "Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event1_order": 12, "event2": "World leaders expressed shock and condemned the murder.", "event2_context": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally. Security arrested the suspected gunman, Tetsuya Yamagami. Yamagami fired two shots at Abe; the second shot hit Abe's chest and neck. Abe died several hours later. Yamagami attacked Abe due to Abe's association with a group Yamagami hated. Tributes were given by President Biden, Secretary of State Antony Blinken, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin, and former Australian Prime Minister Tony Abbott. Abe worked to build up Japan's military and reform the economy. Abe failed to revise Japan's constitution but passed legislation allowing Japan's military to expand operations overseas. Abe was a critic of China and called on the US to give Taiwan assurances of help in the event of an attack by China.\n", "Former Japanese Prime Minister Shinzo Abe was shot while delivering a campaign speech in Nara. The attack occurred at approximately 11:30 a.m. before upper house elections. Abe collapsed, bleeding from the neck and chest. He was taken to a hospital in cardiac arrest and pronounced dead at 5:03 p.m. due to excessive bleeding; a bullet reached his heart. Tetsuya Yamagami, 41, was arrested for attempted murder; police recovered a gun, possibly homemade. Witnesses reported hearing two gunshots. World leaders, including Donald Trump, Emmanuel Macron, and Narendra Modi, condemned the attack.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n"], "event2_order": 19, "ori_avg": 96, "ori_var": 2.3333333333333335}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "acbfaccb-3659-4ffd-8c95-b41eea622f1a", "event1": "The British pound plunged in value.", "event1_context": ["U.K. voters decided to leave the European Union, leading Prime Minister Cameron to announce his resignation. The EU referendum vote was 52 percent in favor of leaving. Northern Ireland and Scotland voted to remain, raising the possibility of the United Kingdom breaking apart. Cameron said the country requires fresh leadership and will resign before October. The process of leaving the EU will likely take years. The British pound plunged in value, and global stock markets plummeted. The referendum's outcome came as a shock to many. Sinn Fein called for a referendum on unification with Ireland. Scotland may hold a second referendum on independence. The EU assembly will hold an emergency session. Eurosceptic parties in Sweden, Denmark, and France called for EU membership referenda in their own nations. The Dow dropped approximately 500 points. Trump stated that the \"place is going wild over the vote. They took their country back, just like we will take America back.\" Obama stated \"the people of the United Kingdom have spoken, and we respect their decision.\"\n", "The UK voted to leave the European Union, triggering British Prime Minister David Cameron's resignation. The Brexit vote caused market plunges globally. Cameron announced his intention to stand down, wanting a pro-exit leader by October. Boris Johnson is tipped as Cameron’s likely successor. Nicola Sturgeon said the Scottish government will prepare legislation for a new independence referendum. Sinn Fein called for a referendum on Irish unity. European leaders expressed regret, with some fearing a domino effect and others congratulating the UK. UKIP leader Nigel Farage called the EU a \"dying\" institution. President Obama said the US-UK relationship would endure. NATO reassured that the UK would remain a strong ally. The Dow Jones Industrial Average fell 611 points and the British pound plunged to its lowest level since 1985.\n", "British voters elected to leave the European Union. UK Independence Party leader Nigel Farage admitted a key Leave campaign promise about redirecting EU funds to the national health system was inaccurate. Residents of Cornwall worried about losing promised EU subsidies. The British pound plummeted, global stocks tanked, and some voters regretted their decision, with some claiming they thought they were lodging a protest vote and didn't think Brexit would actually happen. Over three million Brits called for a do-over. Critics say Prime Minister David Cameron initiated the referendum due to a political bind. Political scientist David A. Bell argues referendums on technical issues undermine democratic institutions. He also notes referendums can lead to policies that are hard to dislodge and undermine the legitimacy of legislatures. Brexit supporters cast the vote as one of fundamental sovereignty. Martin Kettle argued Brexit should be a referendum on referendums.\n"], "event1_order": 10, "event2": "Over three million Brits called for a do-over.", "event2_context": ["British voters elected to leave the European Union. UK Independence Party leader Nigel Farage admitted a key Leave campaign promise about redirecting EU funds to the national health system was inaccurate. Residents of Cornwall worried about losing promised EU subsidies. The British pound plummeted, global stocks tanked, and some voters regretted their decision, with some claiming they thought they were lodging a protest vote and didn't think Brexit would actually happen. Over three million Brits called for a do-over. Critics say Prime Minister David Cameron initiated the referendum due to a political bind. Political scientist David A. Bell argues referendums on technical issues undermine democratic institutions. He also notes referendums can lead to policies that are hard to dislodge and undermine the legitimacy of legislatures. Brexit supporters cast the vote as one of fundamental sovereignty. Martin Kettle argued Brexit should be a referendum on referendums.\n"], "event2_order": 14, "ori_avg": 51, "ori_var": 345.3333333333333}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "761143f6-e156-445e-8795-815a3c0dda68", "event1": "Shinzo Abe became the youngest prime minister in postwar Japan in 2006.", "event1_context": ["In the early 2000s, Shinzo Abe was the deputy chief cabinet secretary. In 2002, Abe handled arrangements for a summit between Junichiro Koizumi and Kim Jong Il in Pyongyang. In 2006, Abe became the youngest prime minister in postwar Japan. In 2012, Abe returned to office and later became the longest-serving prime minister. During his tenure, Abe implemented \"Abenomics,\" and the stock market increased but economic inequality widened. Yoshihide Suga succeeded Abe in September 2020. Abe met with Donald Trump and Vladimir Putin, and in 2014, he met with Xi Jinping. After his death, Abe was celebrated for strengthening the defense alliance with the United States. Abe wanted to revise the Japanese Constitution but died still pushing for it.\n"], "event1_order": 2, "event2": "Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally.", "event2_context": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally. Security arrested the suspected gunman, Tetsuya Yamagami. Yamagami fired two shots at Abe; the second shot hit Abe's chest and neck. Abe died several hours later. Yamagami attacked Abe due to Abe's association with a group Yamagami hated. Tributes were given by President Biden, Secretary of State Antony Blinken, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin, and former Australian Prime Minister Tony Abbott. Abe worked to build up Japan's military and reform the economy. Abe failed to revise Japan's constitution but passed legislation allowing Japan's military to expand operations overseas. Abe was a critic of China and called on the US to give Taiwan assurances of help in the event of an attack by China.\n", "Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event2_order": 11, "ori_avg": 11, "ori_var": 93}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "dfbdec30-6e01-4de9-baab-4de56aec5797", "event1": "Prime Minister David Cameron pledged a referendum on EU membership in 2013.", "event1_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event1_order": 1, "event2": "The nation divided into 'remain' and 'leave' camps.", "event2_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event2_order": 5, "ori_avg": 87, "ori_var": 9}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "eedafe52-e0b5-42db-93d4-38c2b0dc0abe", "event1": "Cameron's attempt to renegotiate the U.K.'s EU membership terms failed.", "event1_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event1_order": 4, "event2": "The nation divided into 'remain' and 'leave' camps.", "event2_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event2_order": 5, "ori_avg": 77, "ori_var": 44.333333333333336}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "0b8aceed-bed4-44fa-9218-6aeeae1b679d", "event1": "The Conservative Party won the election.", "event1_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event1_order": 2, "event2": "Sinn Fein called for a referendum on Irish unity.", "event2_context": ["The UK voted to leave the European Union, triggering British Prime Minister David Cameron's resignation. The Brexit vote caused market plunges globally. Cameron announced his intention to stand down, wanting a pro-exit leader by October. Boris Johnson is tipped as Cameron’s likely successor. Nicola Sturgeon said the Scottish government will prepare legislation for a new independence referendum. Sinn Fein called for a referendum on Irish unity. European leaders expressed regret, with some fearing a domino effect and others congratulating the UK. UKIP leader Nigel Farage called the EU a \"dying\" institution. President Obama said the US-UK relationship would endure. NATO reassured that the UK would remain a strong ally. The Dow Jones Industrial Average fell 611 points and the British pound plunged to its lowest level since 1985.\n"], "event2_order": 13, "ori_avg": 63, "ori_var": 301}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "be87c916-5bc9-4cc2-b51c-b3553998afa0", "event1": "The nation divided into 'remain' and 'leave' camps.", "event1_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event1_order": 5, "event2": "The UK influenced EU initiatives, including the Europol Counter Terrorism Centre (CTC) and the PNRD.", "event2_context": ["Intelligence exchanges primarily occur between individual nation states in Europe, outside of EU jurisdiction. The UK possesses unique intelligence capabilities due to its partnerships with the U.S. and the \"Five Eyes\" alliance. The UK drafted the EU Counter Terrorism Strategy in 2005 and influenced EU initiatives like the Europol Counter Terrorism Centre (CTC) and the PNRD. The UK's intelligence-led counter terrorism policing concept integrates intelligence agencies with the police. The EAW has increased extradition speed between EU states, and Europol/Eurojust facilitate police/judicial cooperation. The UK joined the Schengen Information System for information sharing. Post-Brexit, EU states are expected to continue counter-terrorism cooperation with the UK, and the UK will likely seek access to EU law enforcement databases. The UK will presumably remain in the non-EU Counter Terrorist Group (CTG). The UK will need to negotiate new arrangements, potentially through bilateral agreements. Officials acknowledge potential limits compared to the pre-Brexit situation due to precedents. The negotiation process may hinder counter-terrorism efforts. The UK government will aim to retain close counter-terrorism cooperation. Brexit could exacerbate tensions in Northern Ireland and may encourage violent republican dissidents if they can build grassroots support.\n"], "event2_order": 16, "ori_avg": 11, "ori_var": 93}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "8ed410ca-0cef-4aa6-9309-9737c5c57bfe", "event1": "Twitter removed Trump's tweets and locked his account.", "event1_context": ["On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n"], "event1_order": 16, "event2": "Trump was impeached for a second time on January 13th.", "event2_context": ["Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_order": 18, "ori_avg": 47, "ori_var": 450.3333333333333}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "08d4c8c7-913c-4e07-b297-183346b57b0c", "event1": "Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally.", "event1_context": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally. Security arrested the suspected gunman, Tetsuya Yamagami. Yamagami fired two shots at Abe; the second shot hit Abe's chest and neck. Abe died several hours later. Yamagami attacked Abe due to Abe's association with a group Yamagami hated. Tributes were given by President Biden, Secretary of State Antony Blinken, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin, and former Australian Prime Minister Tony Abbott. Abe worked to build up Japan's military and reform the economy. Abe failed to revise Japan's constitution but passed legislation allowing Japan's military to expand operations overseas. Abe was a critic of China and called on the US to give Taiwan assurances of help in the event of an attack by China.\n", "Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event1_order": 11, "event2": "The shooter used a handmade gun.", "event2_context": ["Shinzo Abe, former Prime Minister of Japan, was assassinated during a campaign rally in Nara, Japan. The shooting involved a gun, rare in Japan due to stringent firearm laws. Gun violence is almost unheard-of in Japan, with only one firearm-related death in 2021. The shooter used a handmade gun, which was seized along with several others at his home. Japan's firearms laws are strict, requiring a 12-step process to purchase a gun. Political assassinations were common before WWII, but rare since; the last killing of a national political figure was in 1960. Light police protection at political events allowed the shooter unobstructed access. The incident has shocked Japan and raised questions about the country's safety and political future.\n", "Former Japanese Prime Minister Shinzo Abe was shot while delivering a campaign speech in Nara. The attack occurred at approximately 11:30 a.m. before upper house elections. Abe collapsed, bleeding from the neck and chest. He was taken to a hospital in cardiac arrest and pronounced dead at 5:03 p.m. due to excessive bleeding; a bullet reached his heart. Tetsuya Yamagami, 41, was arrested for attempted murder; police recovered a gun, possibly homemade. Witnesses reported hearing two gunshots. World leaders, including Donald Trump, Emmanuel Macron, and Narendra Modi, condemned the attack.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n"], "event2_order": 13, "ori_avg": 76, "ori_var": 469}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "81245cd7-ed6a-45b6-af56-3ccd9962ed04", "event1": "The shooter used a handmade gun.", "event1_context": ["Shinzo Abe, former Prime Minister of Japan, was assassinated during a campaign rally in Nara, Japan. The shooting involved a gun, rare in Japan due to stringent firearm laws. Gun violence is almost unheard-of in Japan, with only one firearm-related death in 2021. The shooter used a handmade gun, which was seized along with several others at his home. Japan's firearms laws are strict, requiring a 12-step process to purchase a gun. Political assassinations were common before WWII, but rare since; the last killing of a national political figure was in 1960. Light police protection at political events allowed the shooter unobstructed access. The incident has shocked Japan and raised questions about the country's safety and political future.\n", "Former Japanese Prime Minister Shinzo Abe was shot while delivering a campaign speech in Nara. The attack occurred at approximately 11:30 a.m. before upper house elections. Abe collapsed, bleeding from the neck and chest. He was taken to a hospital in cardiac arrest and pronounced dead at 5:03 p.m. due to excessive bleeding; a bullet reached his heart. Tetsuya Yamagami, 41, was arrested for attempted murder; police recovered a gun, possibly homemade. Witnesses reported hearing two gunshots. World leaders, including Donald Trump, Emmanuel Macron, and Narendra Modi, condemned the attack.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n"], "event1_order": 13, "event2": "Explosives were found at Tetsuya Yamagami's home.", "event2_context": ["On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n"], "event2_order": 15, "ori_avg": 32, "ori_var": 481.3333333333333}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "c8d1b132-0a07-49e4-812d-3bfdbddab049", "event1": "The UK voted to leave the EU in a June 23 referendum.", "event1_context": ["The UK voted to leave the EU in a June 23 referendum by a margin of 52% to 48%. UK public opinion of the EU has been less favorable than that of other EU members for nearly a decade. A Pew Research Center survey indicated that some other EU countries share the UK's desire for a less centralized Europe. The UK public perceived the EU as inefficient, intrusive, and mishandling key issues like refugees and the economy. 65% of the British public desired the return of some EU powers to London prior to the referendum. The Brexit vote exposed a division between Scotland, which voted to remain in the EU by 62% to 38%, and the rest of the UK. Scotland and the rest of the UK also diverge on economic and immigration threat perceptions. Other EU member states largely viewed Brexit as detrimental to the EU. A majority in Greece and pluralities in other EU nations favor returning some EU power to their national governments.\n", "The UK voted to leave the European Union, triggering British Prime Minister David Cameron's resignation. The Brexit vote caused market plunges globally. Cameron announced his intention to stand down, wanting a pro-exit leader by October. Boris Johnson is tipped as Cameron’s likely successor. Nicola Sturgeon said the Scottish government will prepare legislation for a new independence referendum. Sinn Fein called for a referendum on Irish unity. European leaders expressed regret, with some fearing a domino effect and others congratulating the UK. UKIP leader Nigel Farage called the EU a \"dying\" institution. President Obama said the US-UK relationship would endure. NATO reassured that the UK would remain a strong ally. The Dow Jones Industrial Average fell 611 points and the British pound plunged to its lowest level since 1985.\n"], "event1_order": 7, "event2": "Nicola Sturgeon stated the Scottish government would prepare legislation for a new independence referendum.", "event2_context": ["The UK voted to leave the European Union, triggering British Prime Minister David Cameron's resignation. The Brexit vote caused market plunges globally. Cameron announced his intention to stand down, wanting a pro-exit leader by October. Boris Johnson is tipped as Cameron’s likely successor. Nicola Sturgeon said the Scottish government will prepare legislation for a new independence referendum. Sinn Fein called for a referendum on Irish unity. European leaders expressed regret, with some fearing a domino effect and others congratulating the UK. UKIP leader Nigel Farage called the EU a \"dying\" institution. President Obama said the US-UK relationship would endure. NATO reassured that the UK would remain a strong ally. The Dow Jones Industrial Average fell 611 points and the British pound plunged to its lowest level since 1985.\n"], "event2_order": 12, "ori_avg": 92, "ori_var": 16.333333333333332}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "86365332-81be-4dcf-aae5-79823ef51ae3", "event1": "The United Kingdom held a referendum on June 23.", "event1_context": ["The United Kingdom held a referendum on June 23 to decide whether to leave (Brexit) or remain in the European Union (EU). Stanford scholar Christophe Crombez recommended the UK remain, arguing that leaving would negatively impact the UK, the EU, and global politics, and only create an illusion of sovereignty. Arguments for leaving include saving taxpayer money, avoiding unwanted EU laws, and controlling migration. Crombez refuted these, stating the UK benefits more from the EU market than its contributions, and that post-Brexit, the UK would still need to comply with EU rules to trade, and immigration requirements would still be imposed. Leaving the EU would negatively affect UK trade and GDP, create uncertainty, and consume resources in break-up negotiations. The EU would be less impacted economically, but the idea of European unification would be damaged. Brexit could trigger other countries to hold referendums and could lead to the break-up of the UK, with Scotland potentially leaving to stay in the EU.\n"], "event1_order": 6, "event2": "The UK joined the Schengen Information System.", "event2_context": ["Intelligence exchanges primarily occur between individual nation states in Europe, outside of EU jurisdiction. The UK possesses unique intelligence capabilities due to its partnerships with the U.S. and the \"Five Eyes\" alliance. The UK drafted the EU Counter Terrorism Strategy in 2005 and influenced EU initiatives like the Europol Counter Terrorism Centre (CTC) and the PNRD. The UK's intelligence-led counter terrorism policing concept integrates intelligence agencies with the police. The EAW has increased extradition speed between EU states, and Europol/Eurojust facilitate police/judicial cooperation. The UK joined the Schengen Information System for information sharing. Post-Brexit, EU states are expected to continue counter-terrorism cooperation with the UK, and the UK will likely seek access to EU law enforcement databases. The UK will presumably remain in the non-EU Counter Terrorist Group (CTG). The UK will need to negotiate new arrangements, potentially through bilateral agreements. Officials acknowledge potential limits compared to the pre-Brexit situation due to precedents. The negotiation process may hinder counter-terrorism efforts. The UK government will aim to retain close counter-terrorism cooperation. Brexit could exacerbate tensions in Northern Ireland and may encourage violent republican dissidents if they can build grassroots support.\n"], "event2_order": 17, "ori_avg": 11, "ori_var": 93}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "9e617c3c-598d-47e9-89b3-2c06364ad0cc", "event1": "Nicola Sturgeon stated the Scottish government would prepare legislation for a new independence referendum.", "event1_context": ["The UK voted to leave the European Union, triggering British Prime Minister David Cameron's resignation. The Brexit vote caused market plunges globally. Cameron announced his intention to stand down, wanting a pro-exit leader by October. Boris Johnson is tipped as Cameron’s likely successor. Nicola Sturgeon said the Scottish government will prepare legislation for a new independence referendum. Sinn Fein called for a referendum on Irish unity. European leaders expressed regret, with some fearing a domino effect and others congratulating the UK. UKIP leader Nigel Farage called the EU a \"dying\" institution. President Obama said the US-UK relationship would endure. NATO reassured that the UK would remain a strong ally. The Dow Jones Industrial Average fell 611 points and the British pound plunged to its lowest level since 1985.\n"], "event1_order": 12, "event2": "Over three million Brits called for a do-over.", "event2_context": ["British voters elected to leave the European Union. UK Independence Party leader Nigel Farage admitted a key Leave campaign promise about redirecting EU funds to the national health system was inaccurate. Residents of Cornwall worried about losing promised EU subsidies. The British pound plummeted, global stocks tanked, and some voters regretted their decision, with some claiming they thought they were lodging a protest vote and didn't think Brexit would actually happen. Over three million Brits called for a do-over. Critics say Prime Minister David Cameron initiated the referendum due to a political bind. Political scientist David A. Bell argues referendums on technical issues undermine democratic institutions. He also notes referendums can lead to policies that are hard to dislodge and undermine the legitimacy of legislatures. Brexit supporters cast the vote as one of fundamental sovereignty. Martin Kettle argued Brexit should be a referendum on referendums.\n"], "event2_order": 14, "ori_avg": 24, "ori_var": 63}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "e0ad201a-80ba-4281-a0fd-9bff64d792e7", "event1": "David Cameron announced his resignation as Prime Minister.", "event1_context": ["On June 24, 2016, British Prime Minister David Cameron stated that the British people voted to leave the European Union and their will must be respected. Cameron announced he would resign as Prime Minister because the country requires fresh leadership. He will remain as Prime Minister for the next three months. The Cabinet will meet on Monday, and the Governor of the Bank of England is making a statement. A negotiation with the European Union will need to begin under a new Prime Minister, who will decide when to trigger Article 50. Cameron will attend the European Council next week to explain the decision. Cameron stated that Britain can survive outside the European Union and he will do everything he can to help this country succeed. Cameron walked back to Number 10 with his wife Samantha.\n", "U.K. voters decided to leave the European Union, leading Prime Minister Cameron to announce his resignation. The EU referendum vote was 52 percent in favor of leaving. Northern Ireland and Scotland voted to remain, raising the possibility of the United Kingdom breaking apart. Cameron said the country requires fresh leadership and will resign before October. The process of leaving the EU will likely take years. The British pound plunged in value, and global stock markets plummeted. The referendum's outcome came as a shock to many. Sinn Fein called for a referendum on unification with Ireland. Scotland may hold a second referendum on independence. The EU assembly will hold an emergency session. Eurosceptic parties in Sweden, Denmark, and France called for EU membership referenda in their own nations. The Dow dropped approximately 500 points. Trump stated that the \"place is going wild over the vote. They took their country back, just like we will take America back.\" Obama stated \"the people of the United Kingdom have spoken, and we respect their decision.\"\n", "The UK voted to leave the European Union, triggering British Prime Minister David Cameron's resignation. The Brexit vote caused market plunges globally. Cameron announced his intention to stand down, wanting a pro-exit leader by October. Boris Johnson is tipped as Cameron’s likely successor. Nicola Sturgeon said the Scottish government will prepare legislation for a new independence referendum. Sinn Fein called for a referendum on Irish unity. European leaders expressed regret, with some fearing a domino effect and others congratulating the UK. UKIP leader Nigel Farage called the EU a \"dying\" institution. President Obama said the US-UK relationship would endure. NATO reassured that the UK would remain a strong ally. The Dow Jones Industrial Average fell 611 points and the British pound plunged to its lowest level since 1985.\n"], "event1_order": 9, "event2": "Sinn Fein called for a referendum on Irish unity.", "event2_context": ["The UK voted to leave the European Union, triggering British Prime Minister David Cameron's resignation. The Brexit vote caused market plunges globally. Cameron announced his intention to stand down, wanting a pro-exit leader by October. Boris Johnson is tipped as Cameron’s likely successor. Nicola Sturgeon said the Scottish government will prepare legislation for a new independence referendum. Sinn Fein called for a referendum on Irish unity. European leaders expressed regret, with some fearing a domino effect and others congratulating the UK. UKIP leader Nigel Farage called the EU a \"dying\" institution. President Obama said the US-UK relationship would endure. NATO reassured that the UK would remain a strong ally. The Dow Jones Industrial Average fell 611 points and the British pound plunged to its lowest level since 1985.\n"], "event2_order": 13, "ori_avg": 12, "ori_var": 49}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "763bdbef-18e1-4d2a-b55d-0da606b68d5b", "event1": "A woman was shot inside the Capitol and died.", "event1_context": ["President Trump told supporters to never accept defeat. Hundreds of his supporters then stormed the U.S. Capitol to overturn the election. A woman was shot and killed by Capitol Police. The mob bashed through Capitol doors and windows, halting the congressional certification of Joe Biden’s victory. Lawmakers were evacuated. Tear gas was fired. The Senate stopped its proceedings, and the House doors were closed. The D.C. National Guard was activated, and a citywide curfew was imposed. Four people died: one from gunfire and three from medical emergencies. Rioters broke windows and vandalized offices. Law enforcement in riot gear arrived at the Capitol. Biden condemned the assault. Trump told people to \"go home\" in a video. Twitter, Facebook and Instagram temporarily banned Trump. Lawmakers were escorted back to work after the mob was cleared. Federal agents investigated a truck with weapons and potential bombmaking material. Police arrested at least 52 people and discovered pipe bombs and molotov cocktails. A man was stabbed near Freedom Plaza.\n", "On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n"], "event1_order": 8, "event2": "Trump was permanently banned from Twitter on January 8th.", "event2_context": ["Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_order": 17, "ori_avg": 79, "ori_var": 129}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "7de9cd9a-8a86-443f-a749-018ea9532958", "event1": "Shinzo Abe became the youngest prime minister in postwar Japan in 2006.", "event1_context": ["In the early 2000s, Shinzo Abe was the deputy chief cabinet secretary. In 2002, Abe handled arrangements for a summit between Junichiro Koizumi and Kim Jong Il in Pyongyang. In 2006, Abe became the youngest prime minister in postwar Japan. In 2012, Abe returned to office and later became the longest-serving prime minister. During his tenure, Abe implemented \"Abenomics,\" and the stock market increased but economic inequality widened. Yoshihide Suga succeeded Abe in September 2020. Abe met with Donald Trump and Vladimir Putin, and in 2014, he met with Xi Jinping. After his death, Abe was celebrated for strengthening the defense alliance with the United States. Abe wanted to revise the Japanese Constitution but died still pushing for it.\n"], "event1_order": 2, "event2": "Shinzo Abe offered to host a peace summit in 2017.", "event2_context": ["Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event2_order": 8, "ori_avg": 20, "ori_var": 190.33333333333334}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "9efca5c0-2f82-465d-86e5-9ab9d50a9cd1", "event1": "Prime Minister David Cameron pledged a referendum on EU membership in 2013.", "event1_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event1_order": 1, "event2": "Sinn Fein called for a referendum on Irish unity.", "event2_context": ["The UK voted to leave the European Union, triggering British Prime Minister David Cameron's resignation. The Brexit vote caused market plunges globally. Cameron announced his intention to stand down, wanting a pro-exit leader by October. Boris Johnson is tipped as Cameron’s likely successor. Nicola Sturgeon said the Scottish government will prepare legislation for a new independence referendum. Sinn Fein called for a referendum on Irish unity. European leaders expressed regret, with some fearing a domino effect and others congratulating the UK. UKIP leader Nigel Farage called the EU a \"dying\" institution. President Obama said the US-UK relationship would endure. NATO reassured that the UK would remain a strong ally. The Dow Jones Industrial Average fell 611 points and the British pound plunged to its lowest level since 1985.\n"], "event2_order": 13, "ori_avg": 77, "ori_var": 310.3333333333333}
