{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "timeline": [{"event": "Prime Minister David Cameron pledged a referendum on EU membership in 2013 if his Conservative Party won the next election.", "event_order": 1, "position": [5]}, {"event": "Cameron's attempt to renegotiate the U.K.'s EU membership terms failed.", "event_order": 2, "position": [5]}, {"event": "The United Kingdom held a referendum on whether to leave or remain in the European Union on June 23.", "event_order": 3, "position": [5, 8]}, {"event": "British voters decided to leave the European Union (Brexit), with 52% voting to leave.", "event_order": 4, "position": [1, 2, 3, 4, 10]}, {"event": "Prime Minister David Cameron announced his resignation.", "event_order": 5, "position": [1, 2, 4]}, {"event": "Global markets plummeted, and the British pound plunged following the Brexit vote.", "event_order": 6, "position": [4, 10]}, {"event": "Scotland voted to remain in the EU (62% to 38%), diverging from the rest of the UK.", "event_order": 7, "position": [3]}, {"event": "Sinn Fein called for a referendum on unification with Ireland.", "event_order": 8, "position": [2]}, {"event": "Nigel Farage admitted a key Leave campaign promise about redirecting EU funds to the national health system was inaccurate.", "event_order": 9, "position": [10]}, {"event": "Brexit may encourage violent republican dissidents in Northern Ireland.", "event_order": 10, "position": [9]}]}
{"topic_id": 2, "topic": "COVID-19 pandemic triggers global health crisis", "timeline": [{"event": "WHO was notified of unusual pneumonia cases in Wuhan City, China on Dec. 31.", "event_order": 1, "position": [2]}, {"event": "Chinese authorities identified SARS-CoV-2 as the cause of the pneumonia cases approximately a week after the WHO notification.", "event_order": 2, "position": [2]}, {"event": "SARS-CoV-2 virus spread globally, causing infections and deaths.", "event_order": 3, "position": [2]}, {"event": "WHO declared COVID-19 a pandemic on March 11, 2020, impacting global health and humanitarian efforts.", "event_order": 4, "position": [7]}, {"event": "COVID-19 pandemic: Caused lockdowns, terrified citizens, and triggered a financial meltdown, demanding immediate response and long-term planning.", "event_order": 5, "position": [1]}, {"event": "Experts advocated for systemic economic transformation, linking planetary crises like deforestation and climate change to increased pandemic risk and calling for investment in green infrastructure.", "event_order": 6, "position": [1]}, {"event": "Trump administration failed to mobilize for COVID-19 despite warnings.", "event_order": 7, "position": [5]}, {"event": "Some US state governments (e.g., Washington, Ohio, California, New York) developed testing, collaborated with health officials, and implemented social distancing and hospital preparation.", "event_order": 8, "position": [5]}, {"event": "Businesses laid off workers, households struggled with food, and international investment fled emerging markets, leading to widespread economic hardship.", "event_order": 9, "position": [6]}, {"event": "Governments worldwide began using the coronavirus crisis as a pretext to restrict fundamental freedoms, such as banning gatherings and censoring online content.", "event_order": 10, "position": [8]}, {"event": "The pandemic increased suicide risk due to social distancing and economic fallout, challenging mental health care access.", "event_order": 11, "position": [10]}, {"event": "COVID-19 outbreak is overwhelming healthcare systems and disproportionately impacting vulnerable populations, including refugees, asylum seekers, and IDPs.", "event_order": 12, "position": [7]}, {"event": "Border closures and travel restrictions implemented by countries globally are disrupting humanitarian aid delivery and preventing the movement of asylum seekers and refugees.", "event_order": 13, "position": [7]}, {"event": "Lockdowns led to increased domestic violence, hunger, and suicide (victims, abusers, economically vulnerable populations).", "event_order": 14, "position": [9]}, {"event": "Healthcare system strain caused reduced services for other conditions and subsequent deaths (healthcare system, patients with non-COVID conditions).", "event_order": 15, "position": [9]}, {"event": "COVID-19 pandemic caused over 3.24 million deaths by May 6, 2021 (SARS-CoV-2 infections).", "event_order": 16, "position": [9]}]}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "timeline": [{"event": "A joint session of Congress convened to certify the Electoral College vote.", "event_order": 1, "position": [4]}, {"event": "Trump addressed supporters in Washington, D.C., urging them to protest the election results and march to the Capitol.", "event_order": 2, "position": [1, 7]}, {"event": "Trump supporters stormed the U.S. Capitol, clashing with police, breaching security barriers, and forcing entry.", "event_order": 3, "position": [1, 2, 3, 4, 5, 6, 7, 8, 9]}, {"event": "The House and Senate recessed, the Capitol was locked down, and lawmakers were evacuated due to the breach.", "event_order": 4, "position": [1, 6, 7, 8]}, {"event": "A woman was shot inside the Capitol by Capitol Police and later died.", "event_order": 5, "position": [2, 3]}, {"event": "Journalists were attacked by Trump supporters during the Capitol siege.", "event_order": 6, "position": [10]}, {"event": "D.C.'s Mayor issued a 6 p.m. citywide curfew.", "event_order": 7, "position": [8]}, {"event": "Multiple federal agencies deployed emergency response teams to the Capitol.", "event_order": 8, "position": [5]}, {"event": "Law enforcement cleared the mob from the Capitol.", "event_order": 9, "position": [2]}, {"event": "After the Capitol was secured, Congress reconvened to continue the certification of President-elect Joe Biden's win.", "event_order": 10, "position": [3, 10]}, {"event": "Congress confirmed Joe Biden as president in the early hours of January 7th.", "event_order": 11, "position": [4]}, {"event": "Nancy Pelosi and Charles Schumer called for Trump's removal from office.", "event_order": 12, "position": [6]}, {"event": "Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned.", "event_order": 13, "position": [5]}, {"event": "Trump was banned from Twitter on January 8th and impeached for a second time on January 13th.", "event_order": 14, "position": [10]}]}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "timeline": [{"event": "Abe became prime minister of Japan in 2006.", "event_order": 1, "position": [6]}, {"event": "Abe returned to office as prime minister in 2012.", "event_order": 2, "position": [6]}, {"event": "Abe reinterpreted Japan's constitution in 2014, enabling military operations overseas.", "event_order": 3, "position": [4]}, {"event": "Increased diplomacy between Japan and Israel, starting with Benjamin Netanyahu's visit to Tokyo in 2014.", "event_order": 4, "position": [10]}, {"event": "Abe outlined his vision for a 'free and open Indo-Pacific' in 2016.", "event_order": 5, "position": [4]}, {"event": "Abe promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia.", "event_order": 6, "position": [4]}, {"event": "Yoshihide Suga succeeded Abe as prime minister in September 2020.", "event_order": 7, "position": [6]}, {"event": "Shinzo Abe was murdered while campaigning in Nara on July 8, 2022.", "event_order": 8, "position": [1, 3, 7, 9, 10]}, {"event": "Tetsuya Yamagami fired two shots at Shinzo Abe, hitting his chest and neck.", "event_order": 9, "position": [1, 7, 8, 9, 10]}, {"event": "Shinzo Abe collapsed; Shinzo Abe; Bleeding from neck and chest after being shot.", "event_order": 10, "position": [8]}, {"event": "Security officers detained Tetsuya Yamagami and seized his handmade gun.", "event_order": 11, "position": [3, 9]}, {"event": "Shinzo Abe was pronounced dead; Shinzo Abe; Hospital, 5:03 p.m., due to excessive bleeding.", "event_order": 12, "position": [1, 8]}, {"event": "Seizure: Police seized the handmade gun used in the shooting, along with several others, from the shooter's home.", "event_order": 13, "position": [7]}]}
{"topic_id": 5, "topic": "Elon Musk acquires Twitter, implements major reforms", "timeline": [{"event": "Elon Musk to acquire Twitter for $44 billion", "event_order": 1, "position": [8]}, {"event": "Trading in Twitter shares was suspended on the New York Stock Exchange.", "event_order": 2, "position": [3]}, {"event": "Elon Musk acquired Twitter for $44 billion.", "event_order": 3, "position": [2, 3, 5, 9]}, {"event": "Elon Musk fired Twitter CEO Parag Agrawal, CFO Ned Segal, and general counsel Vijaya Gadde.", "event_order": 4, "position": [3, 5, 9]}, {"event": "Elon Musk implemented staff reductions at Twitter, including firing top executives and laying off a large portion of employees (post-October).", "event_order": 5, "position": [4]}, {"event": "Elon Musk planned sweeping policy changes, including loosening speech rules and user authentication requirements.", "event_order": 6, "position": [5]}, {"event": "Elon Musk reinstated previously suspended accounts, including Donald Trump's, under a 'general amnesty'.", "event_order": 7, "position": [4, 9]}, {"event": "Advertisers expressed concerns about brand safety and content moderation on Twitter under Elon Musk's ownership.", "event_order": 8, "position": [2]}, {"event": "General Motors suspended advertising on Twitter due to uncertainty about the platform's direction.", "event_order": 9, "position": [2]}, {"event": "Elon Musk confirmed stepping down as CEO of Twitter once a replacement is found, transitioning to managing software and servers (December 20).", "event_order": 10, "position": [4]}]}
{"topic_id": 6, "topic": "Trump re-elected as US President", "timeline": [{"event": "Donald Trump was found guilty on 34 felony charges in New York.", "event_order": 1, "position": [2]}, {"event": "Two assassination attempts occurred targeting Donald Trump during the election season.", "event_order": 2, "position": [2]}, {"event": "Republicans used anti-trans hate to move people to the polls", "event_order": 3, "position": [5]}, {"event": "Donald Trump elected president after winning Wisconsin and securing over 270 electoral votes.", "event_order": 4, "position": [2, 5]}, {"event": "Johns Hopkins held a virtual event 'Insights and Impacts: Post-Election Debrief' on Nov. 7 to discuss the election's effects.", "event_order": 5, "position": [3]}, {"event": "Trump sweeps swing states: Trump wins in seven swing states, including Arizona (November 9, 2024)", "event_order": 6, "position": [4, 10]}, {"event": "Donald Trump won the popular vote by approximately four million votes.", "event_order": 7, "position": [10]}, {"event": "Panelists discussed factors influencing the election, including polarization, economic disconnect, Trump's voter appeal, and information inconsistencies.", "event_order": 8, "position": [3]}, {"event": "Panelists analyzed potential limits on Trump's agenda and power, even with Republican control of Congress.", "event_order": 9, "position": [3]}, {"event": "Concerns raised about the executive branch influencing future elections", "event_order": 10, "position": [5]}]}
{"topic_id": 7, "topic": "South Korean President Yoon Suk-yeol faces impeachment crisis", "timeline": [{"event": "Yoon declared martial law on December 3, triggering protests.", "event_order": 1, "position": [3, 4, 8, 9]}, {"event": "Martial-law command suspended the legislature and controlled the media.", "event_order": 2, "position": [3]}, {"event": "Special Warfare Command Commander Kwak Jong-geun received a direct order from President Yoon to break the doors of the National Assembly and drag out the lawmakers, but he did not comply.", "event_order": 3, "position": [5]}, {"event": "Lawmakers overturned President Yoon's martial law declaration after tussling with troops to enter the National Assembly.", "event_order": 4, "position": [3, 4]}, {"event": "Protest: Tens of thousands of South Korean protesters demonstrated near the National Assembly in Seoul, demanding President Yoon Suk Yeol's removal.", "event_order": 5, "position": [2, 8]}, {"event": "Performance: Baek Jae Gil performed his adapted anthem 'Impeachment is the answer' outside the National Assembly after Yoon's declaration of martial law.", "event_order": 6, "position": [2]}, {"event": "South Korean legislators launched an impeachment push against President Yoon Suk Yeol, accusing him of violating the constitution and law.", "event_order": 7, "position": [4]}, {"event": "Impeachment Vote: Lawmakers voted on a motion to impeach President Yoon Suk Yeol; the motion failed.", "event_order": 8, "position": [8]}, {"event": "A second impeachment motion was filed against President Yoon in the National Assembly.", "event_order": 9, "position": [9]}, {"event": "South Korean parliament impeached President Yoon Suk Yeol following his martial law attempt.", "event_order": 10, "position": [5]}, {"event": "Prime Minister Han Duck-soo became acting president after Yoon's impeachment.", "event_order": 11, "position": [5]}, {"event": "Yoon faces criminal investigations including insurrection charges, potentially leading to arrest.", "event_order": 12, "position": [9]}]}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "timeline": [{"event": "A magnitude 7.7 (or 7.9) earthquake struck central Myanmar, near Sagaing and Mandalay, on March 28, 2025, at approximately 06:20 UTC (12:50 LT/Yangon time).", "event_order": 1, "position": [2, 3, 4, 5, 8, 9]}, {"event": "The earthquake was caused by a rupture lasting a full minute.", "event_order": 2, "position": [4]}, {"event": "A large aftershock, including a magnitude 6.4 temblor occurring 12 minutes later, followed the initial earthquake.", "event_order": 3, "position": [3, 8, 9]}, {"event": "Buildings collapsed and infrastructure was damaged in multiple locations in Myanmar, including Mandalay, Naypyidaw, and Sagaing Township.", "event_order": 4, "position": [2, 3, 4, 9]}, {"event": "Mandalay General Hospital stopped admitting patients due to being full and lacking power and water.", "event_order": 5, "position": [4]}, {"event": "A skyscraper under construction collapsed in Bangkok, Thailand, causing casualties and disruption of services.", "event_order": 6, "position": [3, 8]}, {"event": "144 people were killed and 732 injured in Myanmar initially.", "event_order": 7, "position": [9]}, {"event": "Myanmar declared a state of emergency in six quake-affected areas.", "event_order": 8, "position": [8, 9]}, {"event": "Myanmar's military government requested international humanitarian aid.", "event_order": 9, "position": [5, 8, 9]}, {"event": "India sent 15 tonnes of relief material to Myanmar.", "event_order": 10, "position": [8]}, {"event": "The UN began mobilizing aid for Myanmar.", "event_order": 11, "position": [5]}, {"event": "Death toll rose to 4,390 in Myanmar and 36 in Thailand by April 3, following the earthquake on March 28, 2025.", "event_order": 12, "position": [2]}]}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "timeline": [{"event": "The Department of Government Efficiency (DOGE) is established on the eve of President Trump's presidency, with Elon Musk and Vivek Ramaswamy appointed as its co-leaders.", "event_order": 1, "position": [1, 3, 4, 6, 7, 9, 10]}, {"event": "The United States Digital Service is taken over and rebranded as United States DOGE Service.", "event_order": 2, "position": [10]}, {"event": "DOGE begins recruiting over 50 staffers, aiming for 100 by Trump's inauguration.", "event_order": 3, "position": [4]}, {"event": "DOGE plans for executives to perform six-month voluntary stints inside the federal government, working 80-hour weeks without pay.", "event_order": 4, "position": [1]}, {"event": "Steve Davis, Emil Michael, Katie Miller, and Bill McGinley are appointed to leadership roles within DOGE.", "event_order": 5, "position": [4]}, {"event": "DOGE initiates the dispatch of representatives to federal agencies to conduct preliminary interviews aimed at reducing federal spending and regulations.", "event_order": 6, "position": [1, 4]}, {"event": "Elon Musk begins tempering his initial goal of cutting $2 trillion in federal spending.", "event_order": 7, "position": [4]}, {"event": "Treasury Department's top civil servant, David Lebryk, resigns after DOGE officials inquire about stopping federal payments.", "event_order": 8, "position": [8]}, {"event": "Three former Elon Musk employees obtain top positions at the Office of Personnel Management (OPM).", "event_order": 9, "position": [8]}, {"event": "President Trump suggests federal workers who do not return to offices by a deadline will be fired.", "event_order": 10, "position": [8]}, {"event": "Elon Musk uses his X platform to attack federal judges while leading DOGE.", "event_order": 11, "position": [3]}]}
{"topic_id": 10, "topic": "US imposes widespread trade tariffs after Trump's re-election", "timeline": [{"event": "Trump previously imposed tariffs on imported steel, aluminum, and from China, angering allies like Australia.", "event_order": 1, "position": [1, 4, 10]}, {"event": "Trump planned to raise tariffs on Canadian steel and aluminum to 50%.", "event_order": 2, "position": [6]}, {"event": "Doug Ford paused a surcharge (retaliation to US tariffs) after discussions.", "event_order": 3, "position": [6]}, {"event": "Navarro confirmed the planned Canadian tariff increase was canceled.", "event_order": 4, "position": [6]}, {"event": "Teradyne shares plummeted after warning about the impact of tariffs.", "event_order": 5, "position": [8]}, {"event": "The U.S. Embassy in China's Weibo account was flooded with angry comments expressing disappointment with U.S. policies.", "event_order": 6, "position": [9]}, {"event": "Trump imposed tariffs on Colombia after the president refused deportees, leading to Colombia's compliance.", "event_order": 7, "position": [10]}, {"event": "China, Canada, and Mexico imposed retaliatory tariffs in response to Trump's tariffs.", "event_order": 8, "position": [10]}, {"event": "President Trump announced new widespread tariffs, planning imposition on April 2.", "event_order": 9, "position": [2, 4]}, {"event": "New widespread tariffs began to take effect.", "event_order": 10, "position": [2]}, {"event": "Global stock markets declined following the widespread tariff announcements.", "event_order": 11, "position": [2]}, {"event": "US Senate considered a bill to halt Trump's tariffs on Canadian imports.", "event_order": 12, "position": [3]}]}
