{"topic_id": 6, "topic": "Trump re-elected as US President", "uuid": "5c0137bc-dc08-4654-b230-499024dcf188", "event1": "Donald Trump was found guilty on 34 felony charges in New York.", "event1_order": 1, "event1_context": ["Donald Trump was elected the 47th president after winning Wisconsin and securing over 270 electoral votes. His victory followed a campaign where he attacked Kamala Harris. Upon taking office, Trump will work with a Republican-controlled Senate. He vowed to reshape the government and pursue retribution. The election season included two assassination attempts targeting Trump. Harris rose to the top of the ticket after Biden exited the race. Trump is the first former president to return to power since Grover Cleveland, the first convicted of a felony to be elected president, and the oldest person elected president. Trump plans to enact a sweeping agenda. Democrats and some Republicans warned about shocks to democracy. Trump praised strongman leaders and suggested suspending the Constitution. During the campaign, a gunman opened fire at a Trump rally, and a second assassination attempt was thwarted. Trump faced state and federal indictments for his role in the insurrection, his handling of classified information, and election interference. He was found guilty on 34 felony charges in New York and liable in two civil cases. As president, he could erase federal charges against him. Trump plans a radical agenda, including a large deportation effort.\n"], "event1_pos": [2], "event2": "Donald Trump elected president after winning Wisconsin and securing over 270 electoral votes.", "event2_order": 4, "event2_context": ["Donald Trump was elected the 47th president after winning Wisconsin and securing over 270 electoral votes. His victory followed a campaign where he attacked Kamala Harris. Upon taking office, Trump will work with a Republican-controlled Senate. He vowed to reshape the government and pursue retribution. The election season included two assassination attempts targeting Trump. Harris rose to the top of the ticket after Biden exited the race. Trump is the first former president to return to power since Grover Cleveland, the first convicted of a felony to be elected president, and the oldest person elected president. Trump plans to enact a sweeping agenda. Democrats and some Republicans warned about shocks to democracy. Trump praised strongman leaders and suggested suspending the Constitution. During the campaign, a gunman opened fire at a Trump rally, and a second assassination attempt was thwarted. Trump faced state and federal indictments for his role in the insurrection, his handling of classified information, and election interference. He was found guilty on 34 felony charges in New York and liable in two civil cases. As president, he could erase federal charges against him. Trump plans a radical agenda, including a large deportation effort.\n", "Donald Trump won reelection to the White House. Analysts cite Trump's appeal to white voters, some suggesting Americans are not ready to trust a woman president, and others blaming global rage against political leadership. Eric Schickler notes Trump will be surrounded by loyal staff and with a Republican Senate and House, he can make major legislative changes, especially regarding taxes, and act unilaterally. Raka Ray attributes the outcome to anger about the economy and racist/misogynist rejection of Harris, coupled with fears regarding racial identity and global conflicts. Lisa García Bedolla argues many voters supported Trump because of, not despite, his racist/misogynist statements. Laura Kray believes the results confirm that voters still implicitly endorse traditional gender hierarchies in political leadership. Eric A. Stanley states the GOP used anti-trans hate to move people to the polls. M. Steven Fish asserts Harris reverted to risk-averse tactics and failed to forcefully celebrate the economy. Jacob Grumbach expresses concern about the executive branch influencing future elections and the \"stop the steal\" conspiracy continuing. Michael Mark Cohen says Trump's administration will be staffed with conspiracy theorists, backed by American power. Daniel Sargent places Trump's victory within a pattern of populist-nationalist insurgencies. Susan Hyde notes populism, inflation, ethnonationalism, and manipulation of voter fears are common in global elections. David C. Wilson states that for a majority, democracy is more about power, also noting the racial and gender factors in voting.\n"], "event2_pos": [2, 5], "ori_score": 18}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "d5dc0380-baf1-4a26-98c2-a7dc8292d300", "event1": "Scotland voted to remain in the EU (62% to 38%), diverging from the rest of the UK.", "event1_order": 7, "event1_context": ["The UK voted to leave the EU in a June 23 referendum by a margin of 52% to 48%. UK public opinion of the EU has been less favorable than that of other EU members for nearly a decade. A Pew Research Center survey indicated that some other EU countries share the UK's desire for a less centralized Europe. The UK public perceived the EU as inefficient, intrusive, and mishandling key issues like refugees and the economy. 65% of the British public desired the return of some EU powers to London prior to the referendum. The Brexit vote exposed a division between Scotland, which voted to remain in the EU by 62% to 38%, and the rest of the UK. Scotland and the rest of the UK also diverge on economic and immigration threat perceptions. Other EU member states largely viewed Brexit as detrimental to the EU. A majority in Greece and pluralities in other EU nations favor returning some EU power to their national governments.\n"], "event1_pos": [3], "event2": "Nigel Farage admitted a key Leave campaign promise about redirecting EU funds to the national health system was inaccurate.", "event2_order": 9, "event2_context": ["British voters elected to leave the European Union. UK Independence Party leader Nigel Farage admitted a key Leave campaign promise about redirecting EU funds to the national health system was inaccurate. Residents of Cornwall worried about losing promised EU subsidies. The British pound plummeted, global stocks tanked, and some voters regretted their decision, with some claiming they thought they were lodging a protest vote and didn't think Brexit would actually happen. Over three million Brits called for a do-over. Critics say Prime Minister David Cameron initiated the referendum due to a political bind. Political scientist David A. Bell argues referendums on technical issues undermine democratic institutions. He also notes referendums can lead to policies that are hard to dislodge and undermine the legitimacy of legislatures. Brexit supporters cast the vote as one of fundamental sovereignty. Martin Kettle argued Brexit should be a referendum on referendums.\n"], "event2_pos": [10], "ori_score": 18}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "6964dc8f-cd09-45e0-a283-2df74b0f45b0", "event1": "Increased diplomacy between Japan and Israel, starting with Benjamin Netanyahu's visit to Tokyo in 2014.", "event1_order": 4, "event1_context": ["Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event1_pos": [10], "event2": "Tetsuya Yamagami fired two shots at Shinzo Abe, hitting his chest and neck.", "event2_order": 9, "event2_context": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally. Security arrested the suspected gunman, Tetsuya Yamagami. Yamagami fired two shots at Abe; the second shot hit Abe's chest and neck. Abe died several hours later. Yamagami attacked Abe due to Abe's association with a group Yamagami hated. Tributes were given by President Biden, Secretary of State Antony Blinken, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin, and former Australian Prime Minister Tony Abbott. Abe worked to build up Japan's military and reform the economy. Abe failed to revise Japan's constitution but passed legislation allowing Japan's military to expand operations overseas. Abe was a critic of China and called on the US to give Taiwan assurances of help in the event of an attack by China.\n", "Shinzo Abe, former Prime Minister of Japan, was assassinated during a campaign rally in Nara, Japan. The shooting involved a gun, rare in Japan due to stringent firearm laws. Gun violence is almost unheard-of in Japan, with only one firearm-related death in 2021. The shooter used a handmade gun, which was seized along with several others at his home. Japan's firearms laws are strict, requiring a 12-step process to purchase a gun. Political assassinations were common before WWII, but rare since; the last killing of a national political figure was in 1960. Light police protection at political events allowed the shooter unobstructed access. The incident has shocked Japan and raised questions about the country's safety and political future.\n", "Former Japanese Prime Minister Shinzo Abe was shot while delivering a campaign speech in Nara. The attack occurred at approximately 11:30 a.m. before upper house elections. Abe collapsed, bleeding from the neck and chest. He was taken to a hospital in cardiac arrest and pronounced dead at 5:03 p.m. due to excessive bleeding; a bullet reached his heart. Tetsuya Yamagami, 41, was arrested for attempted murder; police recovered a gun, possibly homemade. Witnesses reported hearing two gunshots. World leaders, including Donald Trump, Emmanuel Macron, and Narendra Modi, condemned the attack.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n", "Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event2_pos": [1, 7, 8, 9, 10], "ori_score": 8}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "f8dc1e7f-9e5d-4bc7-98fe-3623a5cecefb", "event1": "Abe promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia.", "event1_order": 6, "event1_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event1_pos": [4], "event2": "Security officers detained Tetsuya Yamagami and seized his handmade gun.", "event2_order": 11, "event2_context": ["Shinzo Abe, Japan's former prime minister, was assassinated while giving a campaign speech in Nara. The suspected gunman was arrested at the scene with a handmade gun. Abe, 67, was shot, collapsed, and was bleeding from the chest. Videos of the assassination circulated on social media, prompting social media companies to remove harmful content. Abe was a polarizing figure known for revitalizing Japan’s economy and his revisionist views of World War II.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n"], "event2_pos": [3, 9], "ori_score": 11}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "74826fe7-8793-4175-8ba3-30b7b3b890dd", "event1": "Abe promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia.", "event1_order": 6, "event1_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event1_pos": [4], "event2": "Shinzo Abe collapsed; Shinzo Abe; Bleeding from neck and chest after being shot.", "event2_order": 10, "event2_context": ["Former Japanese Prime Minister Shinzo Abe was shot while delivering a campaign speech in Nara. The attack occurred at approximately 11:30 a.m. before upper house elections. Abe collapsed, bleeding from the neck and chest. He was taken to a hospital in cardiac arrest and pronounced dead at 5:03 p.m. due to excessive bleeding; a bullet reached his heart. Tetsuya Yamagami, 41, was arrested for attempted murder; police recovered a gun, possibly homemade. Witnesses reported hearing two gunshots. World leaders, including Donald Trump, Emmanuel Macron, and Narendra Modi, condemned the attack.\n"], "event2_pos": [8], "ori_score": 8}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "2eb45e63-2f6a-4adb-b308-c5f765669d86", "event1": "India sent 15 tonnes of relief material to Myanmar.", "event1_order": 10, "event1_context": ["A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n"], "event1_pos": [8], "event2": "Death toll rose to 4,390 in Myanmar and 36 in Thailand by April 3, following the earthquake on March 28, 2025.", "event2_order": 12, "event2_context": ["On March 28, 2025, a M7.7 earthquake hit Myanmar at 06:20 UTC, followed by a M6.7 aftershock 12 minutes later. The epicenter was near Sagaing and Mandalay. Violent shaking was felt by millions, and the USGS issued a Red alert, predicting high casualties and extensive damage. Liquefaction and landslides were triggered. Buildings collapsed in Mandalay and roads buckled in Naypyidaw. Over 1,000 deaths and 2,400 injuries were reported initially. National phone and internet infrastructure was disrupted. Approximately 2,970 residential buildings, 150 religious structures, 30 roads, and 7 bridges were destroyed or severely damaged. Many mosques and monasteries collapsed, resulting in deaths during prayer time and trapping monks. Mandalay was severely affected, with at least 674 deaths and over 1,000 missing and more than half of the city’s buildings severely damaged or destroyed. Significant damage occurred to Mandalay University, the Dokhtawaddy Bridge, Mandalay Palace and Sagaing Township experienced widespread structural failure. In Naypyidaw, 204 fatalities were confirmed, with damage to government buildings and the airport control tower. In Shan State, at least 60 deaths were reported. In Bago Region, school and shelter collapses caused fatalities. Yangon experienced limited damage. In Thailand, at least 10 people were killed, 68 injured and 90 missing, with building collapses in Bangkok and suspension of transit and trading. On March 31, the death toll rose to over 2,900 in Myanmar and 18 in Thailand. By April 3, the death toll reached 4,390 in Myanmar and 36 in Thailand, with over 5,490 injured and hundreds missing. States of emergency were declared.\n"], "event2_pos": [2], "ori_score": 8}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "f223cd14-588c-4948-8d2c-bcf90e012be8", "event1": "Yoshihide Suga succeeded Abe as prime minister in September 2020.", "event1_order": 7, "event1_context": ["In the early 2000s, Shinzo Abe was the deputy chief cabinet secretary. In 2002, Abe handled arrangements for a summit between Junichiro Koizumi and Kim Jong Il in Pyongyang. In 2006, Abe became the youngest prime minister in postwar Japan. In 2012, Abe returned to office and later became the longest-serving prime minister. During his tenure, Abe implemented \"Abenomics,\" and the stock market increased but economic inequality widened. Yoshihide Suga succeeded Abe in September 2020. Abe met with Donald Trump and Vladimir Putin, and in 2014, he met with Xi Jinping. After his death, Abe was celebrated for strengthening the defense alliance with the United States. Abe wanted to revise the Japanese Constitution but died still pushing for it.\n"], "event1_pos": [6], "event2": "Shinzo Abe was murdered while campaigning in Nara on July 8, 2022.", "event2_order": 8, "event2_context": ["Former Japanese Prime Minister Shinzo Abe was assassinated at a campaign rally. Security arrested the suspected gunman, Tetsuya Yamagami. Yamagami fired two shots at Abe; the second shot hit Abe's chest and neck. Abe died several hours later. Yamagami attacked Abe due to Abe's association with a group Yamagami hated. Tributes were given by President Biden, Secretary of State Antony Blinken, Indian Prime Minister Narendra Modi, Russian President Vladimir Putin, and former Australian Prime Minister Tony Abbott. Abe worked to build up Japan's military and reform the economy. Abe failed to revise Japan's constitution but passed legislation allowing Japan's military to expand operations overseas. Abe was a critic of China and called on the US to give Taiwan assurances of help in the event of an attack by China.\n", "Shinzo Abe, Japan's former prime minister, was assassinated while giving a campaign speech in Nara. The suspected gunman was arrested at the scene with a handmade gun. Abe, 67, was shot, collapsed, and was bleeding from the chest. Videos of the assassination circulated on social media, prompting social media companies to remove harmful content. Abe was a polarizing figure known for revitalizing Japan’s economy and his revisionist views of World War II.\n", "Shinzo Abe, former Prime Minister of Japan, was assassinated during a campaign rally in Nara, Japan. The shooting involved a gun, rare in Japan due to stringent firearm laws. Gun violence is almost unheard-of in Japan, with only one firearm-related death in 2021. The shooter used a handmade gun, which was seized along with several others at his home. Japan's firearms laws are strict, requiring a 12-step process to purchase a gun. Political assassinations were common before WWII, but rare since; the last killing of a national political figure was in 1960. Light police protection at political events allowed the shooter unobstructed access. The incident has shocked Japan and raised questions about the country's safety and political future.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n", "Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event2_pos": [1, 3, 7, 9, 10], "ori_score": 11}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "db5cc422-a64a-4730-87b5-94a0594d1508", "event1": "Abe outlined his vision for a 'free and open Indo-Pacific' in 2016.", "event1_order": 5, "event1_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event1_pos": [4], "event2": "Security officers detained Tetsuya Yamagami and seized his handmade gun.", "event2_order": 11, "event2_context": ["Shinzo Abe, Japan's former prime minister, was assassinated while giving a campaign speech in Nara. The suspected gunman was arrested at the scene with a handmade gun. Abe, 67, was shot, collapsed, and was bleeding from the chest. Videos of the assassination circulated on social media, prompting social media companies to remove harmful content. Abe was a polarizing figure known for revitalizing Japan’s economy and his revisionist views of World War II.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n"], "event2_pos": [3, 9], "ori_score": 3}
{"topic_id": 6, "topic": "Trump re-elected as US President", "uuid": "db39506f-ce0c-4cb0-ba64-50c22b9fa393", "event1": "Two assassination attempts occurred targeting Donald Trump during the election season.", "event1_order": 2, "event1_context": ["Donald Trump was elected the 47th president after winning Wisconsin and securing over 270 electoral votes. His victory followed a campaign where he attacked Kamala Harris. Upon taking office, Trump will work with a Republican-controlled Senate. He vowed to reshape the government and pursue retribution. The election season included two assassination attempts targeting Trump. Harris rose to the top of the ticket after Biden exited the race. Trump is the first former president to return to power since Grover Cleveland, the first convicted of a felony to be elected president, and the oldest person elected president. Trump plans to enact a sweeping agenda. Democrats and some Republicans warned about shocks to democracy. Trump praised strongman leaders and suggested suspending the Constitution. During the campaign, a gunman opened fire at a Trump rally, and a second assassination attempt was thwarted. Trump faced state and federal indictments for his role in the insurrection, his handling of classified information, and election interference. He was found guilty on 34 felony charges in New York and liable in two civil cases. As president, he could erase federal charges against him. Trump plans a radical agenda, including a large deportation effort.\n"], "event1_pos": [2], "event2": "Panelists analyzed potential limits on Trump's agenda and power, even with Republican control of Congress.", "event2_order": 9, "event2_context": ["Johns Hopkins held a virtual event, \"Insights and Impacts: Post-Election Debrief,\" on Nov. 7 to discuss the election's effects. Panelists included Leah Wright Rigueur, Soren Dayton, Lilliana Mason, and Eugene Scott, introduced by Amy Binder and moderated by Steven Teles. Rigueur noted polarization and Harris's disadvantages as factors. Key takeaways included the disconnect between the economy and people's feelings, Trump's success in attracting new voters (including Latino and Black voters, and some Muslim voters due to the Gaza conflict), and information inconsistencies (e.g., regarding reproductive rights and stimulus checks). Mason highlighted a global trend of incumbent candidates losing due to uncertainty and a move toward strong leaders. Panelists noted a shift in political parties, with the Republican base now largely working class. Trump's style was discussed, with some voters overlooking his idiosyncrasies due to economic concerns. Panelists also discussed that Trump's agenda and power would be limited even with Republican control of Congress. They advised against assuming the worst, citing instances where Trump failed to achieve campaign promises.\n"], "event2_pos": [3], "ori_score": 15}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "46b964ae-2dc0-4fec-88fb-657bdcc87573", "event1": "Increased diplomacy between Japan and Israel, starting with Benjamin Netanyahu's visit to Tokyo in 2014.", "event1_order": 4, "event1_context": ["Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event1_pos": [10], "event2": "Security officers detained Tetsuya Yamagami and seized his handmade gun.", "event2_order": 11, "event2_context": ["Shinzo Abe, Japan's former prime minister, was assassinated while giving a campaign speech in Nara. The suspected gunman was arrested at the scene with a handmade gun. Abe, 67, was shot, collapsed, and was bleeding from the chest. Videos of the assassination circulated on social media, prompting social media companies to remove harmful content. Abe was a polarizing figure known for revitalizing Japan’s economy and his revisionist views of World War II.\n", "On July 8, 2022, former Japanese Prime Minister Shinzo Abe was murdered while campaigning in Nara. Doctors attempted to save Abe's life after he was shot, but he remained comatose. Prime Minister Fumio Kishida condemned the attack. Abe had a bullet wound on his neck and subcutaneous bleeding on his chest. Witnesses saw a man firing twice at Abe from behind. Security officers detained the attacker, Tetsuya Yamagami, and seized his handmade gun. Yamagami is believed to be a former member of Japan’s Maritime Self-Defense Forces. Explosives were found at his home. World leaders expressed shock and condemned the murder, warning of attacks on supporters of democracy. The incident has drawn comparisons to pre-World War II political violence in Japan, including the assassinations of PM Hirobumi Ito and Finance Minister Korekiyo Takahashi. Past post-WW2 political violence includes the stabbing of Inejiro Asanuma in 1960, the shooting of Iccho Ito in 2007 and the stabbing of Koki Ishii.\n"], "event2_pos": [3, 9], "ori_score": 8}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "c218f1d5-15d3-4bda-ac68-2d5082f58eb4", "event1": "After the Capitol was secured, Congress reconvened to continue the certification of President-elect Joe Biden's win.", "event1_order": 10, "event1_context": ["On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n", "Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event1_pos": [3, 10], "event2": "Trump was banned from Twitter on January 8th and impeached for a second time on January 13th.", "event2_order": 14, "event2_context": ["Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_pos": [10], "ori_score": 40}
{"topic_id": 10, "topic": "US imposes widespread trade tariffs after Trump's re-election", "uuid": "e5cdfee0-0c37-4748-b611-a19ca07c0a7a", "event1": "Teradyne shares plummeted after warning about the impact of tariffs.", "event1_order": 5, "event1_context": ["**Palantir:**\n*   Palantir shares rose after a three-week slump due to Pentagon spending reduction reports and tech stock selling.\n*   Analysts remain bullish due to Palantir's AI software.\n\n**Viking:**\n*   Viking shares fell after executives warned of slower bookings due to macroeconomic uncertainties.\n*   January bookings were strong, but February slowed.\n*   Q4 revenue was $1.35 billion with EPS of 45 cents.\n*   2025 advance bookings were $5.3 billion, up 26% year-over-year.\n\n**Asana:**\n*   Asana shares plunged after CEO Dustin Moskovitz announced he would step down.\n*   Fiscal 2026 revenue outlook is $782 million to $790 million, below analyst expectations.\n\n**AI Stocks:**\n*   AI stocks rebounded after a pullback, with Super Micro Computer leading.\n*   Concerns about overspending, slowing growth at Nvidia, and Chinese competition had stalled the rally.\n\n**S&P 500:**\n*   The S&P 500 fell below its 200-day moving average.\n*   Analysts suggest companies may prioritize stock buybacks due to uncertainty.\n\n**Tesla:**\n*   Tesla shares jumped after a significant sell-off.\n*   Analysts at Morgan Stanley call Tesla its “top pick” among U.S. automakers, bolstered by artificial intelligence and robotics potential.\n*   Recent losses are due to worries about China sales, Europe registrations, and tariffs.\n\n**Small Business Owners:**\n*   Small business owner confidence dropped due to Trump policy changes.\n*   Uncertainty index rose.\n*   Businesses are raising prices.\n\n**Airlines:**\n*   Delta, Southwest, and American Airlines lowered first-quarter projections due to weakening travel demand.\n*   JetBlue lowered its first-quarter projection for available seat miles due to weather disruptions and \"demand choppiness due to mixed macroeconomic indicators.\"\n\n**Teradyne:**\n*   Teradyne shares plummeted after warning about the impact of tariffs.\n*   Anticipates second-quarter revenue to be flat to down 10% from the first quarter and full-year revenue up 5% to 10% year-over-year.\n*   Teradyne acquired Quantifi Photonics.\n\n**Southwest Airlines:**\n*   Southwest Airlines shares surged after announcing baggage fees and a basic economy ticket option.\n*   Growth projections for first-quarter revenue per available seat mile lowered.\n\n**Kohl's:**\n*   Kohl's stock plunged on a disappointing outlook.\n*   Fiscal 2025 net sales and comparable sales are projected to fall, with lower EPS.\n\n**Tesla (Technical Analysis):**\n*   Tesla shares moved slightly higher in premarket trading after tumbling 15% on Monday.\n*   Since hitting a record high in mid-December, Tesla shares have fallen 55%.\n*   Investors should monitor key support levels on Tesla's chart around $215 and $165, while also watching major resistance levels near $265 and $300.\n"], "event1_pos": [8], "event2": "The U.S. Embassy in China's Weibo account was flooded with angry comments expressing disappointment with U.S. policies.", "event2_order": 6, "event2_context": ["Chinese people are drawing parallels between the Trump administration and China's Cultural Revolution. They observe similarities such as the dismantling of institutions, the pursuit of power, and the rise of a cult of personality. They express alarm at the perceived erosion of democratic values in the U.S. and the use of propaganda-like language by U.S. government agencies. The U.S. Embassy in China's Weibo account has been flooded with angry comments expressing disappointment with U.S. policies. Comparisons are drawn between Trump's actions and those of authoritarian leaders, including Mao Zedong and Xi Jinping.\n"], "event2_pos": [9], "ori_score": 44}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "894cc9ed-ba1b-4cbf-aa1a-0d7b725b7054", "event1": "The United States Digital Service is taken over and rebranded as United States DOGE Service.", "event1_order": 2, "event1_context": ["Trump's plan to retool the federal government initially involved billionaires Lutnick, Musk, and Ramaswamy. Lutnick was to run the Commerce Department. Ramaswamy stepped aside before Trump assumed office. Musk now leads the federal cost-cutting effort. The project started with the takeover of the United States Digital Service, renamed United States DOGE Service, which was created in 2014 to fix failing computer systems.\n"], "event1_pos": [10], "event2": "Elon Musk begins tempering his initial goal of cutting $2 trillion in federal spending.", "event2_order": 7, "event2_context": ["Elon Musk and Vivek Ramaswamy are sending representatives to federal agencies to conduct preliminary interviews aimed at reducing federal spending and regulations. These representatives are part of the \"Department of Government Efficiency\" (DOGE), which is tied to Donald Trump's transition team. Musk and Ramaswamy have hired over 50 staffers for DOGE, aiming for 100 by Trump's inauguration. DOGE faces obstacles including skepticism from congressional Republicans and civil servants. Musk has begun tempering his initial goal of cutting $2 trillion in federal spending. Trump named Musk and Ramaswamy as DOGE's co-leaders to identify government waste for the White House Office of Management and Budget to cut. DOGE has received numerous applications through X. Steve Davis is helping oversee the effort, and Emil Michael is overseeing regulation cuts. Katie Miller and Bill McGinley were also appointed to DOGE. Questions remain about DOGE's authority and responsibilities, and whether it has Trump's full backing.\n"], "event2_pos": [4], "ori_score": 37}
{"topic_id": 6, "topic": "Trump re-elected as US President", "uuid": "166e8f84-2677-429e-9422-18b32746bfe3", "event1": "Two assassination attempts occurred targeting Donald Trump during the election season.", "event1_order": 2, "event1_context": ["Donald Trump was elected the 47th president after winning Wisconsin and securing over 270 electoral votes. His victory followed a campaign where he attacked Kamala Harris. Upon taking office, Trump will work with a Republican-controlled Senate. He vowed to reshape the government and pursue retribution. The election season included two assassination attempts targeting Trump. Harris rose to the top of the ticket after Biden exited the race. Trump is the first former president to return to power since Grover Cleveland, the first convicted of a felony to be elected president, and the oldest person elected president. Trump plans to enact a sweeping agenda. Democrats and some Republicans warned about shocks to democracy. Trump praised strongman leaders and suggested suspending the Constitution. During the campaign, a gunman opened fire at a Trump rally, and a second assassination attempt was thwarted. Trump faced state and federal indictments for his role in the insurrection, his handling of classified information, and election interference. He was found guilty on 34 felony charges in New York and liable in two civil cases. As president, he could erase federal charges against him. Trump plans a radical agenda, including a large deportation effort.\n"], "event1_pos": [2], "event2": "Donald Trump won the popular vote by approximately four million votes.", "event2_order": 7, "event2_context": ["Donald Trump won Arizona, securing its 11 electoral votes and completing a Republican sweep of swing states. This is Trump's second Arizona win since 2016, defeating Kamala Harris. Trump campaigned on border security and the economy. This victory diminishes Arizona Democrats' hopes after their recent successes. Trump's win marks a comeback to the White House. Voters' top concern was the economy and inflation. Trump also won the popular vote by a margin of around four million votes.\n"], "event2_pos": [10], "ori_score": 31}
{"topic_id": 6, "topic": "Trump re-elected as US President", "uuid": "8aeedc5b-1b78-44ab-b976-17f6832e8dba", "event1": "Two assassination attempts occurred targeting Donald Trump during the election season.", "event1_order": 2, "event1_context": ["Donald Trump was elected the 47th president after winning Wisconsin and securing over 270 electoral votes. His victory followed a campaign where he attacked Kamala Harris. Upon taking office, Trump will work with a Republican-controlled Senate. He vowed to reshape the government and pursue retribution. The election season included two assassination attempts targeting Trump. Harris rose to the top of the ticket after Biden exited the race. Trump is the first former president to return to power since Grover Cleveland, the first convicted of a felony to be elected president, and the oldest person elected president. Trump plans to enact a sweeping agenda. Democrats and some Republicans warned about shocks to democracy. Trump praised strongman leaders and suggested suspending the Constitution. During the campaign, a gunman opened fire at a Trump rally, and a second assassination attempt was thwarted. Trump faced state and federal indictments for his role in the insurrection, his handling of classified information, and election interference. He was found guilty on 34 felony charges in New York and liable in two civil cases. As president, he could erase federal charges against him. Trump plans a radical agenda, including a large deportation effort.\n"], "event1_pos": [2], "event2": "Republicans used anti-trans hate to move people to the polls", "event2_order": 3, "event2_context": ["Donald Trump won reelection to the White House. Analysts cite Trump's appeal to white voters, some suggesting Americans are not ready to trust a woman president, and others blaming global rage against political leadership. Eric Schickler notes Trump will be surrounded by loyal staff and with a Republican Senate and House, he can make major legislative changes, especially regarding taxes, and act unilaterally. Raka Ray attributes the outcome to anger about the economy and racist/misogynist rejection of Harris, coupled with fears regarding racial identity and global conflicts. Lisa García Bedolla argues many voters supported Trump because of, not despite, his racist/misogynist statements. Laura Kray believes the results confirm that voters still implicitly endorse traditional gender hierarchies in political leadership. Eric A. Stanley states the GOP used anti-trans hate to move people to the polls. M. Steven Fish asserts Harris reverted to risk-averse tactics and failed to forcefully celebrate the economy. Jacob Grumbach expresses concern about the executive branch influencing future elections and the \"stop the steal\" conspiracy continuing. Michael Mark Cohen says Trump's administration will be staffed with conspiracy theorists, backed by American power. Daniel Sargent places Trump's victory within a pattern of populist-nationalist insurgencies. Susan Hyde notes populism, inflation, ethnonationalism, and manipulation of voter fears are common in global elections. David C. Wilson states that for a majority, democracy is more about power, also noting the racial and gender factors in voting.\n"], "event2_pos": [5], "ori_score": 23}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "c8532c30-083c-4102-a82a-368d415977c0", "event1": "D.C.'s Mayor issued a 6 p.m. citywide curfew.", "event1_order": 7, "event1_context": ["Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n"], "event1_pos": [8], "event2": "Trump was banned from Twitter on January 8th and impeached for a second time on January 13th.", "event2_order": 14, "event2_context": ["Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_pos": [10], "ori_score": 45}
{"topic_id": 2, "topic": "COVID-19 pandemic triggers global health crisis", "uuid": "69033e8c-4bd5-4de2-987b-55377f36b79c", "event1": "Experts advocated for systemic economic transformation, linking planetary crises like deforestation and climate change to increased pandemic risk and calling for investment in green infrastructure.", "event1_order": 6, "event1_context": ["The COVID-19 pandemic is threatening lives and economies and exposed humanity's capacity for rapid transformation. Experts advocate for systemic economic change. The pandemic forced lockdowns, terrified citizens, and triggered financial meltdown, demanding immediate response and long-term planning like the European Green Deal. COVID-19 reflects a trend of increasing planetary crises that existing economic models exacerbate, echoing warnings from the Club of Rome and Donella Meadows about exceeding Earth's limits. Interconnectedness means crises like COVID-19, climate change, and biodiversity loss require collective action. Deforestation, biodiversity loss, and climate change increase pandemic risk, highlighting the need to mitigate threats through green economies. Transformational changes are possible, and the crisis presents an opportunity to phase out fossil fuels, eliminate subsidies, and shift to regenerative agriculture. New economic models prioritize living within planetary boundaries, creating a \"safe and just operating space for all of humanity\" through investment in renewable energy and green infrastructure.\n"], "event1_pos": [1], "event2": "The pandemic increased suicide risk due to social distancing and economic fallout, challenging mental health care access.", "event2_order": 11, "event2_context": ["The coronavirus pandemic is expected to increase suicide risk due to social distancing, quarantines, and the social and economic fallout. Experts highlight isolation as a major trigger, with anxieties arising from the unknown. Mental health care access is challenged by the pandemic. Past outbreaks like SARS showed increased suicide rates due to social disengagement and economic disruption. Job loss is a risk factor. Communities are mounting efforts to support vulnerable populations and combat isolation. Emergency aid packages aim to provide economic relief. The pandemic may provide some suicidal individuals with a renewed sense of purpose.\n"], "event2_pos": [10], "ori_score": 21}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "7c1aa3da-3e11-45f6-94c1-71f084b883ae", "event1": "Treasury Department's top civil servant, David Lebryk, resigns after DOGE officials inquire about stopping federal payments.", "event1_order": 8, "event1_context": ["Elon Musk, a major Trump benefactor whose companies profit from government contracts, is increasingly embedded in the federal government. The Treasury Department's top civil servant, David Lebryk, left after Trump-affiliated officials from DOGE (Department of Government Efficiency) inquired about stopping federal payments, which Lebryk opposed. Musk advocates for reclaiming power from the \"unelected bureaucracy\" and pushes against taxpayer funding for NGOs. Three former Musk employees now hold top positions at the Office of Personnel Management (OPM), which offered federal workers buyouts, raising concerns about legality. These Musk allies are also present in agencies like the General Services Administration. Trump suggested federal workers would be fired if they didn't return to offices by a deadline. Musk may be sleeping at the Eisenhower Executive Office Building. Concerns are raised about potential conflicts of interest, and demands are made for transparency regarding Musk's role and DOGE participants. Trump's OPM director nominee is unconfirmed. Plans include mass firings and spending cuts, including potential Medicare scrutiny. A public plan or list of Musk allies within the government is lacking.\n"], "event1_pos": [8], "event2": "Three former Elon Musk employees obtain top positions at the Office of Personnel Management (OPM).", "event2_order": 9, "event2_context": ["Elon Musk, a major Trump benefactor whose companies profit from government contracts, is increasingly embedded in the federal government. The Treasury Department's top civil servant, David Lebryk, left after Trump-affiliated officials from DOGE (Department of Government Efficiency) inquired about stopping federal payments, which Lebryk opposed. Musk advocates for reclaiming power from the \"unelected bureaucracy\" and pushes against taxpayer funding for NGOs. Three former Musk employees now hold top positions at the Office of Personnel Management (OPM), which offered federal workers buyouts, raising concerns about legality. These Musk allies are also present in agencies like the General Services Administration. Trump suggested federal workers would be fired if they didn't return to offices by a deadline. Musk may be sleeping at the Eisenhower Executive Office Building. Concerns are raised about potential conflicts of interest, and demands are made for transparency regarding Musk's role and DOGE participants. Trump's OPM director nominee is unconfirmed. Plans include mass firings and spending cuts, including potential Medicare scrutiny. A public plan or list of Musk allies within the government is lacking.\n"], "event2_pos": [8], "ori_score": 41}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "6ea3b0af-a53e-42a5-8708-e786807003c8", "event1": "The earthquake was caused by a rupture lasting a full minute.", "event1_order": 2, "event1_context": ["A 7.7-magnitude earthquake hit Myanmar on Friday, causing damage. The Mandalay General Hospital is full and no longer admitting patients, and is without power and water. The earthquake was caused by a rupture lasting a full minute, causing sideways movements. A seismologist compared the quake to one that struck Turkey in 2023, where over 55,000 people died. Bangkok is vulnerable to tremors due to its tall buildings.\n"], "event1_pos": [4], "event2": "The UN began mobilizing aid for Myanmar.", "event2_order": 11, "event2_context": ["An earthquake struck Myanmar, prompting a rare plea for international humanitarian aid from the military government. The military spokesman, Gen. Zaw Min Tun, stated their willingness to cooperate with the international community. Myanmar faces challenges in aid delivery due to its isolation since the 2021 coup and prior sanctions. The UN is mobilizing aid, but logistical hurdles remain due to the ongoing civil war. Michael Martin highlights security risks for aid workers and potential military interference, including preventing access to rebel areas and manipulating aid distribution. Stefan Dercon points out challenges in transferring funds and logistical complexities. Fundraising may also be difficult due to Myanmar's isolation. The extent of U.S. government aid is uncertain.\n"], "event2_pos": [5], "ori_score": 43}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "11c8f55b-586f-4c4c-b352-4a7ff6dadfdc", "event1": "A magnitude 7.7 (or 7.9) earthquake struck central Myanmar, near Sagaing and Mandalay, on March 28, 2025, at approximately 06:20 UTC (12:50 LT/Yangon time).", "event1_order": 1, "event1_context": ["On March 28, 2025, a M7.7 earthquake hit Myanmar at 06:20 UTC, followed by a M6.7 aftershock 12 minutes later. The epicenter was near Sagaing and Mandalay. Violent shaking was felt by millions, and the USGS issued a Red alert, predicting high casualties and extensive damage. Liquefaction and landslides were triggered. Buildings collapsed in Mandalay and roads buckled in Naypyidaw. Over 1,000 deaths and 2,400 injuries were reported initially. National phone and internet infrastructure was disrupted. Approximately 2,970 residential buildings, 150 religious structures, 30 roads, and 7 bridges were destroyed or severely damaged. Many mosques and monasteries collapsed, resulting in deaths during prayer time and trapping monks. Mandalay was severely affected, with at least 674 deaths and over 1,000 missing and more than half of the city’s buildings severely damaged or destroyed. Significant damage occurred to Mandalay University, the Dokhtawaddy Bridge, Mandalay Palace and Sagaing Township experienced widespread structural failure. In Naypyidaw, 204 fatalities were confirmed, with damage to government buildings and the airport control tower. In Shan State, at least 60 deaths were reported. In Bago Region, school and shelter collapses caused fatalities. Yangon experienced limited damage. In Thailand, at least 10 people were killed, 68 injured and 90 missing, with building collapses in Bangkok and suspension of transit and trading. On March 31, the death toll rose to over 2,900 in Myanmar and 18 in Thailand. By April 3, the death toll reached 4,390 in Myanmar and 36 in Thailand, with over 5,490 injured and hundreds missing. States of emergency were declared.\n", "A 7.7 magnitude earthquake hit central Myanmar in Mandalay at 6.21am GMT, originating at a shallow depth of 10km. The earthquake caused buildings to collapse and roads to buckle in Myanmar and Thailand, resulting in a climbing death toll. The quake occurred due to strike-slip faulting on the Sagaing fault between the India and Eurasia plates. The Indian plate moved north along the fault compared to the Eurasian plate. The region has experienced similar large earthquakes in the past. The moment magnitude scale is used to measure the earthquake, which is logarithmic. A large aftershock occurred, and more are expected, posing challenges to rescuers. The China Earthquake Networks Center reported the earthquake reached 7.9 magnitude, with tremors felt in China's Yunnan province.\n", "A 7.7-magnitude earthquake hit Myanmar on Friday, causing damage. The Mandalay General Hospital is full and no longer admitting patients, and is without power and water. The earthquake was caused by a rupture lasting a full minute, causing sideways movements. A seismologist compared the quake to one that struck Turkey in 2023, where over 55,000 people died. Bangkok is vulnerable to tremors due to its tall buildings.\n", "An earthquake struck Myanmar, prompting a rare plea for international humanitarian aid from the military government. The military spokesman, Gen. Zaw Min Tun, stated their willingness to cooperate with the international community. Myanmar faces challenges in aid delivery due to its isolation since the 2021 coup and prior sanctions. The UN is mobilizing aid, but logistical hurdles remain due to the ongoing civil war. Michael Martin highlights security risks for aid workers and potential military interference, including preventing access to rebel areas and manipulating aid distribution. Stefan Dercon points out challenges in transferring funds and logistical complexities. Fundraising may also be difficult due to Myanmar's isolation. The extent of U.S. government aid is uncertain.\n", "A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n", "A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event1_pos": [2, 3, 4, 5, 8, 9], "event2": "The earthquake was caused by a rupture lasting a full minute.", "event2_order": 2, "event2_context": ["A 7.7-magnitude earthquake hit Myanmar on Friday, causing damage. The Mandalay General Hospital is full and no longer admitting patients, and is without power and water. The earthquake was caused by a rupture lasting a full minute, causing sideways movements. A seismologist compared the quake to one that struck Turkey in 2023, where over 55,000 people died. Bangkok is vulnerable to tremors due to its tall buildings.\n"], "event2_pos": [4], "ori_score": 31}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "ff4ccb4d-dbb9-4490-8a22-bfab0eb3d1e7", "event1": "Journalists were attacked by Trump supporters during the Capitol siege.", "event1_order": 6, "event1_context": ["Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event1_pos": [10], "event2": "After the Capitol was secured, Congress reconvened to continue the certification of President-elect Joe Biden's win.", "event2_order": 10, "event2_context": ["On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n", "Right-wing extremists label uniformed individuals \"oath-breakers\" if they dislike their actions. At a December 12th rally, Nicholas Fuentes linked radical-right ethos to anti-police sentiment.\n\nDuring Trump’s January 6th speech, he criticized the media, and journalists were subsequently attacked during the Capitol siege. Trump supporters assaulted a photographer and television crews, smashing their equipment. A man suggested journalists should be killed.\n\nFox News called the race for Biden, angering Trump who then encouraged his supporters to watch Newsmax. A Pennsylvania Three Percent member switched from Fox News to Newsmax after Election Day.\n\nAfter the siege, a conspiracy theory that Antifa instigated the Capitol attack spread. Mo Brooks tweeted about the \"evidence\" of Antifa involvement. A woman who attended \"Stop the Steal\" rallies called the author to inquire about the veracity of claims that Antifa was involved in the riot.\n\nIn 2088, a time capsule honoring Martin Luther King, Jr. will be exhumed.\n\nTrump was permanently banned from Twitter on January 8th and impeached for a second time on January 13th. He admitted no responsibility for the riot.\n\nFuentes called the Capitol siege \"the most awe-inspiring and inspirational and incredible thing I have seen in my entire life.”\n\nAt the Capitol, a man urged the crowd to \"storm your own capitol buildings.\" Congress reconvened and certified the election after the siege.\n"], "event2_pos": [3, 10], "ori_score": 35}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "695648a3-80a8-441e-a7ad-9a90e787ac38", "event1": "A large aftershock, including a magnitude 6.4 temblor occurring 12 minutes later, followed the initial earthquake.", "event1_order": 3, "event1_context": ["A 7.7 magnitude earthquake hit central Myanmar in Mandalay at 6.21am GMT, originating at a shallow depth of 10km. The earthquake caused buildings to collapse and roads to buckle in Myanmar and Thailand, resulting in a climbing death toll. The quake occurred due to strike-slip faulting on the Sagaing fault between the India and Eurasia plates. The Indian plate moved north along the fault compared to the Eurasian plate. The region has experienced similar large earthquakes in the past. The moment magnitude scale is used to measure the earthquake, which is logarithmic. A large aftershock occurred, and more are expected, posing challenges to rescuers. The China Earthquake Networks Center reported the earthquake reached 7.9 magnitude, with tremors felt in China's Yunnan province.\n", "A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n", "A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event1_pos": [3, 8, 9], "event2": "144 people were killed and 732 injured in Myanmar initially.", "event2_order": 7, "event2_context": ["A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event2_pos": [9], "ori_score": 38}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "0742f5ac-5ef4-45d0-a3a2-44f07189bd41", "event1": "Steve Davis, Emil Michael, Katie Miller, and Bill McGinley are appointed to leadership roles within DOGE.", "event1_order": 5, "event1_context": ["Elon Musk and Vivek Ramaswamy are sending representatives to federal agencies to conduct preliminary interviews aimed at reducing federal spending and regulations. These representatives are part of the \"Department of Government Efficiency\" (DOGE), which is tied to Donald Trump's transition team. Musk and Ramaswamy have hired over 50 staffers for DOGE, aiming for 100 by Trump's inauguration. DOGE faces obstacles including skepticism from congressional Republicans and civil servants. Musk has begun tempering his initial goal of cutting $2 trillion in federal spending. Trump named Musk and Ramaswamy as DOGE's co-leaders to identify government waste for the White House Office of Management and Budget to cut. DOGE has received numerous applications through X. Steve Davis is helping oversee the effort, and Emil Michael is overseeing regulation cuts. Katie Miller and Bill McGinley were also appointed to DOGE. Questions remain about DOGE's authority and responsibilities, and whether it has Trump's full backing.\n"], "event1_pos": [4], "event2": "Elon Musk begins tempering his initial goal of cutting $2 trillion in federal spending.", "event2_order": 7, "event2_context": ["Elon Musk and Vivek Ramaswamy are sending representatives to federal agencies to conduct preliminary interviews aimed at reducing federal spending and regulations. These representatives are part of the \"Department of Government Efficiency\" (DOGE), which is tied to Donald Trump's transition team. Musk and Ramaswamy have hired over 50 staffers for DOGE, aiming for 100 by Trump's inauguration. DOGE faces obstacles including skepticism from congressional Republicans and civil servants. Musk has begun tempering his initial goal of cutting $2 trillion in federal spending. Trump named Musk and Ramaswamy as DOGE's co-leaders to identify government waste for the White House Office of Management and Budget to cut. DOGE has received numerous applications through X. Steve Davis is helping oversee the effort, and Emil Michael is overseeing regulation cuts. Katie Miller and Bill McGinley were also appointed to DOGE. Questions remain about DOGE's authority and responsibilities, and whether it has Trump's full backing.\n"], "event2_pos": [4], "ori_score": 31}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "b25c3623-5d4d-45b8-a97a-fbbcbbb8fab7", "event1": "Mandalay General Hospital stopped admitting patients due to being full and lacking power and water.", "event1_order": 5, "event1_context": ["A 7.7-magnitude earthquake hit Myanmar on Friday, causing damage. The Mandalay General Hospital is full and no longer admitting patients, and is without power and water. The earthquake was caused by a rupture lasting a full minute, causing sideways movements. A seismologist compared the quake to one that struck Turkey in 2023, where over 55,000 people died. Bangkok is vulnerable to tremors due to its tall buildings.\n"], "event1_pos": [4], "event2": "A skyscraper under construction collapsed in Bangkok, Thailand, causing casualties and disruption of services.", "event2_order": 6, "event2_context": ["A 7.7 magnitude earthquake hit central Myanmar in Mandalay at 6.21am GMT, originating at a shallow depth of 10km. The earthquake caused buildings to collapse and roads to buckle in Myanmar and Thailand, resulting in a climbing death toll. The quake occurred due to strike-slip faulting on the Sagaing fault between the India and Eurasia plates. The Indian plate moved north along the fault compared to the Eurasian plate. The region has experienced similar large earthquakes in the past. The moment magnitude scale is used to measure the earthquake, which is logarithmic. A large aftershock occurred, and more are expected, posing challenges to rescuers. The China Earthquake Networks Center reported the earthquake reached 7.9 magnitude, with tremors felt in China's Yunnan province.\n", "A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n"], "event2_pos": [3, 8], "ori_score": 39}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "4933dc1d-eace-48bc-abd5-fc5caff53b37", "event1": "Elon Musk begins tempering his initial goal of cutting $2 trillion in federal spending.", "event1_order": 7, "event1_context": ["Elon Musk and Vivek Ramaswamy are sending representatives to federal agencies to conduct preliminary interviews aimed at reducing federal spending and regulations. These representatives are part of the \"Department of Government Efficiency\" (DOGE), which is tied to Donald Trump's transition team. Musk and Ramaswamy have hired over 50 staffers for DOGE, aiming for 100 by Trump's inauguration. DOGE faces obstacles including skepticism from congressional Republicans and civil servants. Musk has begun tempering his initial goal of cutting $2 trillion in federal spending. Trump named Musk and Ramaswamy as DOGE's co-leaders to identify government waste for the White House Office of Management and Budget to cut. DOGE has received numerous applications through X. Steve Davis is helping oversee the effort, and Emil Michael is overseeing regulation cuts. Katie Miller and Bill McGinley were also appointed to DOGE. Questions remain about DOGE's authority and responsibilities, and whether it has Trump's full backing.\n"], "event1_pos": [4], "event2": "Elon Musk uses his X platform to attack federal judges while leading DOGE.", "event2_order": 11, "event2_context": ["The live page closed. Coverage ended.\n"], "event2_pos": [3], "ori_score": 35}
{"topic_id": 6, "topic": "Trump re-elected as US President", "uuid": "3d06ad26-7999-4a6b-87e8-250e957b5478", "event1": "Donald Trump was found guilty on 34 felony charges in New York.", "event1_order": 1, "event1_context": ["Donald Trump was elected the 47th president after winning Wisconsin and securing over 270 electoral votes. His victory followed a campaign where he attacked Kamala Harris. Upon taking office, Trump will work with a Republican-controlled Senate. He vowed to reshape the government and pursue retribution. The election season included two assassination attempts targeting Trump. Harris rose to the top of the ticket after Biden exited the race. Trump is the first former president to return to power since Grover Cleveland, the first convicted of a felony to be elected president, and the oldest person elected president. Trump plans to enact a sweeping agenda. Democrats and some Republicans warned about shocks to democracy. Trump praised strongman leaders and suggested suspending the Constitution. During the campaign, a gunman opened fire at a Trump rally, and a second assassination attempt was thwarted. Trump faced state and federal indictments for his role in the insurrection, his handling of classified information, and election interference. He was found guilty on 34 felony charges in New York and liable in two civil cases. As president, he could erase federal charges against him. Trump plans a radical agenda, including a large deportation effort.\n"], "event1_pos": [2], "event2": "Trump sweeps swing states: Trump wins in seven swing states, including Arizona (November 9, 2024)", "event2_order": 6, "event2_context": ["US Election 2024: Trump sweeps all seven swing states, including Arizona, as races for the House of Representatives continue to be counted (November 9, 2024).\n", "Donald Trump won Arizona, securing its 11 electoral votes and completing a Republican sweep of swing states. This is Trump's second Arizona win since 2016, defeating Kamala Harris. Trump campaigned on border security and the economy. This victory diminishes Arizona Democrats' hopes after their recent successes. Trump's win marks a comeback to the White House. Voters' top concern was the economy and inflation. Trump also won the popular vote by a margin of around four million votes.\n"], "event2_pos": [4, 10], "ori_score": 25}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "3b78c067-2573-48d1-97c8-45f8118832d1", "event1": "Abe reinterpreted Japan's constitution in 2014, enabling military operations overseas.", "event1_order": 3, "event1_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event1_pos": [4], "event2": "Increased diplomacy between Japan and Israel, starting with Benjamin Netanyahu's visit to Tokyo in 2014.", "event2_order": 4, "event2_context": ["Shinzo Abe, former Japanese prime minister, was assassinated at a campaign rally. Abe was shot multiple times from behind while speaking at a rally in Nara. Abe, a nationalist, aimed to change Japan’s pacifist character. He increased diplomacy with Israel, starting with a 2014 visit to Tokyo by Benjamin Netanyahu, which increased trade. Abe offered to host a peace summit in 2017 and visited Jerusalem in 2018.\n"], "event2_pos": [10], "ori_score": 28}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "726d5e70-d0c0-4029-9d79-d05915b1e9ba", "event1": "A large aftershock, including a magnitude 6.4 temblor occurring 12 minutes later, followed the initial earthquake.", "event1_order": 3, "event1_context": ["A 7.7 magnitude earthquake hit central Myanmar in Mandalay at 6.21am GMT, originating at a shallow depth of 10km. The earthquake caused buildings to collapse and roads to buckle in Myanmar and Thailand, resulting in a climbing death toll. The quake occurred due to strike-slip faulting on the Sagaing fault between the India and Eurasia plates. The Indian plate moved north along the fault compared to the Eurasian plate. The region has experienced similar large earthquakes in the past. The moment magnitude scale is used to measure the earthquake, which is logarithmic. A large aftershock occurred, and more are expected, posing challenges to rescuers. The China Earthquake Networks Center reported the earthquake reached 7.9 magnitude, with tremors felt in China's Yunnan province.\n", "A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n", "A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event1_pos": [3, 8, 9], "event2": "Myanmar declared a state of emergency in six quake-affected areas.", "event2_order": 8, "event2_context": ["A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n", "A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event2_pos": [8, 9], "ori_score": 48}
{"topic_id": 2, "topic": "COVID-19 pandemic triggers global health crisis", "uuid": "c5091e3c-3efa-403d-92d0-c26dec5eee24", "event1": "Chinese authorities identified SARS-CoV-2 as the cause of the pneumonia cases approximately a week after the WHO notification.", "event1_order": 2, "event1_context": ["COVID-19, a respiratory infection caused by the SARS-CoV-2 virus, has created a global health crisis. The WHO was notified of unusual pneumonia cases in Wuhan City, China on Dec. 31. Chinese authorities identified SARS-CoV-2 as the cause a week later. The virus spread globally, causing many infections and deaths. Those severely ill often develop pneumonia and breathing difficulties, requiring ventilation. Public health authorities implemented measures to slow the virus's spread. Clinical trials are underway to test potential treatments and vaccines.\n"], "event1_pos": [2], "event2": "Experts advocated for systemic economic transformation, linking planetary crises like deforestation and climate change to increased pandemic risk and calling for investment in green infrastructure.", "event2_order": 6, "event2_context": ["The COVID-19 pandemic is threatening lives and economies and exposed humanity's capacity for rapid transformation. Experts advocate for systemic economic change. The pandemic forced lockdowns, terrified citizens, and triggered financial meltdown, demanding immediate response and long-term planning like the European Green Deal. COVID-19 reflects a trend of increasing planetary crises that existing economic models exacerbate, echoing warnings from the Club of Rome and Donella Meadows about exceeding Earth's limits. Interconnectedness means crises like COVID-19, climate change, and biodiversity loss require collective action. Deforestation, biodiversity loss, and climate change increase pandemic risk, highlighting the need to mitigate threats through green economies. Transformational changes are possible, and the crisis presents an opportunity to phase out fossil fuels, eliminate subsidies, and shift to regenerative agriculture. New economic models prioritize living within planetary boundaries, creating a \"safe and just operating space for all of humanity\" through investment in renewable energy and green infrastructure.\n"], "event2_pos": [1], "ori_score": 40}
{"topic_id": 10, "topic": "US imposes widespread trade tariffs after Trump's re-election", "uuid": "963702da-a059-4238-b1ef-e54efce637c3", "event1": "Navarro confirmed the planned Canadian tariff increase was canceled.", "event1_order": 4, "event1_context": ["1.  Trump planned to raise tariffs on Canadian steel and aluminum to 50% on Wednesday.\n2.  This followed Ontario's decision to tax electricity exports to the U.S. at 25%.\n3.  Doug Ford paused the surcharge after discussions with Howard Lutnick.\n4.  Navarro confirmed the tariff increase was canceled.\n5.  Ford's electricity export surcharge was retaliation for Trump's tariffs on Canadian imports.\n6.  Ford and Lutnick agreed to meet to discuss a trade agreement.\n7.  Trump announced the new tariffs on Truth Social.\n8.  Trump repeated calls for Canada to be absorbed into the U.S.\n9.  The Dow Jones Industrial Average fell after Trump's announcement.\n10. Ford vowed to keep his countermeasure in place and threatened to shut off energy supply.\n11. A senior administration official said the tariff order was \"in the works.\"\n12. Trump demanded Canada drop an \"Anti-American Farmer Tariff\".\n13. Trump warned about declaring a National Emergency on Electricity.\n14. Trump threatened to increase tariffs on auto imports on April 2.\n"], "event1_pos": [6], "event2": "The U.S. Embassy in China's Weibo account was flooded with angry comments expressing disappointment with U.S. policies.", "event2_order": 6, "event2_context": ["Chinese people are drawing parallels between the Trump administration and China's Cultural Revolution. They observe similarities such as the dismantling of institutions, the pursuit of power, and the rise of a cult of personality. They express alarm at the perceived erosion of democratic values in the U.S. and the use of propaganda-like language by U.S. government agencies. The U.S. Embassy in China's Weibo account has been flooded with angry comments expressing disappointment with U.S. policies. Comparisons are drawn between Trump's actions and those of authoritarian leaders, including Mao Zedong and Xi Jinping.\n"], "event2_pos": [9], "ori_score": 35}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "45b65bb6-4f4d-4f4f-aa8a-f918307c3973", "event1": "Trump supporters stormed the U.S. Capitol, clashing with police, breaching security barriers, and forcing entry.", "event1_order": 3, "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n", "President Trump told supporters to never accept defeat. Hundreds of his supporters then stormed the U.S. Capitol to overturn the election. A woman was shot and killed by Capitol Police. The mob bashed through Capitol doors and windows, halting the congressional certification of Joe Biden’s victory. Lawmakers were evacuated. Tear gas was fired. The Senate stopped its proceedings, and the House doors were closed. The D.C. National Guard was activated, and a citywide curfew was imposed. Four people died: one from gunfire and three from medical emergencies. Rioters broke windows and vandalized offices. Law enforcement in riot gear arrived at the Capitol. Biden condemned the assault. Trump told people to \"go home\" in a video. Twitter, Facebook and Instagram temporarily banned Trump. Lawmakers were escorted back to work after the mob was cleared. Federal agents investigated a truck with weapons and potential bombmaking material. Police arrested at least 52 people and discovered pipe bombs and molotov cocktails. A man was stabbed near Freedom Plaza.\n", "On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n", "On January 6th, Washington experienced a riot/insurrection during the joint session of Congress certifying the presidential victory. Attempts to overturn the November election failed. Congress confirmed Biden as president in the early hours of January 7th.\n", "Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n", "Trump's supporters stormed the U.S. Capitol, shattering windows and ransacking offices, while lawmakers huddled inside. The breach forced members to flee the House and Senate, delaying the electoral college vote count. Nancy Pelosi and Charles Schumer called for Trump's removal from office. Pro-Trump demonstrators rallied outside Los Angeles City Hall.\n", "On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n", "Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n", "Following the storming of the U.S. Capitol by Donald Trump's supporters during the Electoral College certification, the Texas Department of Public Safety closed the Texas State Capitol and surrounding grounds on Wednesday. The Capitol complex was closed to the public effective immediately, according to a statement attributed to Freeman Martin. The Texas Capitol had reopened to the public on Monday after being closed for months.\n"], "event1_pos": [1, 2, 3, 4, 5, 6, 7, 8, 9], "event2": "Congress confirmed Joe Biden as president in the early hours of January 7th.", "event2_order": 11, "event2_context": ["On January 6th, Washington experienced a riot/insurrection during the joint session of Congress certifying the presidential victory. Attempts to overturn the November election failed. Congress confirmed Biden as president in the early hours of January 7th.\n"], "event2_pos": [4], "ori_score": 70}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "8c986fef-6692-4648-8854-c429f0b1a05f", "event1": "Abe returned to office as prime minister in 2012.", "event1_order": 2, "event1_context": ["In the early 2000s, Shinzo Abe was the deputy chief cabinet secretary. In 2002, Abe handled arrangements for a summit between Junichiro Koizumi and Kim Jong Il in Pyongyang. In 2006, Abe became the youngest prime minister in postwar Japan. In 2012, Abe returned to office and later became the longest-serving prime minister. During his tenure, Abe implemented \"Abenomics,\" and the stock market increased but economic inequality widened. Yoshihide Suga succeeded Abe in September 2020. Abe met with Donald Trump and Vladimir Putin, and in 2014, he met with Xi Jinping. After his death, Abe was celebrated for strengthening the defense alliance with the United States. Abe wanted to revise the Japanese Constitution but died still pushing for it.\n"], "event1_pos": [6], "event2": "Abe outlined his vision for a 'free and open Indo-Pacific' in 2016.", "event2_order": 5, "event2_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event2_pos": [4], "ori_score": 56}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "61b92010-6908-435e-8289-2f6b0fa67c10", "event1": "DOGE begins recruiting over 50 staffers, aiming for 100 by Trump's inauguration.", "event1_order": 3, "event1_context": ["Elon Musk and Vivek Ramaswamy are sending representatives to federal agencies to conduct preliminary interviews aimed at reducing federal spending and regulations. These representatives are part of the \"Department of Government Efficiency\" (DOGE), which is tied to Donald Trump's transition team. Musk and Ramaswamy have hired over 50 staffers for DOGE, aiming for 100 by Trump's inauguration. DOGE faces obstacles including skepticism from congressional Republicans and civil servants. Musk has begun tempering his initial goal of cutting $2 trillion in federal spending. Trump named Musk and Ramaswamy as DOGE's co-leaders to identify government waste for the White House Office of Management and Budget to cut. DOGE has received numerous applications through X. Steve Davis is helping oversee the effort, and Emil Michael is overseeing regulation cuts. Katie Miller and Bill McGinley were also appointed to DOGE. Questions remain about DOGE's authority and responsibilities, and whether it has Trump's full backing.\n"], "event1_pos": [4], "event2": "DOGE plans for executives to perform six-month voluntary stints inside the federal government, working 80-hour weeks without pay.", "event2_order": 4, "event2_context": ["On the eve of Mr. Trump’s presidency, the structure of DOGE is amorphous and secretive. Mr. Trump stated DOGE would drive \"drastic change\" and advise on cutting wasteful spending, though DOGE lacks spending-cut authority. Executives involved are expected to do six-month voluntary stints inside the federal government, working 80-hour weeks without pay. Some, possibly including Mr. Musk, will be special government employees. Representatives will be stationed inside federal agencies. DOGE is unlikely to incorporate as an outside entity; it will likely exist as a brand for a group of leaders loyal to Mr. Musk or Mr. Ramaswamy.\n"], "event2_pos": [1], "ori_score": 73}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "f50f2ae0-2426-4cc9-a79a-1bc1fadc53d5", "event1": "Three former Elon Musk employees obtain top positions at the Office of Personnel Management (OPM).", "event1_order": 9, "event1_context": ["Elon Musk, a major Trump benefactor whose companies profit from government contracts, is increasingly embedded in the federal government. The Treasury Department's top civil servant, David Lebryk, left after Trump-affiliated officials from DOGE (Department of Government Efficiency) inquired about stopping federal payments, which Lebryk opposed. Musk advocates for reclaiming power from the \"unelected bureaucracy\" and pushes against taxpayer funding for NGOs. Three former Musk employees now hold top positions at the Office of Personnel Management (OPM), which offered federal workers buyouts, raising concerns about legality. These Musk allies are also present in agencies like the General Services Administration. Trump suggested federal workers would be fired if they didn't return to offices by a deadline. Musk may be sleeping at the Eisenhower Executive Office Building. Concerns are raised about potential conflicts of interest, and demands are made for transparency regarding Musk's role and DOGE participants. Trump's OPM director nominee is unconfirmed. Plans include mass firings and spending cuts, including potential Medicare scrutiny. A public plan or list of Musk allies within the government is lacking.\n"], "event1_pos": [8], "event2": "Elon Musk uses his X platform to attack federal judges while leading DOGE.", "event2_order": 11, "event2_context": ["The live page closed. Coverage ended.\n"], "event2_pos": [3], "ori_score": 55}
{"topic_id": 6, "topic": "Trump re-elected as US President", "uuid": "7570b08e-5298-409f-ae02-4e9d98b0a57d", "event1": "Trump sweeps swing states: Trump wins in seven swing states, including Arizona (November 9, 2024)", "event1_order": 6, "event1_context": ["US Election 2024: Trump sweeps all seven swing states, including Arizona, as races for the House of Representatives continue to be counted (November 9, 2024).\n", "Donald Trump won Arizona, securing its 11 electoral votes and completing a Republican sweep of swing states. This is Trump's second Arizona win since 2016, defeating Kamala Harris. Trump campaigned on border security and the economy. This victory diminishes Arizona Democrats' hopes after their recent successes. Trump's win marks a comeback to the White House. Voters' top concern was the economy and inflation. Trump also won the popular vote by a margin of around four million votes.\n"], "event1_pos": [4, 10], "event2": "Panelists discussed factors influencing the election, including polarization, economic disconnect, Trump's voter appeal, and information inconsistencies.", "event2_order": 8, "event2_context": ["Johns Hopkins held a virtual event, \"Insights and Impacts: Post-Election Debrief,\" on Nov. 7 to discuss the election's effects. Panelists included Leah Wright Rigueur, Soren Dayton, Lilliana Mason, and Eugene Scott, introduced by Amy Binder and moderated by Steven Teles. Rigueur noted polarization and Harris's disadvantages as factors. Key takeaways included the disconnect between the economy and people's feelings, Trump's success in attracting new voters (including Latino and Black voters, and some Muslim voters due to the Gaza conflict), and information inconsistencies (e.g., regarding reproductive rights and stimulus checks). Mason highlighted a global trend of incumbent candidates losing due to uncertainty and a move toward strong leaders. Panelists noted a shift in political parties, with the Republican base now largely working class. Trump's style was discussed, with some voters overlooking his idiosyncrasies due to economic concerns. Panelists also discussed that Trump's agenda and power would be limited even with Republican control of Congress. They advised against assuming the worst, citing instances where Trump failed to achieve campaign promises.\n"], "event2_pos": [3], "ori_score": 51}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "0bfbff3b-416b-4894-b223-5fe9a1794edd", "event1": "Three former Elon Musk employees obtain top positions at the Office of Personnel Management (OPM).", "event1_order": 9, "event1_context": ["Elon Musk, a major Trump benefactor whose companies profit from government contracts, is increasingly embedded in the federal government. The Treasury Department's top civil servant, David Lebryk, left after Trump-affiliated officials from DOGE (Department of Government Efficiency) inquired about stopping federal payments, which Lebryk opposed. Musk advocates for reclaiming power from the \"unelected bureaucracy\" and pushes against taxpayer funding for NGOs. Three former Musk employees now hold top positions at the Office of Personnel Management (OPM), which offered federal workers buyouts, raising concerns about legality. These Musk allies are also present in agencies like the General Services Administration. Trump suggested federal workers would be fired if they didn't return to offices by a deadline. Musk may be sleeping at the Eisenhower Executive Office Building. Concerns are raised about potential conflicts of interest, and demands are made for transparency regarding Musk's role and DOGE participants. Trump's OPM director nominee is unconfirmed. Plans include mass firings and spending cuts, including potential Medicare scrutiny. A public plan or list of Musk allies within the government is lacking.\n"], "event1_pos": [8], "event2": "President Trump suggests federal workers who do not return to offices by a deadline will be fired.", "event2_order": 10, "event2_context": ["Elon Musk, a major Trump benefactor whose companies profit from government contracts, is increasingly embedded in the federal government. The Treasury Department's top civil servant, David Lebryk, left after Trump-affiliated officials from DOGE (Department of Government Efficiency) inquired about stopping federal payments, which Lebryk opposed. Musk advocates for reclaiming power from the \"unelected bureaucracy\" and pushes against taxpayer funding for NGOs. Three former Musk employees now hold top positions at the Office of Personnel Management (OPM), which offered federal workers buyouts, raising concerns about legality. These Musk allies are also present in agencies like the General Services Administration. Trump suggested federal workers would be fired if they didn't return to offices by a deadline. Musk may be sleeping at the Eisenhower Executive Office Building. Concerns are raised about potential conflicts of interest, and demands are made for transparency regarding Musk's role and DOGE participants. Trump's OPM director nominee is unconfirmed. Plans include mass firings and spending cuts, including potential Medicare scrutiny. A public plan or list of Musk allies within the government is lacking.\n"], "event2_pos": [8], "ori_score": 55}
{"topic_id": 6, "topic": "Trump re-elected as US President", "uuid": "1a8c8d1c-f66b-4e9e-a947-d4d04b70e8bf", "event1": "Trump sweeps swing states: Trump wins in seven swing states, including Arizona (November 9, 2024)", "event1_order": 6, "event1_context": ["US Election 2024: Trump sweeps all seven swing states, including Arizona, as races for the House of Representatives continue to be counted (November 9, 2024).\n", "Donald Trump won Arizona, securing its 11 electoral votes and completing a Republican sweep of swing states. This is Trump's second Arizona win since 2016, defeating Kamala Harris. Trump campaigned on border security and the economy. This victory diminishes Arizona Democrats' hopes after their recent successes. Trump's win marks a comeback to the White House. Voters' top concern was the economy and inflation. Trump also won the popular vote by a margin of around four million votes.\n"], "event1_pos": [4, 10], "event2": "Panelists analyzed potential limits on Trump's agenda and power, even with Republican control of Congress.", "event2_order": 9, "event2_context": ["Johns Hopkins held a virtual event, \"Insights and Impacts: Post-Election Debrief,\" on Nov. 7 to discuss the election's effects. Panelists included Leah Wright Rigueur, Soren Dayton, Lilliana Mason, and Eugene Scott, introduced by Amy Binder and moderated by Steven Teles. Rigueur noted polarization and Harris's disadvantages as factors. Key takeaways included the disconnect between the economy and people's feelings, Trump's success in attracting new voters (including Latino and Black voters, and some Muslim voters due to the Gaza conflict), and information inconsistencies (e.g., regarding reproductive rights and stimulus checks). Mason highlighted a global trend of incumbent candidates losing due to uncertainty and a move toward strong leaders. Panelists noted a shift in political parties, with the Republican base now largely working class. Trump's style was discussed, with some voters overlooking his idiosyncrasies due to economic concerns. Panelists also discussed that Trump's agenda and power would be limited even with Republican control of Congress. They advised against assuming the worst, citing instances where Trump failed to achieve campaign promises.\n"], "event2_pos": [3], "ori_score": 51}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "c1dd2a94-094e-419f-88c7-97996e011508", "event1": "Mandalay General Hospital stopped admitting patients due to being full and lacking power and water.", "event1_order": 5, "event1_context": ["A 7.7-magnitude earthquake hit Myanmar on Friday, causing damage. The Mandalay General Hospital is full and no longer admitting patients, and is without power and water. The earthquake was caused by a rupture lasting a full minute, causing sideways movements. A seismologist compared the quake to one that struck Turkey in 2023, where over 55,000 people died. Bangkok is vulnerable to tremors due to its tall buildings.\n"], "event1_pos": [4], "event2": "The UN began mobilizing aid for Myanmar.", "event2_order": 11, "event2_context": ["An earthquake struck Myanmar, prompting a rare plea for international humanitarian aid from the military government. The military spokesman, Gen. Zaw Min Tun, stated their willingness to cooperate with the international community. Myanmar faces challenges in aid delivery due to its isolation since the 2021 coup and prior sanctions. The UN is mobilizing aid, but logistical hurdles remain due to the ongoing civil war. Michael Martin highlights security risks for aid workers and potential military interference, including preventing access to rebel areas and manipulating aid distribution. Stefan Dercon points out challenges in transferring funds and logistical complexities. Fundraising may also be difficult due to Myanmar's isolation. The extent of U.S. government aid is uncertain.\n"], "event2_pos": [5], "ori_score": 55}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "2c12907a-1892-432f-af92-50d5148b13eb", "event1": "DOGE initiates the dispatch of representatives to federal agencies to conduct preliminary interviews aimed at reducing federal spending and regulations.", "event1_order": 6, "event1_context": ["On the eve of Mr. Trump’s presidency, the structure of DOGE is amorphous and secretive. Mr. Trump stated DOGE would drive \"drastic change\" and advise on cutting wasteful spending, though DOGE lacks spending-cut authority. Executives involved are expected to do six-month voluntary stints inside the federal government, working 80-hour weeks without pay. Some, possibly including Mr. Musk, will be special government employees. Representatives will be stationed inside federal agencies. DOGE is unlikely to incorporate as an outside entity; it will likely exist as a brand for a group of leaders loyal to Mr. Musk or Mr. Ramaswamy.\n", "Elon Musk and Vivek Ramaswamy are sending representatives to federal agencies to conduct preliminary interviews aimed at reducing federal spending and regulations. These representatives are part of the \"Department of Government Efficiency\" (DOGE), which is tied to Donald Trump's transition team. Musk and Ramaswamy have hired over 50 staffers for DOGE, aiming for 100 by Trump's inauguration. DOGE faces obstacles including skepticism from congressional Republicans and civil servants. Musk has begun tempering his initial goal of cutting $2 trillion in federal spending. Trump named Musk and Ramaswamy as DOGE's co-leaders to identify government waste for the White House Office of Management and Budget to cut. DOGE has received numerous applications through X. Steve Davis is helping oversee the effort, and Emil Michael is overseeing regulation cuts. Katie Miller and Bill McGinley were also appointed to DOGE. Questions remain about DOGE's authority and responsibilities, and whether it has Trump's full backing.\n"], "event1_pos": [1, 4], "event2": "Three former Elon Musk employees obtain top positions at the Office of Personnel Management (OPM).", "event2_order": 9, "event2_context": ["Elon Musk, a major Trump benefactor whose companies profit from government contracts, is increasingly embedded in the federal government. The Treasury Department's top civil servant, David Lebryk, left after Trump-affiliated officials from DOGE (Department of Government Efficiency) inquired about stopping federal payments, which Lebryk opposed. Musk advocates for reclaiming power from the \"unelected bureaucracy\" and pushes against taxpayer funding for NGOs. Three former Musk employees now hold top positions at the Office of Personnel Management (OPM), which offered federal workers buyouts, raising concerns about legality. These Musk allies are also present in agencies like the General Services Administration. Trump suggested federal workers would be fired if they didn't return to offices by a deadline. Musk may be sleeping at the Eisenhower Executive Office Building. Concerns are raised about potential conflicts of interest, and demands are made for transparency regarding Musk's role and DOGE participants. Trump's OPM director nominee is unconfirmed. Plans include mass firings and spending cuts, including potential Medicare scrutiny. A public plan or list of Musk allies within the government is lacking.\n"], "event2_pos": [8], "ori_score": 69}
{"topic_id": 10, "topic": "US imposes widespread trade tariffs after Trump's re-election", "uuid": "caccbaf9-63f4-4626-9598-b5e9e1e006e2", "event1": "Trump planned to raise tariffs on Canadian steel and aluminum to 50%.", "event1_order": 2, "event1_context": ["1.  Trump planned to raise tariffs on Canadian steel and aluminum to 50% on Wednesday.\n2.  This followed Ontario's decision to tax electricity exports to the U.S. at 25%.\n3.  Doug Ford paused the surcharge after discussions with Howard Lutnick.\n4.  Navarro confirmed the tariff increase was canceled.\n5.  Ford's electricity export surcharge was retaliation for Trump's tariffs on Canadian imports.\n6.  Ford and Lutnick agreed to meet to discuss a trade agreement.\n7.  Trump announced the new tariffs on Truth Social.\n8.  Trump repeated calls for Canada to be absorbed into the U.S.\n9.  The Dow Jones Industrial Average fell after Trump's announcement.\n10. Ford vowed to keep his countermeasure in place and threatened to shut off energy supply.\n11. A senior administration official said the tariff order was \"in the works.\"\n12. Trump demanded Canada drop an \"Anti-American Farmer Tariff\".\n13. Trump warned about declaring a National Emergency on Electricity.\n14. Trump threatened to increase tariffs on auto imports on April 2.\n"], "event1_pos": [6], "event2": "New widespread tariffs began to take effect.", "event2_order": 10, "event2_context": ["President Trump announced new tariffs applying to most of the world. The plan includes a 10% \"base line\" tariff on nearly all U.S. imports (excluding Canada and Mexico) and a \"reciprocal\" tariff (1-40%, added to the 10% base) on 57 countries with allegedly unfair trade practices, calculated based on the U.S. trade deficit. The 10% tariffs will take effect on Saturday, the reciprocal rates the following Wednesday. Affected countries include China, Japan, Germany, India, South Korea, Taiwan, and Vietnam; European goods will face a 20 percent tariff, Japanese goods will face 24 percent and South Korean products 26 percent. Chinese exports face an extra 34 percent tariff, potentially reaching 79% on some products. Vietnam will face a 46 percent tariff. Trump aims to force companies to manufacture in the U.S., creating jobs. The tariffs will increase costs for importers, potentially passed on to consumers. The government anticipates increased revenue to channel into tax cuts. The announcement triggered a global stock market decline; retaliation from other countries is possible, potentially sparking trade wars. Analysts predict slower economic growth, higher consumer prices, and a risk of recession.\n"], "event2_pos": [2], "ori_score": 53}
{"topic_id": 10, "topic": "US imposes widespread trade tariffs after Trump's re-election", "uuid": "ed1da632-e36e-4388-8eb9-94592f6517d1", "event1": "Trump planned to raise tariffs on Canadian steel and aluminum to 50%.", "event1_order": 2, "event1_context": ["1.  Trump planned to raise tariffs on Canadian steel and aluminum to 50% on Wednesday.\n2.  This followed Ontario's decision to tax electricity exports to the U.S. at 25%.\n3.  Doug Ford paused the surcharge after discussions with Howard Lutnick.\n4.  Navarro confirmed the tariff increase was canceled.\n5.  Ford's electricity export surcharge was retaliation for Trump's tariffs on Canadian imports.\n6.  Ford and Lutnick agreed to meet to discuss a trade agreement.\n7.  Trump announced the new tariffs on Truth Social.\n8.  Trump repeated calls for Canada to be absorbed into the U.S.\n9.  The Dow Jones Industrial Average fell after Trump's announcement.\n10. Ford vowed to keep his countermeasure in place and threatened to shut off energy supply.\n11. A senior administration official said the tariff order was \"in the works.\"\n12. Trump demanded Canada drop an \"Anti-American Farmer Tariff\".\n13. Trump warned about declaring a National Emergency on Electricity.\n14. Trump threatened to increase tariffs on auto imports on April 2.\n"], "event1_pos": [6], "event2": "US Senate considered a bill to halt Trump's tariffs on Canadian imports.", "event2_order": 12, "event2_context": ["The US Senate will likely vote on a bill to halt Trump's tariffs on Canadian imports on Wednesday. This occurs as a reciprocal tariffs deadline looms and amid economic uncertainty.\n"], "event2_pos": [3], "ori_score": 70}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "494684ee-d2c3-4df3-b12e-62e7ac95949b", "event1": "Myanmar declared a state of emergency in six quake-affected areas.", "event1_order": 8, "event1_context": ["A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n", "A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event1_pos": [8, 9], "event2": "The UN began mobilizing aid for Myanmar.", "event2_order": 11, "event2_context": ["An earthquake struck Myanmar, prompting a rare plea for international humanitarian aid from the military government. The military spokesman, Gen. Zaw Min Tun, stated their willingness to cooperate with the international community. Myanmar faces challenges in aid delivery due to its isolation since the 2021 coup and prior sanctions. The UN is mobilizing aid, but logistical hurdles remain due to the ongoing civil war. Michael Martin highlights security risks for aid workers and potential military interference, including preventing access to rebel areas and manipulating aid distribution. Stefan Dercon points out challenges in transferring funds and logistical complexities. Fundraising may also be difficult due to Myanmar's isolation. The extent of U.S. government aid is uncertain.\n"], "event2_pos": [5], "ori_score": 71}
{"topic_id": 7, "topic": "South Korean President Yoon Suk-yeol faces impeachment crisis", "uuid": "d1c7adea-d136-445e-b866-989b586450f6", "event1": "Protest: Tens of thousands of South Korean protesters demonstrated near the National Assembly in Seoul, demanding President Yoon Suk Yeol's removal.", "event1_order": 5, "event1_context": ["Tens of thousands of South Korean protesters demonstrated near the National Assembly in Seoul, calling for President Yoon Suk Yeol's removal. Baek Jae Gil adapted \"Feliz Navidad\" into a protest anthem, \"Impeachment is the answer,\" and performed it outside the National Assembly after Yoon's declaration of martial law. The song spread online. Baek Jae Gil, a musician, has been protesting for decades, noting a shift toward more peaceful demonstrations. He was inspired by past protests, including those against President Park Geun-hye's impeachment. He wrote his \"Feliz Navidad\" adaptation in 2022 after protests grew following a crowd crush. He faced copyright issues with a satirical video earlier in the year. Last week, he performed his anthem at the National Assembly and again at last Saturday’s protests.\n", "Tens of thousands protested near South Korea's National Assembly, calling for President Yoon Suk Yeol's impeachment as lawmakers voted on the motion. The impeachment motion failed. Protests intensified following Yoon's declaration of martial law. A smaller group of Yoon's supporters gathered in Seoul.\n"], "event1_pos": [2, 8], "event2": "A second impeachment motion was filed against President Yoon in the National Assembly.", "event2_order": 9, "event2_context": ["President Yoon Suk-yeol faces a second impeachment motion in the National Assembly after declaring martial law on December 3, triggering protests. The motion requires 200 votes to pass. Some legislators from Yoon’s party support the motion. Yoon refuses to resign. If impeached, Yoon's powers will be suspended, and the prime minister will become acting president. The opposition is considering impeaching the Prime Minister as well, in which case the deputy prime minister for the economy would take over as acting president. The Constitutional Court will review the case; six of nine justices must support the motion for it to be upheld. Currently only six justices sit on the bench. The court must decide within 180 days. Yoon may argue martial law was within his powers. If the court upholds the impeachment, Yoon will be removed and an election will be held within 60 days. If rejected, Yoon will be reinstated. Yoon also faces criminal investigations, including charges of insurrection. Yoon could potentially be arrested.\n"], "event2_pos": [9], "ori_score": 68}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "1b57710a-a09e-4722-9d3e-1f8caa1ea715", "event1": "Congress confirmed Joe Biden as president in the early hours of January 7th.", "event1_order": 11, "event1_context": ["On January 6th, Washington experienced a riot/insurrection during the joint session of Congress certifying the presidential victory. Attempts to overturn the November election failed. Congress confirmed Biden as president in the early hours of January 7th.\n"], "event1_pos": [4], "event2": "Nancy Pelosi and Charles Schumer called for Trump's removal from office.", "event2_order": 12, "event2_context": ["Trump's supporters stormed the U.S. Capitol, shattering windows and ransacking offices, while lawmakers huddled inside. The breach forced members to flee the House and Senate, delaying the electoral college vote count. Nancy Pelosi and Charles Schumer called for Trump's removal from office. Pro-Trump demonstrators rallied outside Los Angeles City Hall.\n"], "event2_pos": [6], "ori_score": 58}
{"topic_id": 2, "topic": "COVID-19 pandemic triggers global health crisis", "uuid": "dda1d502-fc64-41ba-b7ac-1dc322597de1", "event1": "Businesses laid off workers, households struggled with food, and international investment fled emerging markets, leading to widespread economic hardship.", "event1_order": 9, "event1_context": ["The coronavirus pandemic halts the global economy, intensifying harm in vulnerable countries. In New Delhi, a fruit vendor dilutes milk for her children due to halved sales. In Turkey, a hot air balloon company puts 49 employees on indefinite leave and halves their wages. In Manila, a cruise line bartender is stranded at home, concerned about his savings. In Johannesburg, a hair braider goes home empty-handed. In Buenos Aires, a cabdriver fears contracting coronavirus and losing his taxi due to lack of fares. Businesses are laying off workers, and households are skimping on food. International investment is fleeing emerging markets, diminishing currencies and increasing import costs.\n"], "event1_pos": [6], "event2": "Lockdowns led to increased domestic violence, hunger, and suicide (victims, abusers, economically vulnerable populations).", "event2_order": 14, "event2_context": ["SARS-CoV-2 infections caused the COVID-19 pandemic, resulting in over 3.24 million deaths by May 6, 2021. Lockdowns, while intended to curb the virus's spread, led to increased domestic violence, hunger due to economic factors, suicide linked to depression, and an exhausted healthcare system, indirectly increasing deaths. Lockdowns exacerbated domestic violence due to increased time with abusers and economic crises. Increased food prices and obstructed agricultural processes led to food shortages, malnutrition, and deaths. Economic hardship, social isolation and mental health issues increased suicide rates. Healthcare system strain from prioritizing COVID-19 patients led to reduced services for other conditions and subsequent deaths. Solutions include strengthening online support for domestic violence victims, providing food and economic recovery aid to combat hunger, mental health education and financial security to reduce suicide, and balancing COVID-19 response with continuous delivery of other health services.\n"], "event2_pos": [9], "ori_score": 73}
{"topic_id": 1, "topic": "UK holds Brexit referendum, decides to leave EU", "uuid": "81c348f5-08be-42eb-8184-791ec5a96bb3", "event1": "Prime Minister David Cameron pledged a referendum on EU membership in 2013 if his Conservative Party won the next election.", "event1_order": 1, "event1_context": ["On June 23, U.K. citizens will vote on whether the United Kingdom should remain in or leave the European Union (EU). In 2013, Prime Minister David Cameron pledged a referendum on EU membership if his Conservative Party won the next election. The party won, and the referendum date was set in February. Cameron's attempt to renegotiate the U.K.'s EU membership terms failed, leading to the \"Brexit\" campaign. The nation divided into \"remain\" and \"leave\" camps. The EU has 28 member states and represents a large economic output. Member nations contribute to the EU budget. EU initiatives have funded projects in the U.K. The EU ensures the free movement of people, goods, services, and money within its single market. Polls show a close split in public opinion. Registration for the referendum caused the government website to crash and spurred an extension of the initial deadline. A transition out of the EU could take years if U.K. citizens vote \"leave\".\n"], "event1_pos": [5], "event2": "Sinn Fein called for a referendum on unification with Ireland.", "event2_order": 8, "event2_context": ["U.K. voters decided to leave the European Union, leading Prime Minister Cameron to announce his resignation. The EU referendum vote was 52 percent in favor of leaving. Northern Ireland and Scotland voted to remain, raising the possibility of the United Kingdom breaking apart. Cameron said the country requires fresh leadership and will resign before October. The process of leaving the EU will likely take years. The British pound plunged in value, and global stock markets plummeted. The referendum's outcome came as a shock to many. Sinn Fein called for a referendum on unification with Ireland. Scotland may hold a second referendum on independence. The EU assembly will hold an emergency session. Eurosceptic parties in Sweden, Denmark, and France called for EU membership referenda in their own nations. The Dow dropped approximately 500 points. Trump stated that the \"place is going wild over the vote. They took their country back, just like we will take America back.\" Obama stated \"the people of the United Kingdom have spoken, and we respect their decision.\"\n"], "event2_pos": [2], "ori_score": 65}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "uuid": "ca193e29-3cea-4015-b532-7868000e5b80", "event1": "The United States Digital Service is taken over and rebranded as United States DOGE Service.", "event1_order": 2, "event1_context": ["Trump's plan to retool the federal government initially involved billionaires Lutnick, Musk, and Ramaswamy. Lutnick was to run the Commerce Department. Ramaswamy stepped aside before Trump assumed office. Musk now leads the federal cost-cutting effort. The project started with the takeover of the United States Digital Service, renamed United States DOGE Service, which was created in 2014 to fix failing computer systems.\n"], "event1_pos": [10], "event2": "President Trump suggests federal workers who do not return to offices by a deadline will be fired.", "event2_order": 10, "event2_context": ["Elon Musk, a major Trump benefactor whose companies profit from government contracts, is increasingly embedded in the federal government. The Treasury Department's top civil servant, David Lebryk, left after Trump-affiliated officials from DOGE (Department of Government Efficiency) inquired about stopping federal payments, which Lebryk opposed. Musk advocates for reclaiming power from the \"unelected bureaucracy\" and pushes against taxpayer funding for NGOs. Three former Musk employees now hold top positions at the Office of Personnel Management (OPM), which offered federal workers buyouts, raising concerns about legality. These Musk allies are also present in agencies like the General Services Administration. Trump suggested federal workers would be fired if they didn't return to offices by a deadline. Musk may be sleeping at the Eisenhower Executive Office Building. Concerns are raised about potential conflicts of interest, and demands are made for transparency regarding Musk's role and DOGE participants. Trump's OPM director nominee is unconfirmed. Plans include mass firings and spending cuts, including potential Medicare scrutiny. A public plan or list of Musk allies within the government is lacking.\n"], "event2_pos": [8], "ori_score": 66}
{"topic_id": 10, "topic": "US imposes widespread trade tariffs after Trump's re-election", "uuid": "e2991e73-17e4-481e-87a7-9b27232111dd", "event1": "China, Canada, and Mexico imposed retaliatory tariffs in response to Trump's tariffs.", "event1_order": 8, "event1_context": ["Prior to last year's American election, voters frequently cited \"the economy\" as their top motivator. Now, eight weeks into Trump's presidency, \"chaos\", \"uncertainty\" and a possible \"recession\" are dominating economic discussions due to Trump's tariffs policy. Trump is using tariffs to advance his \"America First\" trade policy and to pressure world leaders. Tariffs were placed on aluminium and steel, angering Australia. Trump imposed tariffs on Colombia when its president refused to accept deportees, leading to the country's compliance. Trump has complained about uneven trade relationships with China, Canada, and Mexico, using tariffs to address trade deficits, fentanyl smuggling and illegal immigration. China responded with retaliatory tariffs, while Canada and Mexico initially toughened border controls. Trump postponed, then implemented tariffs on Canada and Mexico, leading to accusations of crippling Canada's economy. Canada, China and Mexico have imposed retaliatory tariffs. Investor uncertainty and tariff-fuelled recession fears have caused American stocks to decline. Some businesses are increasing prices, and significant price increases are expected on European alcohol. Consumer sentiment crashed, with a University of Michigan survey showing an 11% drop in a month. A Reuters/Ipsos poll indicated that 70% of Americans expect tariffs to increase consumer prices. Trump remains unfazed, viewing tariffs as a long-term project to benefit America.\n"], "event1_pos": [10], "event2": "US Senate considered a bill to halt Trump's tariffs on Canadian imports.", "event2_order": 12, "event2_context": ["The US Senate will likely vote on a bill to halt Trump's tariffs on Canadian imports on Wednesday. This occurs as a reciprocal tariffs deadline looms and amid economic uncertainty.\n"], "event2_pos": [3], "ori_score": 76}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "4a687146-dbb5-4098-bfc2-5a9a431c993b", "event1": "Congress confirmed Joe Biden as president in the early hours of January 7th.", "event1_order": 11, "event1_context": ["On January 6th, Washington experienced a riot/insurrection during the joint session of Congress certifying the presidential victory. Attempts to overturn the November election failed. Congress confirmed Biden as president in the early hours of January 7th.\n"], "event1_pos": [4], "event2": "Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned.", "event2_order": 13, "event2_context": ["Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n"], "event2_pos": [5], "ori_score": 53}
{"topic_id": 4, "topic": "Former Japanese PM Shinzo Abe assassinated", "uuid": "91c55027-abbe-4684-b9a0-de1d2b54b82f", "event1": "Abe became prime minister of Japan in 2006.", "event1_order": 1, "event1_context": ["In the early 2000s, Shinzo Abe was the deputy chief cabinet secretary. In 2002, Abe handled arrangements for a summit between Junichiro Koizumi and Kim Jong Il in Pyongyang. In 2006, Abe became the youngest prime minister in postwar Japan. In 2012, Abe returned to office and later became the longest-serving prime minister. During his tenure, Abe implemented \"Abenomics,\" and the stock market increased but economic inequality widened. Yoshihide Suga succeeded Abe in September 2020. Abe met with Donald Trump and Vladimir Putin, and in 2014, he met with Xi Jinping. After his death, Abe was celebrated for strengthening the defense alliance with the United States. Abe wanted to revise the Japanese Constitution but died still pushing for it.\n"], "event1_pos": [6], "event2": "Abe outlined his vision for a 'free and open Indo-Pacific' in 2016.", "event2_order": 5, "event2_context": ["Shinzo Abe recognized China's challenge to the American-led system and aimed to counter it. He reinterpreted Japan's constitution in 2014 to allow the military to operate overseas and equipped it accordingly. Abe coined the phrase \"a free and open Indo-Pacific\" to shift the focus from the \"Asia-Pacific\" concept centered on China. This involved including India as a counterweight and emphasizing the South China Sea. He promoted the Quadrilateral Security Dialogue (Quad) between Japan, India, the US, and Australia, facing pushback from China. Abe outlined his vision for a \"free and open Indo-Pacific\" in 2016, based on the rule of law, economic prosperity, and peace. The Quad was reborn, and the US adopted the \"free and open Indo-Pacific\" concept. After Abe's death, tributes highlighted his influence, particularly his restructuring of Japan's foreign policy in response to China's rise. The phrase \"a free and open Indo-Pacific\" is now prevalent in US policy and military statements.\n"], "event2_pos": [4], "ori_score": 50}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "ccd536ad-1328-4a6a-9d8f-51c771f10a80", "event1": "A magnitude 7.7 (or 7.9) earthquake struck central Myanmar, near Sagaing and Mandalay, on March 28, 2025, at approximately 06:20 UTC (12:50 LT/Yangon time).", "event1_order": 1, "event1_context": ["On March 28, 2025, a M7.7 earthquake hit Myanmar at 06:20 UTC, followed by a M6.7 aftershock 12 minutes later. The epicenter was near Sagaing and Mandalay. Violent shaking was felt by millions, and the USGS issued a Red alert, predicting high casualties and extensive damage. Liquefaction and landslides were triggered. Buildings collapsed in Mandalay and roads buckled in Naypyidaw. Over 1,000 deaths and 2,400 injuries were reported initially. National phone and internet infrastructure was disrupted. Approximately 2,970 residential buildings, 150 religious structures, 30 roads, and 7 bridges were destroyed or severely damaged. Many mosques and monasteries collapsed, resulting in deaths during prayer time and trapping monks. Mandalay was severely affected, with at least 674 deaths and over 1,000 missing and more than half of the city’s buildings severely damaged or destroyed. Significant damage occurred to Mandalay University, the Dokhtawaddy Bridge, Mandalay Palace and Sagaing Township experienced widespread structural failure. In Naypyidaw, 204 fatalities were confirmed, with damage to government buildings and the airport control tower. In Shan State, at least 60 deaths were reported. In Bago Region, school and shelter collapses caused fatalities. Yangon experienced limited damage. In Thailand, at least 10 people were killed, 68 injured and 90 missing, with building collapses in Bangkok and suspension of transit and trading. On March 31, the death toll rose to over 2,900 in Myanmar and 18 in Thailand. By April 3, the death toll reached 4,390 in Myanmar and 36 in Thailand, with over 5,490 injured and hundreds missing. States of emergency were declared.\n", "A 7.7 magnitude earthquake hit central Myanmar in Mandalay at 6.21am GMT, originating at a shallow depth of 10km. The earthquake caused buildings to collapse and roads to buckle in Myanmar and Thailand, resulting in a climbing death toll. The quake occurred due to strike-slip faulting on the Sagaing fault between the India and Eurasia plates. The Indian plate moved north along the fault compared to the Eurasian plate. The region has experienced similar large earthquakes in the past. The moment magnitude scale is used to measure the earthquake, which is logarithmic. A large aftershock occurred, and more are expected, posing challenges to rescuers. The China Earthquake Networks Center reported the earthquake reached 7.9 magnitude, with tremors felt in China's Yunnan province.\n", "A 7.7-magnitude earthquake hit Myanmar on Friday, causing damage. The Mandalay General Hospital is full and no longer admitting patients, and is without power and water. The earthquake was caused by a rupture lasting a full minute, causing sideways movements. A seismologist compared the quake to one that struck Turkey in 2023, where over 55,000 people died. Bangkok is vulnerable to tremors due to its tall buildings.\n", "An earthquake struck Myanmar, prompting a rare plea for international humanitarian aid from the military government. The military spokesman, Gen. Zaw Min Tun, stated their willingness to cooperate with the international community. Myanmar faces challenges in aid delivery due to its isolation since the 2021 coup and prior sanctions. The UN is mobilizing aid, but logistical hurdles remain due to the ongoing civil war. Michael Martin highlights security risks for aid workers and potential military interference, including preventing access to rebel areas and manipulating aid distribution. Stefan Dercon points out challenges in transferring funds and logistical complexities. Fundraising may also be difficult due to Myanmar's isolation. The extent of U.S. government aid is uncertain.\n", "A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n", "A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event1_pos": [2, 3, 4, 5, 8, 9], "event2": "Death toll rose to 4,390 in Myanmar and 36 in Thailand by April 3, following the earthquake on March 28, 2025.", "event2_order": 12, "event2_context": ["On March 28, 2025, a M7.7 earthquake hit Myanmar at 06:20 UTC, followed by a M6.7 aftershock 12 minutes later. The epicenter was near Sagaing and Mandalay. Violent shaking was felt by millions, and the USGS issued a Red alert, predicting high casualties and extensive damage. Liquefaction and landslides were triggered. Buildings collapsed in Mandalay and roads buckled in Naypyidaw. Over 1,000 deaths and 2,400 injuries were reported initially. National phone and internet infrastructure was disrupted. Approximately 2,970 residential buildings, 150 religious structures, 30 roads, and 7 bridges were destroyed or severely damaged. Many mosques and monasteries collapsed, resulting in deaths during prayer time and trapping monks. Mandalay was severely affected, with at least 674 deaths and over 1,000 missing and more than half of the city’s buildings severely damaged or destroyed. Significant damage occurred to Mandalay University, the Dokhtawaddy Bridge, Mandalay Palace and Sagaing Township experienced widespread structural failure. In Naypyidaw, 204 fatalities were confirmed, with damage to government buildings and the airport control tower. In Shan State, at least 60 deaths were reported. In Bago Region, school and shelter collapses caused fatalities. Yangon experienced limited damage. In Thailand, at least 10 people were killed, 68 injured and 90 missing, with building collapses in Bangkok and suspension of transit and trading. On March 31, the death toll rose to over 2,900 in Myanmar and 18 in Thailand. By April 3, the death toll reached 4,390 in Myanmar and 36 in Thailand, with over 5,490 injured and hundreds missing. States of emergency were declared.\n"], "event2_pos": [2], "ori_score": 96}
{"topic_id": 7, "topic": "South Korean President Yoon Suk-yeol faces impeachment crisis", "uuid": "86263c1d-30f1-421e-98e9-7ce7b2b16533", "event1": "Yoon declared martial law on December 3, triggering protests.", "event1_order": 1, "event1_context": ["President Yoon Suk Yeol declared martial law, accusing the opposition of undermining the democratic system. The martial-law command suspended the legislature and controlled the media. Opposition parties and leaders of the ruling party denounced the action. Lawmakers unanimously annulled martial law. Protesters gathered, and some blocked soldiers from entering parliament. The U.S. and UK issued travel advisories. Opposition parties filed a motion to impeach President Yoon. Yoon's aides offered to resign. The U.S. stated that ending martial law was a crucial step.\n", "South Korean legislators launched an impeachment push against President Yoon Suk Yeol, accusing him of declaring martial law to evade investigations into himself and his family. Lawmakers overturned Yoon's martial law declaration, tussling with troops to enter the National Assembly and vote it down. Opposition legislators filed an impeachment motion accusing Yoon of violating the constitution and law with the martial law imposition. Lawmakers presented the impeachment motion to parliament. The governing People Power Party opposes the motion, but the opposition Democratic Party needs some governing party support to pass it. Impeachment requires a two-thirds majority. The governing party leader called for accountability and demanded an explanation from the president. If impeached, Yoon will be temporarily stripped of presidential authority. Several senior officials offered their resignations. Prime Minister Han Duck-soo pledged to continue serving. The Korean Confederation of Trade Unions called for a strike until Yoon's resignation. Yoon lifted the martial law order hours after the initial declaration, claiming it was necessary to defend against North Korean threats and accusing the opposition of paralyzing the government. Lawmakers passed a motion forcing Yoon to reverse the order after tussling with soldiers to enter parliament. A Democratic Party leader accused Yoon of treason.\n", "Tens of thousands protested near South Korea's National Assembly, calling for President Yoon Suk Yeol's impeachment as lawmakers voted on the motion. The impeachment motion failed. Protests intensified following Yoon's declaration of martial law. A smaller group of Yoon's supporters gathered in Seoul.\n", "President Yoon Suk-yeol faces a second impeachment motion in the National Assembly after declaring martial law on December 3, triggering protests. The motion requires 200 votes to pass. Some legislators from Yoon’s party support the motion. Yoon refuses to resign. If impeached, Yoon's powers will be suspended, and the prime minister will become acting president. The opposition is considering impeaching the Prime Minister as well, in which case the deputy prime minister for the economy would take over as acting president. The Constitutional Court will review the case; six of nine justices must support the motion for it to be upheld. Currently only six justices sit on the bench. The court must decide within 180 days. Yoon may argue martial law was within his powers. If the court upholds the impeachment, Yoon will be removed and an election will be held within 60 days. If rejected, Yoon will be reinstated. Yoon also faces criminal investigations, including charges of insurrection. Yoon could potentially be arrested.\n"], "event1_pos": [3, 4, 8, 9], "event2": "Lawmakers overturned President Yoon's martial law declaration after tussling with troops to enter the National Assembly.", "event2_order": 4, "event2_context": ["President Yoon Suk Yeol declared martial law, accusing the opposition of undermining the democratic system. The martial-law command suspended the legislature and controlled the media. Opposition parties and leaders of the ruling party denounced the action. Lawmakers unanimously annulled martial law. Protesters gathered, and some blocked soldiers from entering parliament. The U.S. and UK issued travel advisories. Opposition parties filed a motion to impeach President Yoon. Yoon's aides offered to resign. The U.S. stated that ending martial law was a crucial step.\n", "South Korean legislators launched an impeachment push against President Yoon Suk Yeol, accusing him of declaring martial law to evade investigations into himself and his family. Lawmakers overturned Yoon's martial law declaration, tussling with troops to enter the National Assembly and vote it down. Opposition legislators filed an impeachment motion accusing Yoon of violating the constitution and law with the martial law imposition. Lawmakers presented the impeachment motion to parliament. The governing People Power Party opposes the motion, but the opposition Democratic Party needs some governing party support to pass it. Impeachment requires a two-thirds majority. The governing party leader called for accountability and demanded an explanation from the president. If impeached, Yoon will be temporarily stripped of presidential authority. Several senior officials offered their resignations. Prime Minister Han Duck-soo pledged to continue serving. The Korean Confederation of Trade Unions called for a strike until Yoon's resignation. Yoon lifted the martial law order hours after the initial declaration, claiming it was necessary to defend against North Korean threats and accusing the opposition of paralyzing the government. Lawmakers passed a motion forcing Yoon to reverse the order after tussling with soldiers to enter parliament. A Democratic Party leader accused Yoon of treason.\n"], "event2_pos": [3, 4], "ori_score": 93}
{"topic_id": 5, "topic": "Elon Musk acquires Twitter, implements major reforms", "uuid": "a019317d-64c4-4989-9624-1b8a370f2091", "event1": "Elon Musk acquired Twitter for $44 billion.", "event1_order": 3, "event1_context": ["Elon Musk, prior to finalizing his purchase of Twitter, tweeted his dislike of advertising. After acquiring Twitter, Musk tweeted he aims to make it \"the most respected advertising platform.\" He bought the company to prevent social media from splintering into echo chambers. He reassured advertisers about brand safety, promising a platform following regulations and welcoming to all, but made no promises about content moderation. Bob Hoffman stated advertisers are unclear if Musk will be a free-speech absolutist or savvy businessman, and advertisers will leave if Twitter becomes a haven for problematic content. General Motors suspended advertising on Twitter to understand the platform's direction under new ownership. Advertising executives worried about Musk's free speech stance placing ads near hate speech. Some clients indicated pausing business to evaluate options, while others may leave if Donald Trump's account is reinstated. Arun Kumar stated advertisers still share concerns about content moderation. Musk's message made clear he doesn't want advertisers to leave. HBO will assess the platform under Musk's leadership. Twitter's advertising sales have been increasing, totaling $2.18 billion in the first half of the year.\n", "Musk took over Twitter, stating \"the bird is freed.\" Users fear the buyout will degrade the platform after improvements to functionality, policies, and moderation. Musk plans sweeping policy changes, including loosening speech rules and user authentication requirements. Musk fired top executives, including Vijaya Gadde. Gadde's legal team made policy strides protecting vulnerable users. Musk intends to roll back some of Twitter's rules and cut back on efforts to fight misinformation, which could impact civic engagement during upcoming elections.\n", "Elon Musk completed his $44 billion takeover of Twitter and fired CEO Parag Agrawal, CFO Ned Segal, and general counsel Vijaya Gadde. Musk denied planning to cut 75% of Twitter staff. Musk stated his reasons for acquiring Twitter were to have a common digital town square. Musk plans to allow previously suspended accounts, including Donald Trump's, back on the platform. Musk aims to create \"X, the everything app,\". Erik Gordon suggests Musk will take the company private and that Twitter will owe at least a billion dollars annually on about $13 billion in new debt. The Online Safety Bill in the UK may force Musk to soften his stance on absolute free speech.\n", "Elon Musk took control of Twitter, ousting CEO Parag Agrawal, CFO Ned Segal, and Chief Legal Counsel Vijaya Gadde. These departures occurred before a court-imposed deadline to finalize the acquisition. Musk addressed concerns from advertisers, emphasizing his goal to improve humanity and prevent Twitter from becoming a \"free-for-all hellscape.\" He assured advertisers he wants Twitter to be \"the most respected advertising platform in the world.\" Musk's plans include increasing Twitter's subscriber base and revenue, and he signaled potential changes to content moderation policies and advertising strategies. Trading in Twitter shares was suspended on the New York Stock Exchange in anticipation of the company going private.\n"], "event1_pos": [2, 3, 5, 9], "event2": "Elon Musk reinstated previously suspended accounts, including Donald Trump's, under a 'general amnesty'.", "event2_order": 7, "event2_context": ["Since late October, Elon Musk has significantly altered Twitter. On December 20, Musk confirmed he will step down as CEO once a replacement is found, eventually managing software and servers, following a Twitter poll where a majority favored his departure. Musk's leadership has led to staff reductions, including key engineering roles, raising concerns about site stability. Advertisers are reportedly leaving due to concerns about increased hate speech. Musk's check mark system caused issues with fake accounts. After Musk took over there was a notable surge in hate speech on the app. Musk has suspended journalist accounts, drawing criticism. Musk stated bankruptcy was possible if Twitter doesn't become profitable.\n\nMusk reinstated suspended accounts, including Donald Trump's. He offered \"general amnesty\" to suspended accounts, raising concerns about hate speech. Musk fired top executives and laid off a large portion of Twitter's staff. Some laid-off employees were asked to return. Musk issued an ultimatum for employees to work harder or quit. Many employees resigned.\n\nMusk ended Twitter’s remote-work policy and has drastically ramped up the pace at which new features are developed. Musk introduced paid blue check marks, leading to impersonation issues and criticism. He suspended accounts impersonating him and delayed the relaunch of the service.\n\nMusk's free speech stance has been celebrated by some but has also led to an increase in hateful speech. Advertisers paused spending due to brand safety concerns. Civil rights groups criticized Musk. User accounts were deactivated after Musk's takeover. Musk is considering entering the payments business and other changes to the platform.\n", "Elon Musk completed his $44 billion takeover of Twitter and fired CEO Parag Agrawal, CFO Ned Segal, and general counsel Vijaya Gadde. Musk denied planning to cut 75% of Twitter staff. Musk stated his reasons for acquiring Twitter were to have a common digital town square. Musk plans to allow previously suspended accounts, including Donald Trump's, back on the platform. Musk aims to create \"X, the everything app,\". Erik Gordon suggests Musk will take the company private and that Twitter will owe at least a billion dollars annually on about $13 billion in new debt. The Online Safety Bill in the UK may force Musk to soften his stance on absolute free speech.\n"], "event2_pos": [4, 9], "ori_score": 88}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "2ff8a71f-080e-4974-a3d4-ae617dee0108", "event1": "A magnitude 7.7 (or 7.9) earthquake struck central Myanmar, near Sagaing and Mandalay, on March 28, 2025, at approximately 06:20 UTC (12:50 LT/Yangon time).", "event1_order": 1, "event1_context": ["On March 28, 2025, a M7.7 earthquake hit Myanmar at 06:20 UTC, followed by a M6.7 aftershock 12 minutes later. The epicenter was near Sagaing and Mandalay. Violent shaking was felt by millions, and the USGS issued a Red alert, predicting high casualties and extensive damage. Liquefaction and landslides were triggered. Buildings collapsed in Mandalay and roads buckled in Naypyidaw. Over 1,000 deaths and 2,400 injuries were reported initially. National phone and internet infrastructure was disrupted. Approximately 2,970 residential buildings, 150 religious structures, 30 roads, and 7 bridges were destroyed or severely damaged. Many mosques and monasteries collapsed, resulting in deaths during prayer time and trapping monks. Mandalay was severely affected, with at least 674 deaths and over 1,000 missing and more than half of the city’s buildings severely damaged or destroyed. Significant damage occurred to Mandalay University, the Dokhtawaddy Bridge, Mandalay Palace and Sagaing Township experienced widespread structural failure. In Naypyidaw, 204 fatalities were confirmed, with damage to government buildings and the airport control tower. In Shan State, at least 60 deaths were reported. In Bago Region, school and shelter collapses caused fatalities. Yangon experienced limited damage. In Thailand, at least 10 people were killed, 68 injured and 90 missing, with building collapses in Bangkok and suspension of transit and trading. On March 31, the death toll rose to over 2,900 in Myanmar and 18 in Thailand. By April 3, the death toll reached 4,390 in Myanmar and 36 in Thailand, with over 5,490 injured and hundreds missing. States of emergency were declared.\n", "A 7.7 magnitude earthquake hit central Myanmar in Mandalay at 6.21am GMT, originating at a shallow depth of 10km. The earthquake caused buildings to collapse and roads to buckle in Myanmar and Thailand, resulting in a climbing death toll. The quake occurred due to strike-slip faulting on the Sagaing fault between the India and Eurasia plates. The Indian plate moved north along the fault compared to the Eurasian plate. The region has experienced similar large earthquakes in the past. The moment magnitude scale is used to measure the earthquake, which is logarithmic. A large aftershock occurred, and more are expected, posing challenges to rescuers. The China Earthquake Networks Center reported the earthquake reached 7.9 magnitude, with tremors felt in China's Yunnan province.\n", "A 7.7-magnitude earthquake hit Myanmar on Friday, causing damage. The Mandalay General Hospital is full and no longer admitting patients, and is without power and water. The earthquake was caused by a rupture lasting a full minute, causing sideways movements. A seismologist compared the quake to one that struck Turkey in 2023, where over 55,000 people died. Bangkok is vulnerable to tremors due to its tall buildings.\n", "An earthquake struck Myanmar, prompting a rare plea for international humanitarian aid from the military government. The military spokesman, Gen. Zaw Min Tun, stated their willingness to cooperate with the international community. Myanmar faces challenges in aid delivery due to its isolation since the 2021 coup and prior sanctions. The UN is mobilizing aid, but logistical hurdles remain due to the ongoing civil war. Michael Martin highlights security risks for aid workers and potential military interference, including preventing access to rebel areas and manipulating aid distribution. Stefan Dercon points out challenges in transferring funds and logistical complexities. Fundraising may also be difficult due to Myanmar's isolation. The extent of U.S. government aid is uncertain.\n", "A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n", "A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event1_pos": [2, 3, 4, 5, 8, 9], "event2": "Myanmar declared a state of emergency in six quake-affected areas.", "event2_order": 8, "event2_context": ["A 7.7 magnitude earthquake struck Myanmar, followed by multiple aftershocks, including one of magnitude 6.7. The earthquake's epicenter was located in Mandalay at a depth of 10 kilometers. Tremors were felt in China, Thailand, Vietnam, and parts of India. In Myanmar, at least 144 deaths and over 732 injuries were reported. A mosque in Taungnoo partially collapsed, killing at least 3. The Mahamuni Buddha Temple and the former royal palace in Mandalay were damaged. Myanmar's military leader appealed for international aid. India sent 15 tonnes of relief material. A state of emergency was declared in several regions.\n\nIn Thailand, a skyscraper under construction collapsed in Bangkok, resulting in at least 10 deaths, 16 injuries, and over 100 missing. Metro and light rail services were suspended. Bangkok was declared a disaster area.\n\nThe US Geological Survey estimated that the death toll could exceed 1,000. A magnitude 4.2 earthquake later hit Afghanistan.\n", "A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event2_pos": [8, 9], "ori_score": 93}
{"topic_id": 3, "topic": "Trump supporters storm US Capitol", "uuid": "3d0c46e1-6554-4fb3-b118-ac83b62ed180", "event1": "Trump addressed supporters in Washington, D.C., urging them to protest the election results and march to the Capitol.", "event1_order": 2, "event1_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n", "On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n"], "event1_pos": [1, 7], "event2": "Trump supporters stormed the U.S. Capitol, clashing with police, breaching security barriers, and forcing entry.", "event2_order": 3, "event2_context": ["Trump supporters protested in Washington, D.C., to reject the election results. Trump addressed the crowd, urging them to protest before they marched to the Capitol. Protesters clashed with police and breached security barriers, prompting the House and Senate to recess and the Capitol to be locked down. D.C. Mayor Bowser ordered a citywide curfew. Proud Boys marched towards the Capitol building, with some chanting \"storm the Capitol\" and \"1776!\". Police fired gas cannisters.\n", "President Trump told supporters to never accept defeat. Hundreds of his supporters then stormed the U.S. Capitol to overturn the election. A woman was shot and killed by Capitol Police. The mob bashed through Capitol doors and windows, halting the congressional certification of Joe Biden’s victory. Lawmakers were evacuated. Tear gas was fired. The Senate stopped its proceedings, and the House doors were closed. The D.C. National Guard was activated, and a citywide curfew was imposed. Four people died: one from gunfire and three from medical emergencies. Rioters broke windows and vandalized offices. Law enforcement in riot gear arrived at the Capitol. Biden condemned the assault. Trump told people to \"go home\" in a video. Twitter, Facebook and Instagram temporarily banned Trump. Lawmakers were escorted back to work after the mob was cleared. Federal agents investigated a truck with weapons and potential bombmaking material. Police arrested at least 52 people and discovered pipe bombs and molotov cocktails. A man was stabbed near Freedom Plaza.\n", "On Wednesday, supporters of President Trump overtook the U.S. Capitol, breaching police lines and forcing their way into the building to stop the peaceful transfer of power. Protesters rioted inside, while lawmakers hid. A woman was shot inside the Capitol and later died. Protesters looted and destroyed offices. Congress had convened to certify President-elect Joe Biden's win. The Capitol was secured by 6 p.m., and lawmakers reconvened at 8 p.m. to continue the certification. Trump had refused to concede the election, claiming widespread voter fraud, and spoke to supporters on the National Mall before the riot. Capitol Police lines were broken, and the FBI joined enforcement efforts. Trump initially tweeted messages asking for peace but not for protestors to leave, then later released a video repeating claims of a stolen election and telling demonstrators to go home, followed by a tweet appearing sympathetic to the demonstrators. Twitter removed the tweets and locked Trump's account. Biden delivered a speech denouncing the events. Lawmakers and officials denounced the mobs, with some accusing Trump of inciting the attack.\n", "On January 6th, Washington experienced a riot/insurrection during the joint session of Congress certifying the presidential victory. Attempts to overturn the November election failed. Congress confirmed Biden as president in the early hours of January 7th.\n", "Despite planning between federal and local police, officials had no intelligence indicating a Capitol threat. An angry mob overwhelmed police, stormed the Capitol, ransacked offices, injured officers, and stole items. Five people died during the riots. The US Capitol Police assured counterparts they had the situation under control. Federal and local officials did not anticipate the attack, even with public social media postings suggesting otherwise. The FBI monitored social media and hotels. Enrique Tarrio, leader of the Proud Boys, was arrested and told to leave town. DC Police Chief stated there was no intelligence suggesting a breach of the US Capitol. Several federal agencies were on standby but unaware of the Capitol Police's inability to prevent the insurrection. Capitol Police requested help as protesters converged at barricades. The Capitol ransacking prompted questions about security failures and treatment of Trump supporters versus Black Lives Matter protesters. Capitol Police Chief Steven Sund, House Sergeant at Arms Paul Irving, and Senate Sergeant at Arms Michael Stenger resigned. There was criticism regarding the handling of summer protests. Federal agencies had over 500 officers ready. Capitol Police stated they had a robust plan but were overwhelmed by \"criminal riotous behavior.\" The Capitol Police report to Congress, creating jurisdictional complexities. Crowds breached entrances, and federal officials were asked for help, but intervention was too late. Multiple federal agencies deployed emergency response teams. The Metropolitan Police Department received a call for help from Capitol Police, and FBI and ATF agents were deployed. Rioters entered secure parts of the building. ICE and CBP teams were on standby. The FBI and ATF cleared the Capitol, allowing Congress to return. Lawmakers demanded answers from acting Attorney General Jeffrey Rosen, acting Defense Secretary Christopher Miller and Army Secretary Ryan McCarthy, Maryland's Governor Larry Hogan said he was asked to deploy the National Guard but authorization was delayed. It was reported that Vice President Pence helped to facilitate the DC National Guard deployment while Trump resisted. Around 7 p.m., federal law enforcement agencies held another call with Pence and House and Senate leaders, but Capitol Police were not included in the call. The ICE Homeland Security Investigations personnel stayed at headquarters. FEMA staff worked to ensure continuity of government operations.\n", "Trump's supporters stormed the U.S. Capitol, shattering windows and ransacking offices, while lawmakers huddled inside. The breach forced members to flee the House and Senate, delaying the electoral college vote count. Nancy Pelosi and Charles Schumer called for Trump's removal from office. Pro-Trump demonstrators rallied outside Los Angeles City Hall.\n", "On Wednesday, President Trump spoke against the election results near the White House while his supporters gathered at the Capitol. Trump had urged supporters to go to Washington to stop the certification of election results. Hundreds assembled on the Capitol lawn. Trump told rally attendees to walk to the Capitol. Supporters left the rally and headed toward the Capitol, joining an already agitated crowd. A pipe bomb was reported at the Republican National Committee building, and another at the Democratic National Committee headquarters. Rioters harassed officers at the Capitol barricades and breached the outer perimeter. The mob broke through additional barricades, forcing officers onto the Capitol steps. A joint session of Congress convened to certify the Electoral College vote. Trump called on supporters to march on the Capitol; rioters clashed with police. The Capitol Police requested assistance from the D.C. National Guard. On the east side, another mob reached the Capitol doors. Police removed a barricade. A crowd breached a larger barricade on the east side. Another mob chased officers and breached the final barrier on the northwest side. The mob approached an entrance near the Senate chamber. Rioters broke into the building. The Senate was called into recess. Rioters entered through a door and broken window and chased an officer to the Senate chamber entrance. Police clashed with the mob inside. The House went into recess, and some members of Congress evacuated. The crowd outside grew and became more violent.\n", "Trump supporters stormed the U.S. Capitol, clashing with police and delaying the affirmation of Biden's win. Protesters breached security perimeters, and tear gas was used in the Rotunda. Lawmakers were told to put on gas masks. The Capitol was locked down due to an external security threat. Protesters entered the Senate chamber. Congressional leaders and Vice-President Elect Kamala Harris were moved to safety. Trump urged supporters to march to the Capitol at an earlier rally and later tweeted for them to stay peaceful. Both chambers went into recess. D.C.'s Mayor issued a 6 p.m. curfew. Protesters tore down barricades and clashed with police in riot gear. A suspicious package was reported. These events followed Trump's rally near the White House where he repeated claims of election fraud.\n", "Following the storming of the U.S. Capitol by Donald Trump's supporters during the Electoral College certification, the Texas Department of Public Safety closed the Texas State Capitol and surrounding grounds on Wednesday. The Capitol complex was closed to the public effective immediately, according to a statement attributed to Freeman Martin. The Texas Capitol had reopened to the public on Monday after being closed for months.\n"], "event2_pos": [1, 2, 3, 4, 5, 6, 7, 8, 9], "ori_score": 93}
{"topic_id": 7, "topic": "South Korean President Yoon Suk-yeol faces impeachment crisis", "uuid": "71b767c3-5cd8-4289-b6ef-e1d99d83f302", "event1": "Martial-law command suspended the legislature and controlled the media.", "event1_order": 2, "event1_context": ["President Yoon Suk Yeol declared martial law, accusing the opposition of undermining the democratic system. The martial-law command suspended the legislature and controlled the media. Opposition parties and leaders of the ruling party denounced the action. Lawmakers unanimously annulled martial law. Protesters gathered, and some blocked soldiers from entering parliament. The U.S. and UK issued travel advisories. Opposition parties filed a motion to impeach President Yoon. Yoon's aides offered to resign. The U.S. stated that ending martial law was a crucial step.\n"], "event1_pos": [3], "event2": "A second impeachment motion was filed against President Yoon in the National Assembly.", "event2_order": 9, "event2_context": ["President Yoon Suk-yeol faces a second impeachment motion in the National Assembly after declaring martial law on December 3, triggering protests. The motion requires 200 votes to pass. Some legislators from Yoon’s party support the motion. Yoon refuses to resign. If impeached, Yoon's powers will be suspended, and the prime minister will become acting president. The opposition is considering impeaching the Prime Minister as well, in which case the deputy prime minister for the economy would take over as acting president. The Constitutional Court will review the case; six of nine justices must support the motion for it to be upheld. Currently only six justices sit on the bench. The court must decide within 180 days. Yoon may argue martial law was within his powers. If the court upholds the impeachment, Yoon will be removed and an election will be held within 60 days. If rejected, Yoon will be reinstated. Yoon also faces criminal investigations, including charges of insurrection. Yoon could potentially be arrested.\n"], "event2_pos": [9], "ori_score": 85}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "uuid": "b18fe409-4f92-4035-8de9-e68a5f2ed203", "event1": "144 people were killed and 732 injured in Myanmar initially.", "event1_order": 7, "event1_context": ["A magnitude-7.9 earthquake struck central Myanmar on Friday, sending tremors to neighboring regions. The earthquake took place at 2:20 pm (Beijing time) at a depth of 30 kilometers. By Friday night, 144 people had been killed and 732 injured. A magnitude-6.4 aftershock occurred 12 minutes later. Myanmar declared a state of emergency in six quake-affected areas. The quake caused the collapse of the Old Sagaing Bridge and several buildings, and damaged some sections of the Mandalay-Yangon expressway, causing road closures. Mandalay and Nay Pyi Daw airports were closed. Injured people were seen at a hospital in Nay Pyi Daw. The government requested international humanitarian aid. The Myanmar Red Cross Society began providing first aid. Neighboring Thailand declared a state of emergency in Bangkok. Two people were reported injured in Yunnan province, China.\n"], "event1_pos": [9], "event2": "Death toll rose to 4,390 in Myanmar and 36 in Thailand by April 3, following the earthquake on March 28, 2025.", "event2_order": 12, "event2_context": ["On March 28, 2025, a M7.7 earthquake hit Myanmar at 06:20 UTC, followed by a M6.7 aftershock 12 minutes later. The epicenter was near Sagaing and Mandalay. Violent shaking was felt by millions, and the USGS issued a Red alert, predicting high casualties and extensive damage. Liquefaction and landslides were triggered. Buildings collapsed in Mandalay and roads buckled in Naypyidaw. Over 1,000 deaths and 2,400 injuries were reported initially. National phone and internet infrastructure was disrupted. Approximately 2,970 residential buildings, 150 religious structures, 30 roads, and 7 bridges were destroyed or severely damaged. Many mosques and monasteries collapsed, resulting in deaths during prayer time and trapping monks. Mandalay was severely affected, with at least 674 deaths and over 1,000 missing and more than half of the city’s buildings severely damaged or destroyed. Significant damage occurred to Mandalay University, the Dokhtawaddy Bridge, Mandalay Palace and Sagaing Township experienced widespread structural failure. In Naypyidaw, 204 fatalities were confirmed, with damage to government buildings and the airport control tower. In Shan State, at least 60 deaths were reported. In Bago Region, school and shelter collapses caused fatalities. Yangon experienced limited damage. In Thailand, at least 10 people were killed, 68 injured and 90 missing, with building collapses in Bangkok and suspension of transit and trading. On March 31, the death toll rose to over 2,900 in Myanmar and 18 in Thailand. By April 3, the death toll reached 4,390 in Myanmar and 36 in Thailand, with over 5,490 injured and hundreds missing. States of emergency were declared.\n"], "event2_pos": [2], "ori_score": 96}
{"topic_id": 10, "topic": "US imposes widespread trade tariffs after Trump's re-election", "uuid": "98420178-7905-4ebc-b022-2824cea53433", "event1": "President Trump announced new widespread tariffs, planning imposition on April 2.", "event1_order": 9, "event1_context": ["President Trump announced new tariffs applying to most of the world. The plan includes a 10% \"base line\" tariff on nearly all U.S. imports (excluding Canada and Mexico) and a \"reciprocal\" tariff (1-40%, added to the 10% base) on 57 countries with allegedly unfair trade practices, calculated based on the U.S. trade deficit. The 10% tariffs will take effect on Saturday, the reciprocal rates the following Wednesday. Affected countries include China, Japan, Germany, India, South Korea, Taiwan, and Vietnam; European goods will face a 20 percent tariff, Japanese goods will face 24 percent and South Korean products 26 percent. Chinese exports face an extra 34 percent tariff, potentially reaching 79% on some products. Vietnam will face a 46 percent tariff. Trump aims to force companies to manufacture in the U.S., creating jobs. The tariffs will increase costs for importers, potentially passed on to consumers. The government anticipates increased revenue to channel into tax cuts. The announcement triggered a global stock market decline; retaliation from other countries is possible, potentially sparking trade wars. Analysts predict slower economic growth, higher consumer prices, and a risk of recession.\n", "President Trump has called April 2 \"liberation day,\" planning to impose new tariffs on imported goods. Trump argues tariffs will balance the economic playing field and encourage domestic manufacturing. Economists generally believe tariffs lead to higher consumer prices and retaliatory tariffs. Trump wants to use tariffs to force other countries to lower their tariffs on U.S. goods. Trump has announced tariffs on imported steel and aluminum and on imported autos and auto parts. The specifics of the tariffs to be announced on April 2 remain unclear. Negotiations with Canada are possible. The U.S. has a trade deficit. Trump believes this proves the U.S. is treated unfairly. Tariffs could pull more business into the U.S. or lead to a recession.\n"], "event1_pos": [2, 4], "event2": "Global stock markets declined following the widespread tariff announcements.", "event2_order": 11, "event2_context": ["President Trump announced new tariffs applying to most of the world. The plan includes a 10% \"base line\" tariff on nearly all U.S. imports (excluding Canada and Mexico) and a \"reciprocal\" tariff (1-40%, added to the 10% base) on 57 countries with allegedly unfair trade practices, calculated based on the U.S. trade deficit. The 10% tariffs will take effect on Saturday, the reciprocal rates the following Wednesday. Affected countries include China, Japan, Germany, India, South Korea, Taiwan, and Vietnam; European goods will face a 20 percent tariff, Japanese goods will face 24 percent and South Korean products 26 percent. Chinese exports face an extra 34 percent tariff, potentially reaching 79% on some products. Vietnam will face a 46 percent tariff. Trump aims to force companies to manufacture in the U.S., creating jobs. The tariffs will increase costs for importers, potentially passed on to consumers. The government anticipates increased revenue to channel into tax cuts. The announcement triggered a global stock market decline; retaliation from other countries is possible, potentially sparking trade wars. Analysts predict slower economic growth, higher consumer prices, and a risk of recession.\n"], "event2_pos": [2], "ori_score": 88}
{"topic_id": 7, "topic": "South Korean President Yoon Suk-yeol faces impeachment crisis", "uuid": "23f6b4d7-e740-4198-bb4f-5dfa7cb01c89", "event1": "Martial-law command suspended the legislature and controlled the media.", "event1_order": 2, "event1_context": ["President Yoon Suk Yeol declared martial law, accusing the opposition of undermining the democratic system. The martial-law command suspended the legislature and controlled the media. Opposition parties and leaders of the ruling party denounced the action. Lawmakers unanimously annulled martial law. Protesters gathered, and some blocked soldiers from entering parliament. The U.S. and UK issued travel advisories. Opposition parties filed a motion to impeach President Yoon. Yoon's aides offered to resign. The U.S. stated that ending martial law was a crucial step.\n"], "event1_pos": [3], "event2": "Protest: Tens of thousands of South Korean protesters demonstrated near the National Assembly in Seoul, demanding President Yoon Suk Yeol's removal.", "event2_order": 5, "event2_context": ["Tens of thousands of South Korean protesters demonstrated near the National Assembly in Seoul, calling for President Yoon Suk Yeol's removal. Baek Jae Gil adapted \"Feliz Navidad\" into a protest anthem, \"Impeachment is the answer,\" and performed it outside the National Assembly after Yoon's declaration of martial law. The song spread online. Baek Jae Gil, a musician, has been protesting for decades, noting a shift toward more peaceful demonstrations. He was inspired by past protests, including those against President Park Geun-hye's impeachment. He wrote his \"Feliz Navidad\" adaptation in 2022 after protests grew following a crowd crush. He faced copyright issues with a satirical video earlier in the year. Last week, he performed his anthem at the National Assembly and again at last Saturday’s protests.\n", "Tens of thousands protested near South Korea's National Assembly, calling for President Yoon Suk Yeol's impeachment as lawmakers voted on the motion. The impeachment motion failed. Protests intensified following Yoon's declaration of martial law. A smaller group of Yoon's supporters gathered in Seoul.\n"], "event2_pos": [2, 8], "ori_score": 83}
{"topic_id": 5, "topic": "Elon Musk acquires Twitter, implements major reforms", "uuid": "276665ca-ae65-41ba-a11e-938cd762ed2f", "event1": "Elon Musk to acquire Twitter for $44 billion", "event1_order": 1, "event1_context": ["Elon Musk is moving forward with a deal to acquire Twitter for $44 billion. The central question is how he will change the company. Transforming Twitter's strategy poses a challenge similar to those faced by outside executives, private equity firms, or general managers overseeing acquired business units.\n"], "event1_pos": [8], "event2": "Elon Musk acquired Twitter for $44 billion.", "event2_order": 3, "event2_context": ["Elon Musk, prior to finalizing his purchase of Twitter, tweeted his dislike of advertising. After acquiring Twitter, Musk tweeted he aims to make it \"the most respected advertising platform.\" He bought the company to prevent social media from splintering into echo chambers. He reassured advertisers about brand safety, promising a platform following regulations and welcoming to all, but made no promises about content moderation. Bob Hoffman stated advertisers are unclear if Musk will be a free-speech absolutist or savvy businessman, and advertisers will leave if Twitter becomes a haven for problematic content. General Motors suspended advertising on Twitter to understand the platform's direction under new ownership. Advertising executives worried about Musk's free speech stance placing ads near hate speech. Some clients indicated pausing business to evaluate options, while others may leave if Donald Trump's account is reinstated. Arun Kumar stated advertisers still share concerns about content moderation. Musk's message made clear he doesn't want advertisers to leave. HBO will assess the platform under Musk's leadership. Twitter's advertising sales have been increasing, totaling $2.18 billion in the first half of the year.\n", "Musk took over Twitter, stating \"the bird is freed.\" Users fear the buyout will degrade the platform after improvements to functionality, policies, and moderation. Musk plans sweeping policy changes, including loosening speech rules and user authentication requirements. Musk fired top executives, including Vijaya Gadde. Gadde's legal team made policy strides protecting vulnerable users. Musk intends to roll back some of Twitter's rules and cut back on efforts to fight misinformation, which could impact civic engagement during upcoming elections.\n", "Elon Musk completed his $44 billion takeover of Twitter and fired CEO Parag Agrawal, CFO Ned Segal, and general counsel Vijaya Gadde. Musk denied planning to cut 75% of Twitter staff. Musk stated his reasons for acquiring Twitter were to have a common digital town square. Musk plans to allow previously suspended accounts, including Donald Trump's, back on the platform. Musk aims to create \"X, the everything app,\". Erik Gordon suggests Musk will take the company private and that Twitter will owe at least a billion dollars annually on about $13 billion in new debt. The Online Safety Bill in the UK may force Musk to soften his stance on absolute free speech.\n", "Elon Musk took control of Twitter, ousting CEO Parag Agrawal, CFO Ned Segal, and Chief Legal Counsel Vijaya Gadde. These departures occurred before a court-imposed deadline to finalize the acquisition. Musk addressed concerns from advertisers, emphasizing his goal to improve humanity and prevent Twitter from becoming a \"free-for-all hellscape.\" He assured advertisers he wants Twitter to be \"the most respected advertising platform in the world.\" Musk's plans include increasing Twitter's subscriber base and revenue, and he signaled potential changes to content moderation policies and advertising strategies. Trading in Twitter shares was suspended on the New York Stock Exchange in anticipation of the company going private.\n"], "event2_pos": [2, 3, 5, 9], "ori_score": 98}
