{"topic_id": 11, "topic": "United States launches trade war against China by imposing tariffs", "answer": [{"event": "Japan approved China’s WTO bid in 1999.", "event_order": 1, "position": [2]}, {"event": "Economists led by David Autor found that Chinese import competition caused the loss of 1 million U.S. manufacturing jobs between 1990 and 2007.", "event_order": 2, "position": [6]}, {"event": "China overtook the United States as the largest economy (PPP) by 2016.", "event_order": 3, "position": [1]}, {"event": "Donald Trump stated at a campaign rally in May 2016 that China was \"raping our country\" and committing \"the greatest theft in the history of the world.\"", "event_order": 4, "position": [6]}, {"event": "Trump scrapped the Trans-Pacific Partnership (TPP).", "event_order": 5, "position": [6, 7, 11]}, {"event": "Trump named Robert Lighthizer, a steel industry lobbyist, as U.S. Trade Representative.", "event_order": 6, "position": [5, 9]}, {"event": "Trump launched a trade war on China during his first administration.", "event_order": 7, "position": [1, 11]}, {"event": "President Donald Trump proposed tariffs on steel and aluminum.", "event_order": 8, "position": [9, 11]}, {"event": "The Trump administration placed Huawei on a trade blacklist in 2019 and implemented additional restrictions on its operations.", "event_order": 9, "position": [11]}, {"event": "India banned Chinese apps, including TikTok, starting in 2020.", "event_order": 10, "position": [2]}, {"event": "The US and China signed the \"Phase One\" trade agreement in January 2020, with China committing to increase imports of US goods and services.", "event_order": 11, "position": [11]}, {"event": "The United States enacted semiconductor export controls limiting China’s access to advanced semiconductor technologies in October 2022.", "event_order": 12, "position": [2]}, {"event": "The European Union levied new tariffs against Chinese EV imports in 2024.", "event_order": 13, "position": [2]}]}
{"topic_id": 12, "topic": "Huawei unveils HarmonyOS as alternative to Android", "answer": [{"event": "HarmonyOS development began in 2017.", "event_order": 1, "position": [2]}, {"event": "Huawei was placed on a US trade blacklist, preventing Google from supplying new Huawei devices with Android OS.", "event_order": 2, "position": [1]}, {"event": "Google, Intel, and other U.S. companies suspended business with Huawei.", "event_order": 3, "position": [3]}, {"event": "Huawei denied the U.S. government's accusations and pursued legal means.", "event_order": 4, "position": [3]}, {"event": "Huawei unveiled its Harmony operating system.", "event_order": 5, "position": [1, 2, 3, 4, 5, 6, 7, 9, 10]}, {"event": "Richard Yu announced Harmony OS at a developer conference in Dongguan, China.", "event_order": 6, "position": [1, 2, 3]}, {"event": "Huawei announced HarmonyOS will be open source.", "event_order": 7, "position": [1, 4, 6]}, {"event": "Huawei stated HarmonyOS will debut first on the Honor Smart Screen and Huawei TVs.", "event_order": 8, "position": [1, 2, 3, 5, 6, 7, 8, 10]}, {"event": "Huawei released a TV running HarmonyOS.", "event_order": 9, "position": [6, 8, 10]}, {"event": "Huawei stated it will first lay the foundation for operating systems in the Chinese market, then expand overseas.", "event_order": 10, "position": [1, 4]}, {"event": "Huawei ensured HarmonyOS supports applications developed in multiple programming languages.", "event_order": 11, "position": [6, 9]}, {"event": "Huawei announced a deployment timeline for HarmonyOS on various devices between 2020 and 2022.", "event_order": 12, "position": [2, 6, 7, 9]}, {"event": "Huawei currently has no plans to roll out Harmony OS to phones, tablets, or computers.", "event_order": 13, "position": [3, 5, 7, 9]}, {"event": "Huawei’s smartphone sales suffered in international markets.", "event_order": 14, "position": [1]}]}
{"topic_id": 13, "topic": "Facebook changes company name to Meta to focus on the metaverse", "answer": [{"event": "Mark Zuckerberg announced Facebook was betting on the metaverse in July.", "event_order": 1, "position": [9]}, {"event": "Mark Zuckerberg announced a smart-glasses partnership with Ray-Ban.", "event_order": 2, "position": [6]}, {"event": "Facebook announced Andrew Bosworth's promotion to chief technology officer.", "event_order": 3, "position": [6, 7, 10, 15]}, {"event": "Facebook announced plans to hire 10,000 more employees for metaverse development in Europe.", "event_order": 4, "position": [7]}, {"event": "Facebook announced a $50 million fund for responsible metaverse research in September.", "event_order": 5, "position": [9]}, {"event": "A whistleblower turned over internal Facebook documents to Congress and the U.S. Securities and Exchange Commission.", "event_order": 6, "position": [6, 9, 14, 15]}, {"event": "More than a dozen news outlets published stories based on the leaked Facebook documents.", "event_order": 7, "position": [14]}, {"event": "Facebook plans to change its company name to reflect its focus on the metaverse.", "event_order": 8, "position": [7]}, {"event": "CEO Mark Zuckerberg introduced Meta, a new company brand unifying apps and technologies at Connect 2021.", "event_order": 9, "position": [1]}, {"event": "Facebook changed its corporate name to Meta on October 28 at the company's annual Connect event.", "event_order": 10, "position": [6, 9, 10, 11, 14, 15]}, {"event": "Facebook introduced a new infinity-shaped corporate logo.", "event_order": 11, "position": [5]}, {"event": "Facebook replaced its corporate sign outside its California headquarters with one featuring the Meta logo.", "event_order": 12, "position": [2]}, {"event": "The company plans to report on two operating segments, Family of Apps and Reality Labs, starting Q4 2021.", "event_order": 13, "position": [1, 2, 10, 15]}, {"event": "The company intends to begin trading under the stock ticker MVRS on December 1.", "event_order": 14, "position": [1, 2, 10, 15]}, {"event": "Andrew Bosworth announced the retirement of the Oculus name.", "event_order": 15, "position": [11]}, {"event": "Facebook announced a $150-million investment in immersive learning.", "event_order": 16, "position": [1]}, {"event": "Facebook announced a series of new software tools, including Presence Platform for Quest 2 mixed reality.", "event_order": 17, "position": [1, 14, 15]}]}
{"topic_id": 14, "topic": "TikTok subjected to US national security investigation over data concerns", "answer": [{"event": "ByteDance acquired Musical.ly in 2017 and rebranded it as TikTok.", "event_order": 1, "position": [2]}, {"event": "The Committee on Foreign Investment in the United States (CFIUS) opened an investigation of TikTok.", "event_order": 2, "position": [2]}, {"event": "Senator Marco Rubio accused TikTok of censoring content aligned with Chinese directives.", "event_order": 3, "position": [4]}, {"event": "Former U.S. employees reported that Beijing-based moderators had final approval on flagged TikTok videos.", "event_order": 4, "position": [4]}, {"event": "TikTok denied sending user data to China and stated that its California team reviews content for U.S. policies.", "event_order": 5, "position": [4]}, {"event": "ByteDance stepped up efforts to separate its social media app TikTok from its Chinese operations.", "event_order": 6, "position": [5]}, {"event": "Kayla Curry received a New York Times alert about a U.S. government national security investigation into TikTok.", "event_order": 7, "position": [8]}, {"event": "In April 2024, Congress passed a law requiring ByteDance to divest TikTok by early 2025 or face a ban on U.S. app store distribution.", "event_order": 8, "position": [1]}, {"event": "In July 2024, the U.S. government stated in a legal filing related to TikTok that China could use TikTok’s algorithm to interfere with the U.S. political system.", "event_order": 9, "position": [1]}, {"event": "On January 17, 2025, the Supreme Court upheld the constitutionality of the April 2024 law regarding TikTok divestment.", "event_order": 10, "position": [1]}, {"event": "On January 20, 2025, President Donald Trump sought to delay enforcement of the 2024 law banning TikTok distribution, intending to work out a divestment deal.", "event_order": 11, "position": [1]}]}
{"topic_id": 15, "topic": "OpenAI releases ChatGPT.", "answer": [{"event": "OpenAI trained InstructGPT to produce less toxic text.", "event_order": 1, "position": [1]}, {"event": "OpenAI collected examples of good dialogue responses from people to train an initial version of ChatGPT.", "event_order": 2, "position": [1]}, {"event": "Human judges scored the initial model’s responses.", "event_order": 3, "position": [1]}, {"event": "Schulman and colleagues used these scores in a reinforcement learning algorithm.", "event_order": 4, "position": [1]}, {"event": "The reinforcement learning algorithm trained the final version of ChatGPT to produce high-scoring responses.", "event_order": 5, "position": [1]}, {"event": "OpenAI launched the DALL-E 2 beta on July 20, 2022.", "event_order": 6, "position": [4]}, {"event": "OpenAI made DALL-E 2 available as an API.", "event_order": 7, "position": [11]}, {"event": "OpenAI publicly released ChatGPT as a free research preview on November 30, 2022.", "event_order": 8, "position": [2, 5, 6, 7, 8, 13, 15]}, {"event": "Millions of people started using ChatGPT immediately after its launch.", "event_order": 9, "position": [13]}, {"event": "ChatGPT quickly reached one million daily active users.", "event_order": 10, "position": [7]}, {"event": "Stack Overflow banned ChatGPT-generated answers due to their misleading incorrectness.", "event_order": 11, "position": [8]}, {"event": "Sam Altman publicly acknowledged ChatGPT’s limitations in accuracy and truthfulness.", "event_order": 12, "position": [7]}, {"event": "OpenAI released ChatGPT Plus on February 1, 2023, and later introduced GPT-4 Turbo with Vision and GPT-4o to the public.", "event_order": 13, "position": [15]}, {"event": "GPT-4 was released on March 14, 2023, and integrated into ChatGPT.", "event_order": 14, "position": [5]}, {"event": "The Italian Data Protection Authority imposed a temporary ban on ChatGPT in Italy due to privacy concerns.", "event_order": 15, "position": [5]}, {"event": "Goldman Sachs estimated that AI systems like ChatGPT could automate up to 300 million jobs worldwide.", "event_order": 16, "position": [13]}, {"event": "OpenAI experienced leadership changes, including the firing and rehiring of Sam Altman.", "event_order": 17, "position": [13]}, {"event": "Scientific journals, including Springer Nature and Elsevier, updated author guidelines to prohibit LLMs as authors and require documentation of their use.", "event_order": 18, "position": [5]}, {"event": "Ongoing lawsuits have been filed against OpenAI alleging copyright infringement and privacy violations due to its training data.", "event_order": 19, "position": [15]}]}
{"topic_id": 16, "topic": "Nvidia stock price surges amid generative AI boom", "answer": [{"event": "Jensen Huang, Chris Malachowsky, and Curtis Priem founded Nvidia in 1993.", "event_order": 1, "position": [1]}, {"event": "Jensen Huang took Nvidia public on Nasdaq in 1999.", "event_order": 2, "position": [1]}, {"event": "The tech industry increased its focus on A.I., causing a shortage of chips.", "event_order": 3, "position": [2]}, {"event": "Foreign investors purchased a net 15.8 trillion won ($11.6 billion) of South Korean stocks from January through March.", "event_order": 4, "position": [4]}, {"event": "Nvidia released its first-quarter earnings report, estimating $11 billion in second-quarter sales and reporting $1.09 earnings per share.", "event_order": 5, "position": [1]}, {"event": "Nvidia announced it is significantly increasing chip supply to meet surging demand.", "event_order": 6, "position": [1]}, {"event": "Nvidia shares surged 24% to a record high, triggering a stock rally for Nvidia and other AI-adjacent businesses.", "event_order": 7, "position": [1]}, {"event": "Nvidia's market cap briefly reached $1 trillion on Tuesday, following its report of better-than-expected Q1 revenues and a prediction of Q2 revenues 50% above analyst expectations.", "event_order": 8, "position": [5]}, {"event": "Nvidia reported a 101% year-over-year increase in quarterly revenue.", "event_order": 9, "position": [3]}, {"event": "Nvidia generated $13.51 billion in revenue for the three months ended July 30.", "event_order": 10, "position": [3]}, {"event": "Nvidia set a new company revenue record.", "event_order": 11, "position": [3]}]}
{"topic_id": 17, "topic": "Massive wildfires devastate Southern California due to drought", "answer": [{"event": "The Park Fire ignited in July in Northern California.", "event_order": 1, "position": [2]}, {"event": "The Park Fire became the fourth-largest in California history.", "event_order": 2, "position": [2]}, {"event": "The Park Fire destroyed at least 700 structures.", "event_order": 3, "position": [2]}, {"event": "The Palisades fire burned over 23,400 acres and forced evacuations along Pacific Coast Highway in Pacific Palisades, Malibu, and Santa Monica.", "event_order": 4, "position": [1]}, {"event": "The Eaton fire burned over 14,000 acres, destroyed thousands of homes, and displaced tens of thousands.", "event_order": 5, "position": [1]}, {"event": "The Kenneth fire broke out in West Hills.", "event_order": 6, "position": [1]}, {"event": "The Lidia fire ignited in Angeles National Forest.", "event_order": 7, "position": [1]}, {"event": "Ottawa rapper Khalid Omar was forced to evacuate his Calabasas condo, and his studio was ruined by the wildfires, specifically the Kenneth fire which began spreading Thursday.", "event_order": 8, "position": [3]}, {"event": "An out-of-control wildfire in L.A.’s Pacific Palisades affected almost 3,000 acres and forced thousands to evacuate.", "event_order": 9, "position": [3]}, {"event": "Thousands of firefighters are tackling multiple blazes that killed at least two people and destroyed over 10,000 structures in the Los Angeles area.", "event_order": 10, "position": [3]}, {"event": "Fire crews contained several fires, including the Kenneth, Lidia, Sunset, Auto, Hurst, Archer, and San Diego area fires.", "event_order": 11, "position": [1]}, {"event": "Quebec planes and B.C. helicopters are battling the L.A. wildfires.", "event_order": 12, "position": [3]}, {"event": "The Bridge Fire burned through about 12 miles of land in a single day.", "event_order": 13, "position": [2]}, {"event": "The NOAA National Centers for Environmental Information released the final 2023 Billion-dollar disaster report.", "event_order": 14, "position": [9]}, {"event": "The U.S. experienced a record 28 billion-dollar weather and climate disasters in 2023, surpassing the previous record of 22 in 2020.", "event_order": 15, "position": [9]}, {"event": "Scientists confirmed 2024 was Canada and the world’s hottest year on record, breaching the 1.5 C warming threshold.", "event_order": 16, "position": [3]}, {"event": "Brazil experienced 180,000 fires in 2024, with over 50,000 currently active.", "event_order": 17, "position": [4]}, {"event": "Severe rains caused a major dam to collapse in Nigeria on September 10, killing 30 people and displacing a million.", "event_order": 18, "position": [8]}, {"event": "Typhoon Yagi and monsoon rains triggered catastrophic floods and landslides in Southeast Asia, killing over 500 people.", "event_order": 19, "position": [8]}]}
{"topic_id": 18, "topic": "DeepSeek unveils large language model, igniting AI research discussions", "answer": [{"event": "Liang Wenfeng founded DeepSeek in July 2023.", "event_order": 1, "position": [3]}, {"event": "In November 2023, DeepSeek launched DeepSeek LLM.", "event_order": 2, "position": [8]}, {"event": "In late December, DeepSeek unveiled a free, open-source large language model built in two months for under $6 million using Nvidia H800s chips.", "event_order": 3, "position": [1]}, {"event": "DeepSeek unveiled its V3 model in December and R1 model in January.", "event_order": 4, "position": [3]}, {"event": "DeepSeek's model outperformed Meta's Llama 3.1, OpenAI's GPT-4o, and Anthropic's Claude Sonnet 3.5 in third-party benchmark tests.", "event_order": 5, "position": [1]}, {"event": "DeepSeek's app reached the top of U.S. free app charts within a week of its launch.", "event_order": 6, "position": [3]}, {"event": "DeepSeek released its large language model, DeepSeek-R1, on January 20.", "event_order": 7, "position": [6]}, {"event": "DeepSeek-R1 achieved a Pass@1 score of 97.3% on MATH-500, surpassing OpenAI’s o1.", "event_order": 8, "position": [5]}, {"event": "DeepSeek-R1’s application became the most downloaded free AI app on the US Apple App Store.", "event_order": 9, "position": [12]}, {"event": "DeepSeek released a notice stating it does not engage in external project cooperation or privatization deployment.", "event_order": 10, "position": [6]}, {"event": "DeepSeek launched its V2 model, which triggered a price war in China's AI industry.", "event_order": 11, "position": [3]}, {"event": "The launch of DeepSeek caused the loss of close to $1 trillion off global stock markets.", "event_order": 12, "position": [9, 14]}, {"event": "DeepSeek was hit with a cyber-attack on Monday, forcing it to temporarily limit registrations.", "event_order": 13, "position": [9, 14]}, {"event": "The U.S. government limits sales of powerful chips to China.", "event_order": 14, "position": [2]}, {"event": "Trade controls forced Chinese researchers to use freely available tools creatively.", "event_order": 15, "position": [2]}, {"event": "OpenAI CEO Sam Altman announced the finalization of the new reasoning AI model.", "event_order": 16, "position": [7]}, {"event": "Donald Trump hailed a $500 billion plan by OpenAI, SoftBank, and Oracle.", "event_order": 17, "position": [7, 14]}]}
{"topic_id": 19, "topic": "Historic winter storm paralyzes Texas, causing massive power outages", "answer": [{"event": "ERCOT officials acknowledged \"pretty frigid temperatures\" were headed to Texas during a board meeting.", "event_order": 1, "position": [6]}, {"event": "On February 11, a 130+ vehicle crash on I-35 in Fort Worth resulted in 6 deaths and over 65 hospitalizations.", "event_order": 2, "position": [6]}, {"event": "Texas Gov. Greg Abbott issued a disaster declaration in all 254 counties.", "event_order": 3, "position": [6]}, {"event": "San Antonio Mayor Ron Nirenberg and Bexar County Judge Wolff issued a joint declaration urging precautions, travel limits, and energy conservation, activating emergency management plans.", "event_order": 4, "position": [6]}, {"event": "A major winter storm hit a large part of the United States on Monday, bringing heavy snow and cold temperatures.", "event_order": 5, "position": [1]}, {"event": "Outdoor temperatures plunged to arctic levels.", "event_order": 6, "position": [9]}, {"event": "ERCOT initiated rolling outages, leaving millions of Texans without power.", "event_order": 7, "position": [6, 11]}, {"event": "Over four million customers were without power in Texas.", "event_order": 8, "position": [11, 13, 15]}, {"event": "Over 2 million Texas residents were left without electricity.", "event_order": 9, "position": [1]}, {"event": "Electric demand for heat across the state soared.", "event_order": 10, "position": [9]}, {"event": "Regional power generators spontaneously shut down, including three coal plants and a gas plant in Corpus Christi.", "event_order": 11, "position": [9]}, {"event": "Austin and San Antonio issued boil-water notices.", "event_order": 12, "position": [3, 6]}, {"event": "At least 38 people died nationwide from winter storms or frigid conditions, including 15 deaths in Texas.", "event_order": 13, "position": [3]}, {"event": "Burst pipes led to widespread water disruptions, affecting over 15 million people in Texas.", "event_order": 14, "position": [11]}, {"event": "President Joe Biden approved a major disaster declaration for Texas.", "event_order": 15, "position": [11]}, {"event": "ERCOT ended statewide rolling outages in Texas.", "event_order": 16, "position": [6]}, {"event": "Officials began investigating significant increases in some customers’ energy bills.", "event_order": 17, "position": [11]}, {"event": "Up to six ERCOT board members resigned on February 24.", "event_order": 18, "position": [6]}]}
{"topic_id": 20, "topic": "Beirut port explosion kills over 200 and devastates Lebanese capital", "answer": [{"event": "The Moldovan-flagged ship Rhosus, carrying 2,750 tonnes of ammonium nitrate, was impounded by Lebanon’s Enforcement Department on December 20, 2013.", "event_order": 1, "position": [1]}, {"event": "The Port Authority transferred ammonium nitrate from the Rhosus to hangar 12 in Beirut’s port on October 23-24, 2014.", "event_order": 2, "position": [1]}, {"event": "The Rhosus sank on February 18, 2018.", "event_order": 3, "position": [1]}, {"event": "A fire broke out at Warehouse 12 at the Port of Beirut on August 4, reportedly started by welding work.", "event_order": 4, "position": [3, 5]}, {"event": "A colossal explosion occurred at the Port of Beirut on August 4, killing at least 200 people and injuring around 5,000.", "event_order": 5, "position": [3, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15]}, {"event": "The explosion destroyed medicines, vaccines, personal protective equipment, and damaged primary health care centers, hospitals, warehouses, and a grain silo.", "event_order": 6, "position": [4, 13]}, {"event": "Lebanon declared a two-week state of emergency in Beirut following the blast.", "event_order": 7, "position": [7, 8, 13]}, {"event": "Thousands of volunteers from Lebanon and its diaspora cleared rubble, offered accommodation, and repaired homes in affected areas after the explosion.", "event_order": 8, "position": [7, 14]}, {"event": "The Lebanese government established an investigative committee to determine responsibility for the explosion.", "event_order": 9, "position": [6, 8, 13]}, {"event": "The Cabinet ordered those involved in storing the ammonium nitrate at the port to be placed under house arrest.", "event_order": 10, "position": [6, 8, 13]}, {"event": "Prime Minister Hassan Diab and his government resigned following the explosion.", "event_order": 11, "position": [3, 14]}, {"event": "On December 10, 2020, Judge Sawan charged Caretaker Prime Minister Hassan Diab and three former ministers with criminal negligence.", "event_order": 12, "position": [1, 15]}, {"event": "Judge Fadi Sawan has led the investigation into the Beirut port explosion since August.", "event_order": 13, "position": [15]}, {"event": "In February 2021, the Court of Cassation removed Judge Sawan from the case, and Investigative Judge Tarek Bitar replaced him.", "event_order": 14, "position": [1]}, {"event": "On July 2, 2021, Judge Bitar requested parliament lift immunity for former ministers Khalil, Zeaiter, and Nohad Machnouk, and sought permission from bar associations to prosecute Khalil, Zeaiter, and Fenianos.", "event_order": 15, "position": [1]}, {"event": "On July 9, 2021, Interior Minister Mohammad Fehmi refused Bitar’s request to prosecute Ibrahim; Bitar appealed, but Cassation Attorney General Ghassan Khoury denied the request.", "event_order": 16, "position": [1]}, {"event": "On July 28-29, 2021, the Beirut and Tripoli Bar Associations approved Bitar’s requests to prosecute Khalil, Zeaiter, and Fenianos.", "event_order": 17, "position": [1]}]}
{"topic_id": 21, "topic": "Myanmar military stages coup, detains Aung San Suu Kyi and top officials", "answer": [{"event": "Aung San Suu Kyi led her party to landslide victories in 2015 and on November 8.", "event_order": 1, "position": [9]}, {"event": "In November 2020, the NLD won a resounding parliamentary election victory, awarding Aung San Suu Kyi a second term.", "event_order": 2, "position": [1]}, {"event": "The military repeatedly disputed the election results, alleging fraud and calling on the election commission to release polling data.", "event_order": 3, "position": [1]}, {"event": "The election commission denied widespread voter fraud.", "event_order": 4, "position": [1, 3, 7, 10]}, {"event": "A military spokesperson warned of \"action\" if the dispute wasn't settled and refused to rule out a coup.", "event_order": 5, "position": [1, 3, 13, 14]}, {"event": "China’s foreign minister Wang Yi visited Myanmar less than three weeks before the military coup.", "event_order": 6, "position": [15]}, {"event": "Myanmar’s military seized power on February 1, beginning a coup.", "event_order": 7, "position": [1, 3, 10]}, {"event": "The military detained Aung San Suu Kyi and other top government figures.", "event_order": 8, "position": [1, 2, 3, 5, 6, 7, 8, 9, 10, 13, 14]}, {"event": "The army announced power was handed to commander-in-chief Min Aung Hlaing and declared a national state of emergency for one year.", "event_order": 9, "position": [1, 2, 3, 5, 6, 7, 8, 10, 13, 14]}, {"event": "Vice President Myint Swe was installed as acting President.", "event_order": 10, "position": [1, 3, 14]}, {"event": "Myanmar’s military government removed 24 ministers and deputies and appointed 11 replacements.", "event_order": 11, "position": [2, 6, 7]}, {"event": "Widespread disruption occurred in internet and news access, and banks temporarily shut down across Myanmar following the coup.", "event_order": 12, "position": [1, 2, 5, 6, 7, 8, 13]}, {"event": "Doctors at several hospitals pledged to go on strike to protest the coup.", "event_order": 13, "position": [1]}, {"event": "International leaders and organizations condemned the military takeover in Myanmar.", "event_order": 14, "position": [1, 2, 3, 5, 6, 7, 8, 9, 13, 14]}, {"event": "Myanmar’s military imposed a nationwide 8pm to 6am curfew.", "event_order": 15, "position": [2, 6]}, {"event": "A Myanmar court convicted Aung San Suu Kyi and Sean Turnell to three years in jail for violating the official secrets act.", "event_order": 16, "position": [12]}]}
{"topic_id": 22, "topic": "Iranian General Qasem Soleimani killed by US drone strike in Baghdad", "answer": [{"event": "Jamal Jaafar al-Ibrahimi (Abu Mahdi al-Muhandis) fled to Iran after Saddam Hussein came to power.", "event_order": 1, "position": [1]}, {"event": "During the 1980s Iran-Iraq War, Muhandis fought on the side of Iran.", "event_order": 2, "position": [1]}, {"event": "After 2006, Muhandis founded Kataib Hezbollah.", "event_order": 3, "position": [1]}, {"event": "In 2007, U.S. commandos observed a convoy carrying Gen. Qassem Soleimani in northern Iraq.", "event_order": 4, "position": [12]}, {"event": "In 2015, the U.S. and five other nations signed a nuclear accord with Tehran.", "event_order": 5, "position": [12]}, {"event": "President Donald Trump withdrew the U.S. from the nuclear accord after taking office.", "event_order": 6, "position": [12]}, {"event": "On December 27, Kataib Hezbollah attacked the K1 military base near Kirkuk, killing an American contractor and wounding American and Iraqi personnel.", "event_order": 7, "position": [1, 7, 12]}, {"event": "On December 29, US forces conducted airstrikes at five Kataib Hezbollah facilities in Iraq and Syria, killing at least 25 people.", "event_order": 8, "position": [7, 10]}, {"event": "On December 31, pro-Iranian protesters attacked the US Embassy in Baghdad.", "event_order": 9, "position": [1, 7, 10]}, {"event": "US President Donald Trump ordered the assassination of Iranian General Qassem Soleimani.", "event_order": 10, "position": [3, 7, 12, 14]}, {"event": "A U.S. drone strike killed Iranian Maj. Gen. Qassem Soleimani and Abu Mahdi al-Muhandis after Muhandis picked up Soleimani from an airplane.", "event_order": 11, "position": [1, 2, 3, 6, 7, 8, 10, 12, 14]}, {"event": "Iran’s supreme leader Ayatollah Ali Khamenei warned the US of retaliation following Soleimani’s killing.", "event_order": 12, "position": [3, 10]}, {"event": "Iraqi caretaker Prime Minister Adel Abdul Mahdi condemned the US air raid as a violation of Iraq’s sovereignty.", "event_order": 13, "position": [3]}, {"event": "Iran announced it would suspend compliance with the 2015 nuclear deal while continuing to work with IAEA inspectors.", "event_order": 14, "position": [2, 10]}, {"event": "The Iraqi parliament voted to expel US troops from Iraq.", "event_order": 15, "position": [2, 7]}, {"event": "Iran launched ballistic missile attacks against Al Asad and Erbil air bases in Iraq used by US and coalition forces on Tuesday night.", "event_order": 16, "position": [6, 8]}, {"event": "The Pentagon suspended operations against ISIS in Iraq and Syria.", "event_order": 17, "position": [2]}, {"event": "UN Secretary-General António Guterres reiterated calls for de-escalation and dialogue after the missile attacks.", "event_order": 18, "position": [8]}]}
{"topic_id": 23, "topic": "Japan begins discharging treated Fukushima nuclear wastewater into ocean", "answer": [{"event": "A huge earthquake and tsunami in 2011 caused a meltdown at the Fukushima plant.", "event_order": 1, "position": [1]}, {"event": "TEPCO has used water to cool the nuclear fuel rods at Fukushima since 2011.", "event_order": 2, "position": [1]}, {"event": "Japan's cabinet approved a treated-water plan in 2021.", "event_order": 3, "position": [13]}, {"event": "The International Atomic Energy Agency (IAEA) issued a report in July 2023 confirming Fukushima’s release will have a negligible radiological effect.", "event_order": 4, "position": [7]}, {"event": "Japan announced its plan to release treated Fukushima wastewater into the sea.", "event_order": 5, "position": [1]}, {"event": "The Chinese government criticized Japan’s plan to release wastewater.", "event_order": 6, "position": [1]}, {"event": "Fishermen, including Haruo Ono, sued the Japanese government to stop the water release.", "event_order": 7, "position": [3]}, {"event": "China expanded its ban on seafood imports from Fukushima to include all of Japan.", "event_order": 8, "position": [3]}, {"event": "South Korea banned seafood imports from the Fukushima area.", "event_order": 9, "position": [5]}, {"event": "Protesters rallied in Tokyo on August 24, 2023, against the Japanese government’s plan to release treated wastewater from the Fukushima-Daiichi power plant.", "event_order": 10, "position": [2, 4]}, {"event": "Prime Minister Fumio Kishida announced Japan would begin discharging treated radioactive water from the Fukushima Daiichi plant into the sea as early as Thursday.", "event_order": 11, "position": [5, 9]}, {"event": "TEPCO began releasing the first batch of treated radioactive water into the Pacific Ocean.", "event_order": 12, "position": [2, 3, 4, 8, 12]}, {"event": "A TEPCO staff member activated a seawater pump and an operator confirmed the release.", "event_order": 13, "position": [2, 12]}, {"event": "The IAEA will maintain an on-site presence for the duration of the release.", "event_order": 14, "position": [7, 12]}, {"event": "China banned food imports from 10 Japanese prefectures and imposed radiation checks in response to the water release.", "event_order": 15, "position": [11]}, {"event": "The Japanese government allocated $200 million to compensate the fishing industry and $340 million for local economic mitigation.", "event_order": 16, "position": [5]}]}
{"topic_id": 24, "topic": "Halloween crowd crush in Seoul's Itaewon kills over 150 people", "answer": [{"event": "Tens of thousands of people gathered in Itaewon, Seoul, to celebrate Halloween on Saturday night.", "event_order": 1, "position": [4, 10]}, {"event": "Kim and her friend entered the alley at 8 p.m. and became trapped as the crowd density increased.", "event_order": 2, "position": [1]}, {"event": "A group of young men shoved down the hill, leading to people falling and Kim being buried in the crush.", "event_order": 3, "position": [1]}, {"event": "A deadly crowd surge occurred in a narrow alley in Seoul's Itaewon district on Saturday night.", "event_order": 4, "position": [13]}, {"event": "Emergency workers and pedestrians performed CPR on victims in the streets on Saturday night.", "event_order": 5, "position": [6, 9]}, {"event": "Kim and her friend crawled out of the crush and were pulled into a tavern by adults.", "event_order": 6, "position": [1]}, {"event": "At least 153 people were killed and dozens injured.", "event_order": 7, "position": [5, 6, 7]}, {"event": "Emergency workers from around the country were deployed to Itaewon to treat the injured.", "event_order": 8, "position": [2]}, {"event": "A temporary medical center was established in Itaewon for treating the injured.", "event_order": 9, "position": [2]}, {"event": "The U.S. State Department confirmed at least two U.S. citizens were among the dead.", "event_order": 10, "position": [6, 15]}, {"event": "Officials confirmed on Monday that the death toll rose to 154 and 149 people were injured.", "event_order": 11, "position": [4]}, {"event": "President Yoon Suk-yeol declared a period of national mourning and designated Itaewon a disaster zone.", "event_order": 12, "position": [4]}, {"event": "Seoul Mayor Oh Se-Hoon cut short a trip to Europe to return home.", "event_order": 13, "position": [2]}, {"event": "President Yoon Suk Yeol vowed to carry out a thorough investigation.", "event_order": 14, "position": [5]}, {"event": "World leaders, including Fumio Kishida, Joe Biden, and Xi Jinping, sent messages of condolence to President Yoon.", "event_order": 15, "position": [7]}, {"event": "Local governments established public mourning sites.", "event_order": 16, "position": [11]}, {"event": "Families of victims from the 2014 Sewol ferry disaster visited the Itaewon site.", "event_order": 17, "position": [11]}]}
{"topic_id": 25, "topic": "Yellow Vest movement sparks widespread protests over fuel taxes in France", "answer": [{"event": "The Macron government announced an increase in gas taxes effective January 1, 2019.", "event_order": 1, "position": [2]}, {"event": "On November 17, 2018, approximately 288,000 \"yellow vest\" protestors participated in a national blockade across France.", "event_order": 2, "position": [2]}, {"event": "The \"yellow vests\" movement caused roadblocks across France.", "event_order": 3, "position": [1, 3]}, {"event": "A protester was accidentally run over and killed by a car near Lyon during demonstrations.", "event_order": 4, "position": [1, 2, 3, 4]}, {"event": "227 people were injured in the protests, with six severely.", "event_order": 5, "position": [1, 4]}, {"event": "73 people were taken into police custody during the protests.", "event_order": 6, "position": [1]}, {"event": "On November 24, 2018, \"yellow vest\" protestors blocked the Champs Elysées in Paris, leading to confrontations.", "event_order": 7, "position": [2, 3, 4]}, {"event": "Authorities mobilized 3,000 officers and set up a security perimeter to contain 8,000 protesters and protect government buildings in Paris.", "event_order": 8, "position": [4]}, {"event": "Police used tear gas and water cannons to disperse protesters in Paris.", "event_order": 9, "position": [4]}, {"event": "130 people were arrested across France, including 42 in Paris.", "event_order": 10, "position": [4]}, {"event": "Prime Minister Edouard Philippe announced nearly 500 million euros in aid for low-income motorists.", "event_order": 11, "position": [1, 3]}, {"event": "On November 26, 2018, the first trials for those arrested on November 24 took place.", "event_order": 12, "position": [2]}, {"event": "French Interior Minister Christophe Castaner blamed the clashes on far-right extremists infiltrating demonstrations.", "event_order": 13, "position": [4]}]}
{"topic_id": 26, "topic": "Australia experiences its worst bushfire season in modern history", "answer": [{"event": "Bushfires ignited in Australia in September.", "event_order": 1, "position": [3]}, {"event": "Australia recorded its hottest day ever on Tuesday, with an average temperature of 40.9 degrees Celsius.", "event_order": 2, "position": [7]}, {"event": "Bushfires in New South Wales and Queensland destroyed CO2-absorbing vegetation.", "event_order": 3, "position": [2]}, {"event": "Satellite pictures confirmed smoke from eastern New South Wales fires crossed the Tasman Sea to New Zealand.", "event_order": 4, "position": [8]}, {"event": "The fires killed at least 24 people.", "event_order": 5, "position": [3]}, {"event": "The fires destroyed more than 1,400 homes.", "event_order": 6, "position": [3]}, {"event": "Bushfire smoke created smog in Sydney, causing air quality to reach 22 times worse than standard levels and causing respiratory problems for residents.", "event_order": 7, "position": [2]}, {"event": "Australia's military deployed ships and aircraft to rescue thousands trapped by fires.", "event_order": 8, "position": [3]}, {"event": "The most extreme pyroCb activity occurred on December 30, with eleven sub-events producing 25 pulses, at least 13 of which injected smoke into the lower stratosphere.", "event_order": 9, "position": [6]}, {"event": "The ANYSO stratospheric smoke persisted for at least 15 months through March 2021.", "event_order": 10, "position": [6]}, {"event": "The ANYSO plume ascended from 14–17 km to 34 km due to diabatic lofting, reaching the highest altitudes ever recorded for a wildfire smoke plume.", "event_order": 11, "position": [6]}, {"event": "Prime Minister Scott Morrison apologized for vacationing in Hawaii during the heatwave and bushfires.", "event_order": 12, "position": [3]}, {"event": "New South Wales announced new climate targets to reduce emissions by 35% by 2030.", "event_order": 13, "position": [2]}, {"event": "The Australian Federal Government committed to a 26-28% emissions reduction target on 2005 levels by 2030.", "event_order": 14, "position": [9]}, {"event": "Plans have been announced to build a large solar farm in the Northern Territory.", "event_order": 15, "position": [2]}]}
{"topic_id": 27, "topic": "UK Prime Minister Liz Truss resigns after economic turmoil", "answer": [{"event": "Boris Johnson resigned on July 7.", "event_order": 1, "position": [1, 10]}, {"event": "Liz Truss became UK Prime Minister on September 5.", "event_order": 2, "position": [1, 2, 4]}, {"event": "Queen Elizabeth II died on September 8.", "event_order": 3, "position": [4, 10]}, {"event": "Kwasi Kwarteng announced a mini-budget on September 23.", "event_order": 4, "position": [1, 2, 4, 12, 15]}, {"event": "The country's currency plummeted in value and government borrowing costs rose after the announcement.", "event_order": 5, "position": [2, 4, 12, 15]}, {"event": "The Bank of England intervened on September 28 by announcing a temporary purchase of £65 billion worth of long-dated UK government bonds.", "event_order": 6, "position": [4, 9, 12, 15]}, {"event": "Liz Truss fired Treasury chief Kwasi Kwarteng.", "event_order": 7, "position": [2, 4, 8, 12, 14, 15]}, {"event": "Jeremy Hunt reversed most mini-budget policies three weeks later.", "event_order": 8, "position": [1, 2, 4, 12, 15]}, {"event": "Home Secretary Suella Braverman resigned after breaching rules.", "event_order": 9, "position": [2, 4, 8, 12, 13]}, {"event": "Liz Truss announced her resignation as Prime Minister on October 20.", "event_order": 10, "position": [1, 2, 4, 5, 6, 9, 10, 12, 13, 14, 15]}, {"event": "The Conservative Party announced it would hold a leadership election within the next week.", "event_order": 11, "position": [1, 4, 6, 8, 9, 10, 13, 15]}]}
{"topic_id": 28, "topic": "Wagner Group launches short-lived mutiny against Russian military leadership", "answer": [{"event": "Prigozhin accused Defense Minister Sergei Shoigu of withholding ammunition and weapons from Wagner fighters in Ukraine.", "event_order": 1, "position": [11]}, {"event": "The Russian Defense Ministry ordered all mercenary groups, including Wagner, to report to central military command by July 1.", "event_order": 2, "position": [13]}, {"event": "Yevgeny Prigozhin recruited Deputy Defense Minister Mikhail Mizintsev in April.", "event_order": 3, "position": [1]}, {"event": "Prigozhin declared an armed rebellion.", "event_order": 4, "position": [7]}, {"event": "Wagner forces seized control of the military headquarters in Rostov-on-Don.", "event_order": 5, "position": [1, 2, 7, 8, 12, 13]}, {"event": "Wagner forces advanced towards Moscow with a column of armored vehicles.", "event_order": 6, "position": [2, 5, 7, 8, 10, 12, 13]}, {"event": "Russian military helicopters opened fire on the Wagner convoy.", "event_order": 7, "position": [7, 8]}, {"event": "Putin delivered a televised address accusing Prigozhin of treason.", "event_order": 8, "position": [1, 2, 7, 8]}, {"event": "Belarusian President Alexander Lukashenko brokered a deal for Prigozhin to leave Russia.", "event_order": 9, "position": [1, 2, 7, 8, 10, 12, 13]}, {"event": "Prigozhin negotiated his exit and called off his march on Moscow on Saturday afternoon.", "event_order": 10, "position": [1, 2, 7, 8, 10, 12, 13]}, {"event": "Wagner troops withdrew from Rostov, the Lipetsk region, and Moscow.", "event_order": 11, "position": [1, 2]}, {"event": "Prigozhin went into exile in Belarus.", "event_order": 12, "position": [2, 7, 8, 10, 13]}, {"event": "Russian President Vladimir Putin publicly acknowledged that the Wagner Group was entirely funded and supplied by the Russian state.", "event_order": 13, "position": [10]}, {"event": "General Sergei Surovikin was detained on charges of prior knowledge of the uprising.", "event_order": 14, "position": [5, 10]}, {"event": "Russian aviation officials said Mr. Prigozhin was listed on the flight manifest for a plane that crashed north of Moscow.", "event_order": 15, "position": [6]}]}
{"topic_id": 29, "topic": "Stablecoin.", "answer": [{"event": "In May 2022, TerraUSD collapsed and lost its dollar peg.", "event_order": 1, "position": [7, 12]}, {"event": "In November 2022, the FTX exchange failed.", "event_order": 2, "position": [7]}, {"event": "In March 2023, major stablecoins like USDC experienced brief de-pegging events due to banking sector stress.", "event_order": 3, "position": [7]}, {"event": "In 2024, the European Union adopted its Markets in Crypto-Assets (MiCA) regulation.", "event_order": 4, "position": [7]}, {"event": "In January 2025, the US issued an executive order promoting stablecoins and prohibiting central bank digital currencies.", "event_order": 5, "position": [7]}, {"event": "On April 2, 2025, the House Financial Services Committee voted 32-17 to advance the STABLE Act.", "event_order": 6, "position": [6]}, {"event": "On May 20, 2025, the Senate voted 66-32 to advance a modified version of the GENIUS Act.", "event_order": 7, "position": [6]}, {"event": "On June 17, 2025, the U.S. Senate passed the GENIUS Act.", "event_order": 8, "position": [3, 4, 9, 11]}, {"event": "Fiserv announced plans to roll out a new blockchain-based digital asset platform anchored by a U.S. dollar-pegged stablecoin, FIUSD.", "event_order": 9, "position": [15]}, {"event": "World Liberty Financial issued its own stablecoin.", "event_order": 10, "position": [12]}, {"event": "Circle debuted on the NYSE as CRCL, opening at $69 after shares were priced at $31.", "event_order": 11, "position": [9]}, {"event": "President Donald Trump established a national Bitcoin reserve.", "event_order": 12, "position": [9]}, {"event": "President Donald Trump pardoned Ross Ulbricht.", "event_order": 13, "position": [9]}, {"event": "Visa and Mastercard stock dropped approximately 5% on June 18th.", "event_order": 14, "position": [11]}, {"event": "Coinbase introduced its Coinbase Payments platform enabling merchants to accept USDC stablecoin payments.", "event_order": 15, "position": [11]}, {"event": "Walmart and Amazon are investigating issuing their own stablecoins in the U.S.", "event_order": 16, "position": [11]}, {"event": "The total market value of stablecoins increased from $20 billion in 2020 to $246 billion in May 2025.", "event_order": 17, "position": [12]}, {"event": "The U.S. Congress defined legal requirements for stablecoins, including HQLA, one-for-one backing, and audits.", "event_order": 18, "position": [5]}]}
{"topic_id": 30, "topic": "Killing of George Floyd by police sparks Black Lives Matter protests worldwide", "answer": [{"event": "Two Cup Foods employees confront George Floyd about using a counterfeit bill.", "event_order": 1, "position": [2]}, {"event": "Cup Foods employees call police and report George Floyd used fake bills and was drunk/uncontrolled.", "event_order": 2, "position": [2]}, {"event": "Officers Thomas Lane and J. Alexander Kueng arrive, handcuff Floyd, and move him to a police vehicle.", "event_order": 3, "position": [2]}, {"event": "Derek Chauvin keeps his knee on George Floyd's neck for over eight minutes, including after Floyd becomes unconscious, until EMTs intervene.", "event_order": 4, "position": [2]}, {"event": "George Floyd died on May 25, 2020, in Minneapolis under the knee of a White police officer.", "event_order": 5, "position": [1, 5, 13]}, {"event": "Video of George Floyd’s last moments circulated in May.", "event_order": 6, "position": [8]}, {"event": "Officials in Hennepin County ruled Floyd’s death a homicide on June 1, 2020.", "event_order": 7, "position": [1, 5]}, {"event": "The city fires all four officers.", "event_order": 8, "position": [2, 5, 12]}, {"event": "Derek Chauvin was arrested and charged with murder and manslaughter.", "event_order": 9, "position": [2, 5, 13]}, {"event": "Three former Minneapolis police officers were criminally charged with aiding and abetting second-degree murder in connection with Floyd's death, and Chauvin's charge was upgraded to second-degree murder.", "event_order": 10, "position": [5]}, {"event": "Widespread protests erupted across the nation, including at Lafayette Square in Washington, D.C.", "event_order": 11, "position": [1, 5, 8, 10, 12, 14]}, {"event": "Protesters overtook and destroyed the Minneapolis Police Department’s Third Precinct.", "event_order": 12, "position": [3, 7]}, {"event": "The Secret Service rushed President Trump and his family to a bunker after unrest outside the White House on May 29, 2020.", "event_order": 13, "position": [1]}, {"event": "Police attacked protesters using stun hand grenades, tear gas, rubber bullets, vehicles, and direct projectile fire.", "event_order": 14, "position": [3, 7, 12]}, {"event": "The district officially unveiled Black Lives Matter Plaza on June 5, 2020.", "event_order": 15, "position": [1, 3, 5]}, {"event": "The Los Angeles Mayor agreed to increase the LAPD budget cut to $150 million, to be redistributed to non-profit agencies.", "event_order": 16, "position": [3]}]}
{"topic_id": 31, "topic": "Me Too movement exposes widespread sexual harassment and assault", "answer": [{"event": "The first rape crisis center was founded in Washington, D.C., in 1972.", "event_order": 1, "position": [2]}, {"event": "Tarana Burke founded the 'Me Too' nonprofit organization in 2006.", "event_order": 2, "position": [2]}, {"event": "Harvey Weinstein invited Ashley Judd to a hotel and had her sent to his room.", "event_order": 3, "position": [1]}, {"event": "Harvey Weinstein appeared in a bathrobe and asked Ashley Judd for sexual favors.", "event_order": 4, "position": [1]}, {"event": "In 2014, Harvey Weinstein invited Emily Nestor to a hotel.", "event_order": 5, "position": [1]}, {"event": "In 2015, Harvey Weinstein badgered a female assistant into giving him a massage while he was naked.", "event_order": 6, "position": [1]}, {"event": "The New York Times published an investigation into Harvey Weinstein's sexual harassment on October 5, 2017.", "event_order": 7, "position": [2]}, {"event": "Women used social media to share sexual harassment experiences in October 2017, leading to the #MeToo movement going viral.", "event_order": 8, "position": [3]}, {"event": "French women launched the #BalanceTonPorc social media campaign, sharing stories of aggression and harassment.", "event_order": 9, "position": [4]}, {"event": "French President Emmanuel Macron announced Harvey Weinstein would be stripped of the Légion d’honneur.", "event_order": 10, "position": [4]}, {"event": "Women in media created an anonymously editable Google spreadsheet titled “SHITTY MEDIA MEN” to list men in media and allegations of inappropriate behavior.", "event_order": 11, "position": [15]}, {"event": "Time Magazine named 'the Silence Breakers' Person of the Year in December 2017.", "event_order": 12, "position": [2]}, {"event": "The Time’s Up initiative was announced on January 1, 2018.", "event_order": 13, "position": [2]}, {"event": "Harvey Weinstein was convicted of sexual assault and sentenced to 23 years in prison in February 2020.", "event_order": 14, "position": [2]}, {"event": "The Survivors’ Agenda initiative was launched on June 25, 2020.", "event_order": 15, "position": [2]}]}
{"topic_id": 33, "topic": "Amazon rainforest wildfires ravage millions of acres in Brazil", "answer": [{"event": "MAAP released a report revealing overlap between deforestation and fire alerts in the Brazilian Amazon.", "event_order": 1, "position": [1]}, {"event": "125,000 hectares of the Brazilian Amazon were cleared through 2019 and subsequently burned in August, mainly for agricultural conversion.", "event_order": 2, "position": [1]}, {"event": "Brazilian authorities are investigating 70 farmers and land grabbers in Pará for allegedly organizing an August 10 'Day of Fire.'", "event_order": 3, "position": [1]}, {"event": "Thousands of fires burned in the Amazon rainforest in Brazil in 2019, particularly affecting Roraima, Acre, Rondônia, and Amazonas states.", "event_order": 4, "position": [5]}, {"event": "Dozens of fires scorched and are spreading across large swaths of the Amazon.", "event_order": 5, "position": [2]}, {"event": "Fire hotspots in indigenous territories increased by 88% from January to August compared to 2018, according to CIMI citing INPE data.", "event_order": 6, "position": [1]}, {"event": "Bolsonaro replaced the director of Brazil’s National Institute of Space Research with a military official.", "event_order": 7, "position": [3]}, {"event": "The Brazilian government struggled to contain global outrage over its environmental policies.", "event_order": 8, "position": [2]}, {"event": "Germany and Norway withheld tens of millions of dollars from the Amazon Fund.", "event_order": 9, "position": [3]}, {"event": "French President Emmanuel Macron announced France’s withdrawal of support for the Mercosur trade deal.", "event_order": 10, "position": [3]}, {"event": "President Bolsonaro announced a 60-day ban on setting fires for land clearing and deployed 44,000 soldiers to seven states.", "event_order": 11, "position": [5]}, {"event": "Amazonas state in Brazil declared a state of emergency due to the fires.", "event_order": 12, "position": [5]}, {"event": "Bolivia hired a Boeing 747 supertanker from the US and accepted G7 aid to fight the fires.", "event_order": 13, "position": [5]}, {"event": "Bolivia has seen faster growth in the number of fires this year than Brazil.", "event_order": 14, "position": [6]}, {"event": "Peru has seen faster growth in the number of fires this year than Brazil.", "event_order": 15, "position": [6]}]}
{"topic_id": 34, "topic": "Wildfires destroy thousands of homes in California amid climate crisis", "answer": [{"event": "Humans ignited 97% of home-threatening wildfires in the wildland-urban interface between 1992 and 2015.", "event_order": 1, "position": [3]}, {"event": "California required rebuilding in high-risk wildfire areas to use fire-resistant materials over a decade ago.", "event_order": 2, "position": [15]}, {"event": "Wildfires in recent years destroyed thousands of homes.", "event_order": 3, "position": [3]}, {"event": "Wildfires across the West Coast have caused at least 24 deaths and placed hundreds of thousands under evacuation orders.", "event_order": 4, "position": [2]}, {"event": "The Almeda Fire burned hundreds of homes and businesses in Phoenix and Talent, Oregon.", "event_order": 5, "position": [2]}, {"event": "The Bear Fire in California killed at least 10 people and forced over 20,000 to flee.", "event_order": 6, "position": [2]}, {"event": "A fire consumed nearly every structure in the town of Malden, Washington.", "event_order": 7, "position": [2]}, {"event": "On September 10, 2020, a mobile home park was destroyed by fire in Phoenix, Oregon, causing hundreds of homes to be lost.", "event_order": 8, "position": [6]}, {"event": "Officials ordered the evacuation of Mollala and expanded evacuation zones in Clackamas County, Oregon due to wildfires.", "event_order": 9, "position": [11]}, {"event": "Federal fire officials called in the U.S. military for help with the wildfires.", "event_order": 10, "position": [2]}, {"event": "The August Complex in Tehama County became California's largest fire in history (746,607 acres) after a wind event caused it to expand.", "event_order": 11, "position": [2]}, {"event": "Over 3 million acres burned across California, Oregon, and Washington.", "event_order": 12, "position": [6]}, {"event": "The \"Bootleg\" fire forced hundreds of people from their homes.", "event_order": 13, "position": [4]}, {"event": "A wildfire in Nespelem, Washington, caused by lightning on July 12, burned seven homes and prompted the entire town to evacuate safely.", "event_order": 14, "position": [4]}, {"event": "Air quality along the West Coast deteriorated to harmful levels, with Portland registering the worst air globally and Seattle the third worst.", "event_order": 15, "position": [6]}, {"event": "Governor Newsom declared a state of emergency in Napa, Sonoma, and Shasta counties.", "event_order": 16, "position": [9]}, {"event": "The \"Bootleg\" fire destroyed 21 homes and threatened 1,926 more.", "event_order": 17, "position": [4]}, {"event": "The \"Bootleg\" fire caused a thick haze over Klamath Falls, leading to the fairgrounds being used as a Red Cross evacuation center.", "event_order": 18, "position": [4]}, {"event": "Trump authorized federal disaster aid for California and Oregon.", "event_order": 19, "position": [15]}]}
{"topic_id": 35, "topic": "UBS acquires struggling Credit Suisse during banking crisis", "answer": [{"event": "Credit Suisse experienced major financial losses and scandals, including top executives resigning in 2020 due to a spying scandal, a court finding of failed money laundering prevention, and a loss of over 7 billion Swiss francs in 2022.", "event_order": 1, "position": [3]}, {"event": "Credit Suisse customers withdrew over $133 billion in 2022.", "event_order": 2, "position": [3]}, {"event": "Credit Suisse announced material weaknesses in its financial reporting.", "event_order": 3, "position": [1, 4]}, {"event": "Saudi National Bank stated it would not increase funding to Credit Suisse.", "event_order": 4, "position": [3, 4]}, {"event": "Credit Suisse shares plunged to a record low after Saudi National Bank stated it would not invest more money.", "event_order": 5, "position": [4]}, {"event": "Investors and depositors withdrew billions from Credit Suisse.", "event_order": 6, "position": [1, 2, 7]}, {"event": "Credit Suisse stock prices dropped.", "event_order": 7, "position": [2, 4]}, {"event": "The Swiss central bank provided $54 billion to Credit Suisse.", "event_order": 8, "position": [1, 2, 4]}, {"event": "UBS offered to buy Credit Suisse for approximately $1 billion.", "event_order": 9, "position": [7]}, {"event": "Credit Suisse's board rebuffed the proposal from UBS.", "event_order": 10, "position": [7]}, {"event": "Swiss officials brokered an emergency takeover of Credit Suisse by UBS Group AG.", "event_order": 11, "position": [1, 4, 9]}, {"event": "UBS agreed to acquire Credit Suisse for 3 billion Swiss francs.", "event_order": 12, "position": [1, 2, 4, 8, 9, 11, 13]}, {"event": "Credit Suisse shareholders will receive one UBS share for every 22.48 Credit Suisse shares.", "event_order": 13, "position": [2, 8]}, {"event": "The Swiss National Bank pledged a loan of up to 100 billion Swiss francs to support the takeover.", "event_order": 14, "position": [1, 4, 7, 8]}, {"event": "The Swiss government granted a guarantee to assume up to 9 billion Swiss francs in losses from certain assets.", "event_order": 15, "position": [8, 9]}, {"event": "Finma wiped out $17 billion worth of Credit Suisse’s bonds and eliminated the need for UBS shareholders to vote on the deal.", "event_order": 16, "position": [7, 13]}, {"event": "The Swiss government ordered Credit Suisse to temporarily suspend bonus payments to staff.", "event_order": 17, "position": [11]}, {"event": "The chairmen of Credit Suisse and UBS announced a union on March 19th in Bern.", "event_order": 18, "position": [10]}, {"event": "Regulators expedited the merger process between Credit Suisse and UBS to avert a crisis.", "event_order": 19, "position": [10, 11, 13]}]}
{"topic_id": 36, "topic": "Silicon Valley Bank collapses, largest US bank failure since 2008", "answer": [{"event": "The Federal Reserve raised interest rates over the past year.", "event_order": 1, "position": [2, 11]}, {"event": "Silicon Valley Bank clients withdrew funds in recent months.", "event_order": 2, "position": [3]}, {"event": "Silicon Valley Bank (SVB) sold securities at a loss and announced a plan to sell $2.25 billion in new shares.", "event_order": 3, "position": [2, 5, 7, 11, 15]}, {"event": "SVB sold part of its bond holdings at a $1.8 billion loss.", "event_order": 4, "position": [3, 5, 7]}, {"event": "Many tech firms withdrew deposits from SVB following advice from venture capital firms.", "event_order": 5, "position": [2, 7, 11]}, {"event": "Silicon Valley Bank made emergency moves to handle withdrawal requests.", "event_order": 6, "position": [8]}, {"event": "Silicon Valley Bank's stock cratered.", "event_order": 7, "position": [2, 3, 7, 8]}, {"event": "Silicon Valley Bank suspended trading of its shares on Friday.", "event_order": 8, "position": [2, 3, 10, 15]}, {"event": "California regulators closed SVB and placed it under the control of the US Federal Deposit Insurance Corporation (FDIC).", "event_order": 9, "position": [2, 3, 5, 7, 11, 12, 15]}, {"event": "The FDIC took control of SVB and created the Deposit Insurance National Bank of Santa Clara.", "event_order": 10, "position": [3, 5, 12]}, {"event": "Silvergate announced it would wind down operations and liquidate.", "event_order": 11, "position": [2, 11]}, {"event": "Signature Bank failed after a bank run.", "event_order": 12, "position": [12, 15]}, {"event": "U.S. government regulators announced they would fully cover deposits at both SVB and Signature Bank.", "event_order": 13, "position": [12, 15]}, {"event": "US Treasury Secretary Janet Yellen called financial regulators together to discuss the situation.", "event_order": 14, "position": [2, 3, 7]}, {"event": "Saudi National Bank announced it would not increase its stake in Credit Suisse, causing Credit Suisse’s share prices to plummet.", "event_order": 15, "position": [12]}, {"event": "Credit Suisse announced it would borrow up to $54 billion from Switzerland’s central bank.", "event_order": 16, "position": [12]}]}
{"topic_id": 32, "topic": "Taliban regains control of Afghanistan after US withdrawal", "answer": [{"event": "Al-Qaeda terrorists attacked the US on September 11, 2001.", "event_order": 1, "position": [8]}, {"event": "The US launched a bombing campaign in Afghanistan in October 2001.", "event_order": 2, "position": [8]}, {"event": "The U.S. and the Taliban signed a peace agreement in Doha on February 29, 2020.", "event_order": 3, "position": [11]}, {"event": "The Trump administration brokered a cease-fire with the Taliban in early 2020, excluding the Afghan government.", "event_order": 4, "position": [6]}, {"event": "The U.S. and other countries began withdrawing their forces from Afghanistan on May 1.", "event_order": 5, "position": [15]}, {"event": "US troops began withdrawing from Afghanistan in early July.", "event_order": 6, "position": [2]}, {"event": "The Taliban began a massive offensive in early May 2021.", "event_order": 7, "position": [6]}, {"event": "U.S. troops left Bagram Airfield.", "event_order": 8, "position": [11]}, {"event": "Taliban militants captured several provincial capitals, including Zaranj, Sheberghan, Kunduz, Sar-e Pol, Taloqan, and Aybak, between August 6 and August 9.", "event_order": 9, "position": [15]}, {"event": "On August 15, 2021, Afghan President Ashraf Ghani fled the country.", "event_order": 10, "position": [6]}, {"event": "On August 15, 2021, the Taliban seized the presidential palace in Kabul and declared the war over.", "event_order": 11, "position": [6]}, {"event": "Taliban fighters spread across Kabul streets, riding motorbikes and driving seized police vehicles and Humvees.", "event_order": 12, "position": [1]}, {"event": "A suicide bombing claimed by ISIS-K killed nearly 200 Afghans and 13 U.S. service members outside Kabul's airport on August 26, 2021.", "event_order": 13, "position": [11]}, {"event": "The last U.S. military planes departed Afghanistan around midnight Monday (Kabul time), completing the withdrawal.", "event_order": 14, "position": [3]}, {"event": "Taliban fighters celebrated following the U.S. departure.", "event_order": 15, "position": [3]}]}
