{"topic_id": 2, "topic": "COVID-19 pandemic triggers global health crisis", "answer": [{"event": "The WHO was notified of a cluster of unusual pneumonia cases in Wuhan City, China on Dec. 31.", "event_order": 1, "position": [2]}, {"event": "Chinese authorities identified SARS-CoV-2 as the new coronavirus.", "event_order": 2, "position": [2]}, {"event": "The World Health Organization (WHO) officially declared the situation a pandemic on March 11, 2020.", "event_order": 3, "position": [7]}, {"event": "COVID-19 forced countries into lockdown.", "event_order": 4, "position": [1, 9]}, {"event": "The U.S. government mandated port and border closures and authorized immediate repatriation of asylum seekers on March 21.", "event_order": 5, "position": [7]}, {"event": "The Italian government called in the military to enforce its lockdown and ordered non-essential businesses to close by March 22.", "event_order": 6, "position": [7]}, {"event": "The Iranian government issued an intercity travel ban and closed schools, universities, national parks, and non-essential businesses on March 26.", "event_order": 7, "position": [7]}, {"event": "The United States indicted Nicolás Maduro with narco-terrorism and other serious charges on March 26.", "event_order": 8, "position": [7]}, {"event": "The coronavirus pandemic halted the global economy.", "event_order": 9, "position": [1, 6]}, {"event": "COVID-19 triggered a financial-market meltdown.", "event_order": 10, "position": [1]}, {"event": "The healthcare system shifted attention to COVID-19 patients, disrupting services for other medical conditions and resulting in many deaths.", "event_order": 11, "position": [9]}, {"event": "Clinical trials began to test potential treatments and vaccines for COVID-19.", "event_order": 12, "position": [2]}, {"event": "President Donald Trump signed a multibillion-dollar emergency aid package.", "event_order": 13, "position": [10]}, {"event": "Lockdowns triggered an increased risk of domestic violence.", "event_order": 14, "position": [9]}, {"event": "Lockdowns obstructed agricultural flow, resulting in hiked food prices, food shortages, malnutrition, and deaths.", "event_order": 15, "position": [9]}, {"event": "Many therapists cease in-person client sessions.", "event_order": 16, "position": [10]}, {"event": "President Vladimir Putin endorsed a proposal to remain in office until 2036.", "event_order": 17, "position": [8]}]}
{"topic_id": 5, "topic": "Elon Musk acquires Twitter, implements major reforms", "answer": [{"event": "Elon Musk signed a deal to acquire Twitter in April.", "event_order": 1, "position": [3]}, {"event": "Twitter sued Elon Musk to force the acquisition.", "event_order": 2, "position": [3]}, {"event": "The Delaware Chancery Court ordered a Friday deadline for the Twitter acquisition deal to close in early October.", "event_order": 3, "position": [3]}, {"event": "Elon Musk entered Twitter headquarters.", "event_order": 4, "position": [9]}, {"event": "Elon Musk changed his profile to ‘Chief Twit’.", "event_order": 5, "position": [9]}, {"event": "Elon Musk completed his $44 billion takeover of Twitter.", "event_order": 6, "position": [9]}, {"event": "Musk fired top Twitter executives.", "event_order": 7, "position": [3, 4, 5, 9]}, {"event": "Musk laid off thousands of Twitter employees and contractors.", "event_order": 8, "position": [4]}, {"event": "General Motors announced it would suspend its advertising on Twitter.", "event_order": 9, "position": [2]}, {"event": "Musk confirmed charging $8/month for Twitter Blue check marks and removed ID verification.", "event_order": 10, "position": [4]}, {"event": "Musk reinstated former President Donald Trump's Twitter account.", "event_order": 11, "position": [4]}, {"event": "On November 10, Musk stated bankruptcy was possible for Twitter if it didn't increase revenue.", "event_order": 12, "position": [4]}, {"event": "Musk issued an ultimatum requiring employees to work \"extremely hardcore\" or resign, leading to approximately 1,200 employee resignations.", "event_order": 13, "position": [4]}, {"event": "Musk suspended accounts of prominent journalists.", "event_order": 14, "position": [4]}, {"event": "On December 18, Musk ran a Twitter poll asking if he should step down as CEO, with a majority voting yes.", "event_order": 15, "position": [4]}, {"event": "On December 20, Musk confirmed he will step down as CEO upon finding a replacement and will manage software/servers teams.", "event_order": 16, "position": [4]}]}
{"topic_id": 6, "topic": "Trump re-elected as US President", "answer": [{"event": "The U.S. House impeached Trump, and the U.S. Senate acquitted him.", "event_order": 1, "position": [2]}, {"event": "Trump faced state and federal indictments in 2023.", "event_order": 2, "position": [2]}, {"event": "A New York jury found Trump guilty of 34 felony charges in May.", "event_order": 3, "position": [2]}, {"event": "Two assassination attempts targeted Donald Trump during the election season.", "event_order": 4, "position": [2]}, {"event": "The FBI warns of fabricated videos misusing its name and insignia.", "event_order": 5, "position": [9]}, {"event": "Donald Trump was elected the 47th president of the United States.", "event_order": 6, "position": [2]}, {"event": "Donald Trump won the popular vote by approximately four million votes.", "event_order": 7, "position": [10]}, {"event": "Trump sweeps all seven swing states, including Arizona.", "event_order": 8, "position": [4, 10]}, {"event": "Trump received more votes from Latino residents than any other Republican presidential candidate in history.", "event_order": 9, "position": [3]}, {"event": "Trump doubled his percentage of support among Black male voters in specific battleground states.", "event_order": 10, "position": [3]}, {"event": "Democrats won statewide offices in Arizona, North Carolina, Wisconsin, and Michigan.", "event_order": 11, "position": [5]}, {"event": "Arizona’s constitutional right to abortion amendment passed.", "event_order": 12, "position": [5]}, {"event": "Alaska’s minimum wage increase and sick leave requirement passed.", "event_order": 13, "position": [5]}, {"event": "New African American female senators, the first transgender representative, and the first LGBTQ+ representative from the South were elected.", "event_order": 14, "position": [5]}, {"event": "Trump signed a stimulus relief bill into law at the end of his first presidency.", "event_order": 15, "position": [3]}, {"event": "Joe Biden sent a second round of $1,200 relief checks.", "event_order": 16, "position": [3]}]}
{"topic_id": 7, "topic": "South Korean President Yoon Suk-yeol faces impeachment crisis", "answer": [{"event": "President Yoon Suk Yeol declared martial law on December 3 and sent soldiers to parliament.", "event_order": 1, "position": [2, 3, 4, 5, 8, 9]}, {"event": "Hundreds of soldiers stormed the National Assembly.", "event_order": 2, "position": [2, 3]}, {"event": "Lawmakers at the National Assembly unanimously annulled martial law.", "event_order": 3, "position": [3, 4, 5]}, {"event": "Baek Jae Gil performed his protest anthem for thousands outside the National Assembly in Seoul.", "event_order": 4, "position": [2]}, {"event": "Tens of thousands of protesters gathered outside the National Assembly in Seoul.", "event_order": 5, "position": [2, 5, 8]}, {"event": "Opposition legislators filed an impeachment motion against President Yoon on Wednesday.", "event_order": 6, "position": [3, 4]}, {"event": "Yoon's senior aides and defense minister offered to resign.", "event_order": 7, "position": [3, 4]}, {"event": "Lawmakers voted down the martial law decree.", "event_order": 8, "position": [4, 5]}, {"event": "The impeachment motion against President Yoon failed.", "event_order": 9, "position": [5, 8, 9]}, {"event": "South Korea’s parliament voted to impeach President Yoon Suk Yeol.", "event_order": 10, "position": [5]}, {"event": "President Yoon Suk Yeol was immediately suspended from exercising his powers.", "event_order": 11, "position": [5, 9]}, {"event": "Prime Minister Han Duck-soo became acting president.", "event_order": 12, "position": [5, 9]}, {"event": "Police, parliament, prosecutors, and the anti-corruption body launched separate investigations into Yoon on treason allegations.", "event_order": 13, "position": [5, 9]}, {"event": "Parliament impeached Yoon’s justice minister and police chief.", "event_order": 14, "position": [5]}, {"event": "South Korean prosecutors detained former defense minister Kim Yong-hyun, who allegedly recommended the martial law imposition.", "event_order": 15, "position": [5]}]}
{"topic_id": 8, "topic": "7.9 magnitude earthquake in Myanmar's Sagaing Region causes major casualties", "answer": [{"event": "A M7.7 earthquake struck Myanmar on March 28, 2025, followed by a M6.7 aftershock.", "event_order": 1, "position": [2, 3, 4, 8]}, {"event": "The earthquake affected Bangkok, Thailand, and tremors were felt in China's Yunnan province.", "event_order": 2, "position": [3, 8, 9]}, {"event": "The earthquake caused significant damage and displacement across Myanmar.", "event_order": 3, "position": [2, 3, 8]}, {"event": "A high-rise under construction collapsed in Bangkok, Thailand, causing casualties.", "event_order": 4, "position": [2, 8]}, {"event": "The earthquake caused the collapse of the Old Sagaing Bridge and several buildings.", "event_order": 5, "position": [9]}, {"event": "Mandalay General Hospital became full, stopped admitting patients, and lost power and water.", "event_order": 6, "position": [4]}, {"event": "Myanmar's ruling junta chief reported at least 144 people killed and over 732 injured.", "event_order": 7, "position": [8, 9]}, {"event": "Myanmar's military-dominated government issued a plea for outside help.", "event_order": 8, "position": [5, 8, 9]}, {"event": "The United Nations mobilized help for Myanmar on Friday.", "event_order": 9, "position": [5]}, {"event": "Authorities in Myanmar and Thailand declared a state of emergency.", "event_order": 10, "position": [2, 8, 9]}, {"event": "India sent approximately 15 tonnes of relief material to Myanmar via an IAF C-130J aircraft.", "event_order": 11, "position": [8]}, {"event": "By April 3, 2025, the death toll from the earthquake reached 4,390 in Myanmar, with over 5,490 injured.", "event_order": 12, "position": [2]}]}
{"topic_id": 9, "topic": "Elon Musk appointed US Department of Government Efficiency Minister", "answer": [{"event": "Elon Musk contributed $277 million to Trump's and other Republicans' 2024 campaigns.", "event_order": 1, "position": [4]}, {"event": "Trump appointed Elon Musk and Vivek Ramaswamy as co-leaders of the Department of Government Efficiency (DOGE).", "event_order": 2, "position": [4, 7, 9]}, {"event": "DOGE representatives spoke with staff at over a dozen federal agencies.", "event_order": 3, "position": [4]}, {"event": "Elon Musk and Vivek Ramaswamy increased hiring for DOGE.", "event_order": 4, "position": [4]}, {"event": "Mr. Trump stated DOGE's purpose is to advise on cutting wasteful spending.", "event_order": 5, "position": [1]}, {"event": "Mr. Musk stated DOGE participants will not be paid and requested they work 80-hour weeks.", "event_order": 6, "position": [1]}, {"event": "Musk allies took top positions in federal agencies.", "event_order": 7, "position": [8]}, {"event": "David Lebryk departed his position at the Treasury Department.", "event_order": 8, "position": [8]}, {"event": "OPM offered federal workers the option to resign with pay.", "event_order": 9, "position": [8]}, {"event": "Trump issued an order to halt federal grants.", "event_order": 10, "position": [8]}, {"event": "The order to halt federal grants was rescinded.", "event_order": 11, "position": [8]}, {"event": "Elon Musk tempered his initial promise for federal spending cuts from $2 trillion to $1 trillion.", "event_order": 12, "position": [4]}, {"event": "Vivek Ramaswamy withdrew from the project before Mr. Trump assumed office.", "event_order": 13, "position": [1]}, {"event": "Elon Musk gained full command of the federal cost-cutting effort.", "event_order": 14, "position": [1]}, {"event": "The United States Digital Service was renamed United States DOGE Service.", "event_order": 15, "position": [1]}]}
{"topic_id": 10, "topic": "US imposes widespread trade tariffs after Trump's re-election", "answer": [{"event": "William McKinley was shot by anarchist Leon Czolgosz on Sept. 6, 1901.", "event_order": 1, "position": [1]}, {"event": "William McKinley died on Sept. 14, 1901.", "event_order": 2, "position": [1]}, {"event": "The 16th Amendment was ratified in 1913.", "event_order": 3, "position": [1]}, {"event": "Trump previously applied a 25% tariff on many exports from Canada and Mexico.", "event_order": 4, "position": [2]}, {"event": "President Trump placed 25% tariffs on imports from Canada.", "event_order": 5, "position": [6]}, {"event": "Ontario placed a 25% tax on electricity exports to the U.S.", "event_order": 6, "position": [6]}, {"event": "President Trump announced a plan to impose additional 25% tariffs on Canadian steel and aluminum imports.", "event_order": 7, "position": [6]}, {"event": "Premier Ford paused Ontario's electricity surcharge.", "event_order": 8, "position": [6]}, {"event": "President Trump reversed his plan to raise tariffs on Canadian steel and aluminum imports.", "event_order": 9, "position": [6]}, {"event": "Tariffs on imported steel and aluminum are in effect.", "event_order": 10, "position": [4]}, {"event": "Trump imposed auto tariffs last week.", "event_order": 11, "position": [4]}, {"event": "Trump and Canadian Prime Minister Mark Carney had a call last week.", "event_order": 12, "position": [4]}, {"event": "President Trump announced a new tariff system on Wednesday, substituting America's longstanding import tax system.", "event_order": 13, "position": [2]}, {"event": "Trump announced tariffs on Chinese goods and any country buying oil from Venezuela.", "event_order": 14, "position": [4]}, {"event": "The new 10% tariffs will go into effect on Saturday, and reciprocal rates next Wednesday.", "event_order": 15, "position": [2]}, {"event": "The White House did not apply tariffs to Russia, North Korea, Cuba, and Belarus.", "event_order": 16, "position": [2]}, {"event": "The tariff announcement triggered a global meltdown in stock markets.", "event_order": 17, "position": [2]}, {"event": "The S&P 500 fell below its 200-day moving average on Monday.", "event_order": 18, "position": [7]}, {"event": "Delta Air Lines, Southwest Airlines, and American Airlines lowered their Q1 projections.", "event_order": 19, "position": [7]}, {"event": "The US Senate will likely vote on Wednesday on a bill to halt Trump’s tariffs on Canadian imports.", "event_order": 20, "position": [3]}]}
